Repository: kartalbas/flutter-gitui
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# dropStashConfirm
source: Drop {stashRef}? This action cannot be undone.
ar: إسقاط {stashRef}؟ لا يمكن التراجع عن هذا الإجراء.
de: {stashRef} verwerfen? Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Descartar {stashRef}? Esta acción no se puede deshacer.
fr: Abandonner {stashRef}? Cette action ne peut pas être annulée.
it: Eliminare {stashRef}?\n\nQuesta azione non può essere annullata.
ru: Удалить {stashRef}? Это действие нельзя отменить.
tr: {stashRef} bırakılsın mı? Bu işlem geri alınamaz.
zh: 丢弃 {stashRef}? 此操作无法撤销。

# stashDiffTitle
source: Stash Diff - {stashRef}
ar: مقارنة المخزون - {stashRef}
es: Diferencias de stash - {stashRef}
fr: Diff du Stash - {stashRef}
it: Diff dello Stash - {stashRef}
ru: Различия Stash - {stashRef}
tr: Stash Farkı - {stashRef}
zh: 储藏差异 - {stashRef}

# createStashDialog
source: Create Stash
ar: إنشاء مخزون
de: Stash erstellen
es: Crear stash
fr: Créer un stash
it: Crea Stash
ru: Создать Stash
tr: Stash Oluştur
zh: 创建储藏

# describeWork
source: Describe what you were working on...
ar: صف ما كنت تعمل عليه...
de: Beschreiben Sie, woran Sie gearbeitet haben...
es: Describa en qué estaba trabajando
fr: Décrivez ce sur quoi vous travailliez...
it: Descrivi su cosa stavi lavorando...
ru: Опишите, над чем вы работали...
tr: Üzerinde çalıştığınız şeyi açıklayın
zh: 描述您正在进行的工作...

# stashAllFilesToggle
source: Toggle to select specific files
ar: التبديل لتحديد ملفات محددة
de: Umschalten, um bestimmte Dateien auszuwählen
es: Stash de todos los archivos
fr: Basculer pour sélectionner des fichiers spécifiques
it: Attiva per selezionare file specifici
ru: Переключить для выбора конкретных файлов
tr: Tüm dosyaları stash'le
zh: 储藏所有文件

# keepStagedChangesSubtitle
source: Keep changes in the index after stashing
ar: الاحتفاظ بالتغييرات في الفهرس بعد التخزين
de: Änderungen im Index nach dem Stashen behalten
es: Mantener cambios en el índice después del stash
fr: Conserver les modifications dans l'index après le stash
it: Mantieni le modifiche nell'indice dopo lo stash
ru: Сохранить изменения в индексе после stash
tr: Stash'ten sonra değişiklikleri indekste tut
zh: 储藏后在索引中保留暂存的更改

# createTagDialog
source: Create Tag
ar: إنشاء وسم
de: Tag erstellen
es: Crear etiqueta
fr: Créer un tag
it: Crea Tag
ru: Создать тег
tr: Etiket Oluştur
zh: 创建标签

# createNewTagAtHead
source: Create a new tag at the current HEAD
ar: إنشاء وسم جديد عند HEAD الحالي
de: Einen neuen Tag am aktuellen HEAD erstellen
es: Crear nueva etiqueta en HEAD
fr: Créer un nouveau tag au HEAD actuel
it: Crea un nuovo tag all'HEAD corrente
ru: Создать новый тег на текущем HEAD
tr: Mevcut HEAD'de yeni bir etiket oluştur
zh: 在当前 HEAD 创建新标签

# releaseNotesHint
source: Release notes or description...
ar: ملاحظات الإصدار أو الوصف...
de: Release-Notizen oder Beschreibung...
es: Notas de versión...
fr: Notes de version ou description...
it: Note di rilascio o descrizione...
ru: Заметки о выпуске или описание...
tr: Sürüm notları veya açıklama...
zh: 发布说明或描述...

# deleteTagsDialog
source: Delete Tags?
ar: حذف الوسوم؟
de: Tags löschen?
es: ¿Eliminar etiquetas?
fr: Supprimer les tags?
it: Eliminare i Tag?
ru: Удалить теги?
tr: Etiketler Silinsin mi?
zh: 删除标签

# deleteTagsConfirm
source: Delete {count, plural, =1{{count} tag} other{{count} tags}}? This action cannot be undone. Tags to delete: {tagList}{ellipsis}
ar: حذف {count, plural, =1{وسم واحد} other{{count} وسوم}}؟ لا يمكن التراجع عن هذا الإجراء. الوسوم المراد حذفها: {tagList}{ellipsis}
de: {count, plural, =1{{count} Tag} other{{count} Tags}} löschen? Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Eliminar {count, plural, =1{{count} etiqueta} other{{count} etiquetas}}? Esta acción no se puede deshacer. Etiquetas a eliminar: {tagList}{ellipsis}
fr: Supprimer {count, plural, =1{{count} tag} other{{count} tags}}? Cette action ne peut pas être annulée. Tags à supprimer: {tagList}{ellipsis}
it: Eliminare {count, plural, =1{{count} tag} other{{count} tag}}?\n\nQuesta azione non può essere annullata.\n\nTag da eliminare:\n{tagList}{ellipsis}
ru: Удалить {count, plural, =1{{count} тег} other{{count} тегов}}? Это действие нельзя отменить. Теги для удаления: {tagList}{ellipsis}
tr: {count, plural, =1{{count} etiket} other{{count} etiket}} silinsin mi? Bu işlem geri alınamaz.
zh: 删除 {count, plural, =1{{count} 个标签} other{{count} 个标签}}?

# deleteFromRemoteSubtitle
source: Delete tags from remote repository to prevent them from coming back when fetching
ar: حذف الوسوم من المستودع البعيد لمنع عودتها عند الجلب
de: Tags vom Remote-Repository löschen, um zu verhindern, dass sie beim Abrufen zurückkommen
es: Eliminar del repositorio remoto
fr: Supprimer les tags du dépôt distant pour éviter qu'ils ne reviennent lors de la récupération
it: Elimina i tag dal repository remoto per evitare che tornino durante il fetch
ru: Удалить теги из удалённого репозитория, чтобы они не вернулись при загрузке
tr: Etiketleri uzak depodan silin, getirme sırasında geri gelmelerini önleyin
zh: 从远程仓库删除标签以防止获取时返回

# checkoutTagDialog
source: Checkout Tag?
ar: سحب الوسم؟
de: Tag auschecken?
es: ¿Hacer checkout de etiqueta?
fr: Checkout du tag?
it: Checkout del Tag?
ru: Переключиться на тег?
tr: Etiket Checkout Edilsin mi?
zh: 检出标签?

# checkoutTagConfirm
source: Checkout tag "{tagName}"? This will put you in a detached HEAD state.
ar: سحب الوسم "{tagName}"؟ سيؤدي هذا إلى وضعك في حالة HEAD منفصل.
de: Tag "{tagName}" auschecken? Dies versetzt Sie in einen detached HEAD-Zustand.
es: ¿Hacer checkout de la etiqueta "{tagName}"? Esto lo dejará en un estado de HEAD separado.
fr: Checkout du tag "{tagName}"? Cela vous placera dans un état HEAD détaché.
it: Checkout del tag "{tagName}"?\n\nQuesto ti metterà in uno stato HEAD scollegato.
ru: Переключиться на тег "{tagName}"? Это переведёт вас в состояние отделённого HEAD.
tr: "{tagName}" etiketi checkout edilsin mi? Bu sizi ayrık HEAD durumuna getirecektir.
zh: 检出标签 "{tagName}"? 这将使您进入分离 HEAD 状态。

# selectRemoteDialog
source: Select Remote
ar: اختر المستودع البعيد
de: Remote auswählen
es: Seleccionar remoto
fr: Sélectionner un distant
it: Seleziona Remoto
ru: Выберите удалённый репозиторий
tr: Uzak Seç
zh: 选择远程

# advancedFiltersDialog
source: Advanced Filters
ar: مرشحات متقدمة
de: Erweiterte Filter
es: Filtros avanzados
fr: Filtres avancés
it: Filtri Avanzati
ru: Расширенные фильтры
tr: Gelişmiş Filtreler
zh: 高级筛选

# enableRegexPatternMatching
source: Enable regex pattern matching in search
ar: تفعيل البحث بالتعبيرات النمطية
de: Regex-Musterabgleich in der Suche aktivieren
es: Habilitar coincidencia de patrones regex
fr: Activer la correspondance de motif regex dans la recherche
it: Abilita la corrispondenza dei pattern regex nella ricerca
ru: Включить сопоставление с регулярными выражениями в поиске
tr: Aramada regex kalıp eşleştirmeyi etkinleştir
zh: 在搜索中启用正则表达式模式匹配

source: Start Date
ar: تاريخ البداية
de: Startdatum
es: Fecha de inicio
fr: Date de début
it: Data Inizio
ru: Дата начала
tr: Başlangıç Tarihi
zh: 开始日期

source: End Date
ar: تاريخ النهاية
de: Enddatum
es: Fecha final
fr: Date de fin
it: Data Fine
ru: Дата окончания
tr: Bitiş Tarihi
zh: 结束日期

# squashCommitsDialog
source: Squash Commits
ar: دمج التثبيتات
de: Commits squashen
es: Comprimir commits
fr: Fusionner les commits
it: Comprimi Commit
ru: Объединить коммиты
tr: Commit'leri Squash Et
zh: 压缩提交

# squashingCommitsCount
source: Squashing {count} commits into one:
ar: دمج {count} تثبيت
de: {count} Commits werden zu einem gesquasht:
es: Comprimiendo {count} commits...
fr: Fusion de {count} commits en un:
it: Compressione di {count} commit in uno:
ru: Объединение {count} коммитов в один:
tr: {count} commit squash ediliyor...
zh: 正在压缩 {count} 个提交

source: New commit message:
ar: رسالة التثبيت الجديدة
de: Neue Commit-Nachricht:
es: Nuevo mensaje de commit
fr: Nouveau message de commit:
it: Nuovo messaggio di commit:
ru: Новое сообщение коммита:
tr: Yeni Commit Mesajı
zh: 新提交消息

# enterCommitMessageForSquashed
source: Enter the commit message for the squashed commit
ar: أدخل رسالة التثبيت للتثبيتات المدمجة
de: Geben Sie die Commit-Nachricht für den gesquashten Commit ein
es: Introduzca mensaje de commit para commits comprimidos
fr: Entrez le message de commit pour le commit fusionné
it: Inserisci il messaggio di commit per il commit compresso
ru: Введите сообщение коммита для объединённого коммита
tr: Squash edilmiş commit için bir mesaj girin
zh: 输入压缩提交的消息

# squashCommitsInfo
source: This will combine the selected commits into a single commit with the new message.
ar: سيتم دمج التثبيتات المحددة في تثبيت واحد
de: Dies kombiniert die ausgewählten Commits zu einem einzigen Commit mit einer neuen Nachricht.
es: Seleccione commits consecutivos para comprimir en uno solo
fr: Cela combinera les commits sélectionnés en un seul commit avec le message fourni.
it: Questo combinerà i commit selezionati in un unico commit con il nuovo messaggio.
ru: Это объединит выбранные коммиты в один коммит с новым сообщением.
tr: Seçili commit'ler tek bir commit'te birleştirilecek
zh: 这将把选定的提交合并为单个提交

# selectedCommitsMustBeConsecutive
source: Selected commits must be next to each other in the timeline (no gaps between them)
ar: يجب أن تكون التثبيتات المحددة متتالية
de: Ausgewählte Commits müssen in der Zeitleiste nebeneinander sein (keine Lücken)
es: Los commits seleccionados deben ser consecutivos
fr: Les commits sélectionnés doivent être consécutifs dans l'historique
it: I commit selezionati devono essere consecutivi nella timeline (senza gap tra loro)
ru: Выбранные коммиты должны идти последовательно во времени (без пропусков между ними)
tr: Seçili commit'ler ardışık olmalıdır
zh: 选定的提交必须是连续的

# cannotSquashRootCommit
source: Cannot squash: The oldest selected commit is the root commit (no parent exists)
ar: لا يمكن دمج التثبيت الجذري
de: Squash nicht möglich: Der älteste ausgewählte Commit ist der Root-Commit (kein Parent vorhanden)
es: No se puede comprimir el commit raíz
fr: Impossible de fusionner: Le commit sélectionné le plus ancien est le commit racine (aucun parent n'existe)
it: Impossibile comprimere: Il commit più vecchio selezionato è il commit radice (nessun genitore esiste)
ru: Невозможно объединить: Самый старый выбранный коммит является корневым коммитом (нет родительского коммита)
tr: Squash yapılamaz: En eski seçili commit kök commit'tir (üst commit yok)
zh: 无法压缩: 最早选择的提交是根提交 (不存在父提交)

source: Commit message cannot be empty
ar: لا يمكن أن تكون رسالة التثبيت فارغة
de: Commit-Nachricht darf nicht leer sein
es: El mensaje de commit no puede estar vacío
fr: Le message du commit ne peut pas être vide
it: Il messaggio di commit non può essere vuoto
ru: Сообщение коммита не может быть пустым
tr: Commit mesajı boş olamaz
zh: 提交消息不能为空

# failedToSquashCommits
source: Failed to squash commits: {error}
ar: فشل دمج التثبيتات
de: Fehler beim Squashen der Commits: {error}
es: Error al comprimir commits: {error}
fr: Échec de la fusion des commits: {error}
it: Impossibile comprimere i commit: {error}
ru: Не удалось объединить коммиты: {error}
tr: Commit'leri squash etme başarısız: {error}
zh: 压缩提交失败: {error}

source: Squash Commits
ar: دمج Commits
de: Commits zusammenfassen
es: Aplastar commits
fr: Écraser les commits
it: Unisci commit
ru: Объединить коммиты
tr: Commit'leri Birleştir
zh: 压缩提交

source: Reset to Commit
ar: إعادة التعيين إلى التثبيت
de: Auf Commit zurücksetzen
es: Reset a commit
fr: Réinitialiser au commit
it: Reset a questo Commit
ru: Сбросить до коммита
tr: Commit'e Sıfırla
zh: 重置到提交

source: Reset current branch to:
ar: إعادة تعيين الفرع الحالي إلى {commitHash}
de: Aktuellen Branch zurücksetzen auf:
es: Restablecer rama actual a:
fr: Réinitialiser la branche actuelle à:
it: Reset del branch corrente a:
ru: Сбросить текущую ветку до:
tr: Mevcut dalı şu konuma sıfırla
zh: 将当前分支重置到

source: Choose reset mode:
ar: اختر وضع إعادة التعيين
de: Reset-Modus wählen:
es: Elegir modo de reset
fr: Choisissez le mode de réinitialisation:
it: Scegli la modalità di reset:
ru: Выберите режим сброса:
tr: Sıfırlama modunu seçin:
zh: 选择重置模式:

# branchPointerWillMove
source: This will move the branch pointer to this commit.
ar: سينتقل مؤشر الفرع إلى التثبيت المحدد
de: Dies verschiebt den Branch-Pointer zu diesem Commit.
es: El puntero de rama se moverá a este commit
fr: Cela déplacera le pointeur de la branche vers ce commit.
it: Questo sposterà il puntatore del branch a questo commit.
ru: Это переместит указатель ветки на этот коммит.
tr: Bu, dal işaretçisini bu commit'e taşıyacaktır.
zh: 这将移动分支指针到此提交。

source: Soft
ar: ناعم
fr: Douce
it: Morbido
ru: Мягкий
zh: 软

# keepChangesStagedSoft
source: keep changes staged
ar: الاحتفاظ بالتغييرات محضرة (ناعم)
de: Änderungen gestaget behalten
es: Mantener cambios preparados (soft)
fr: conserver les modifications indexées
it: mantieni le modifiche in stage
ru: сохранить изменения проиндексированными
tr: Değişiklikleri tut (hazırlanmış)
zh: 保留更改已暂存 (软)

source: Mixed
ar: مختلط
fr: Mixte
it: Misto
ru: Смешанный
zh: 混合

# keepChangesUnstagedMixed
source: keep changes unstaged
ar: الاحتفاظ بالتغييرات غير محضرة (مختلط)
de: Änderungen ungestaget behalten
es: Mantener cambios sin preparar (mixed)
fr: conserver les modifications non indexées
it: mantieni le modifiche non in stage
ru: сохранить изменения непроиндексированными
tr: Değişiklikleri tut (hazırlanmamış)
zh: 保留更改未暂存 (混合)

source: Hard
ar: صارم
fr: Forte
it: Duro
ru: Жёсткий
zh: 硬

# discardAllChangesHard
source: discard all changes
ar: تجاهل جميع التغييرات (صارم)
de: alle Änderungen verwerfen
es: Descartar todos los cambios (hard reset)
fr: abandonner toutes les modifications
it: scarta tutte le modifiche
ru: отменить все изменения
tr: Tüm değişiklikleri at
zh: 丢弃所有更改 (硬)

source: Push Rejected
ar: تم رفض الدفع
de: Push abgelehnt
es: Push rechazado
fr: Push refusé
it: Push Rifiutato
ru: Отправка отклонена
tr: Push Reddedildi
zh: 推送被拒绝

# pushRejectedHistoryRewritten
source: Your push was rejected because you've rewritten history (e.g., by squashing commits).
ar: تم رفض الدفع: تمت إعادة كتابة السجل
de: Ihr Push wurde abgelehnt, weil Sie den Verlauf umgeschrieben haben (z.B. durch Rebase oder Amend).
es: Push rechazado: El historial ha sido reescrito
fr: Push refusé car l'historique a été réécrit
it: Il tuo push è stato rifiutato perché hai riscritto la cronologia (es., comprimendo i commit).
ru: Ваша отправка была отклонена, потому что вы переписали историю (например, объединив коммиты).
tr: Push reddedildi çünkü uzak geçmişi yeniden yazılmış
zh: 推送被拒绝 - 远程历史已重写

# needToForcePushChanges
source: To push these changes, you need to force push.
ar: تحتاج إلى فرض الدفع لإرسال التغييرات
de: Um diese Änderungen zu pushen, müssen Sie Force Push verwenden.
es: Necesita hacer force push de los cambios
fr: Pour pousser ces modifications, vous devez faire un push forcé.
it: Per pushare queste modifiche, devi eseguire un force push.
ru: Чтобы отправить эти изменения, вам нужно выполнить принудительную отправку.
tr: Değişikliklerinizi push etmek için zorla push yapmanız gerekir
zh: 您需要强制推送更改

# forcePushWarningOverwriteRemote
source: Warning: Force pushing will overwrite the remote history!
ar: سيؤدي فرض الدفع إلى استبدال سجل المستودع البعيد
de: Warnung: Force Push überschreibt den Remote-Verlauf!
es: Advertencia: El force push sobrescribirá el historial remoto
fr: Attention: Le push forcé écrasera l'historique distant!
it: Attenzione: Il force push sovrascriverà la cronologia remota!
ru: Внимание: Принудительная отправка перезапишет удалённую историю!
tr: Zorla push uzaktaki değişikliklerin üzerine yazacaktır
zh: 警告: 强制推送将覆盖远程更改!

# forcePushOnlyIfAlone
source: Only do this if you're working alone or have coordinated with your team
ar: افعل هذا فقط إذا كنت المطور الوحيد الذي يعمل على هذا الفرع
de: Tun Sie dies nur, wenn Sie alleine arbeiten oder sich mit Ihrem Team abgestimmt haben
es: Solo haga force push si está seguro de que nadie más está trabajando en esta rama
fr: Faites cela uniquement si vous travaillez seul ou si vous êtes coordonné avec l'équipe
it: Fallo solo se stai lavorando da solo o hai coordinato con il tuo team
ru: Делайте это только если работаете в одиночку или согласовали с командой
tr: Sadece bu dalda yalnız çalıştığınızdan eminseniz zorla push yapın
zh: 仅当您是此分支的唯一开发者时才强制推送

# forcePushOthersNeedReset
source: Others will need to reset their local branches
ar: سيحتاج المطورون الآخرون إلى إعادة تعيين فروعهم المحلية
de: Andere müssen ihre lokalen Branches zurücksetzen
es: Otros colaboradores necesitarán hacer reset de sus ramas locales
fr: Les autres devront réinitialiser leurs branches locales
it: Gli altri dovranno resettare i loro branch locali
ru: Другим потребуется сбросить их локальные ветки
tr: Zorla push yaptıktan sonra başkaları kendi kopyalarını sıfırlamalıdır
zh: 强制推送后,其他开发者将需要重置其本地分支

# forcePushCannotBeEasilyUndone
source: This cannot be easily undone
ar: لا يمكن التراجع عن فرض الدفع بسهولة
de: Dies kann nicht einfach rückgängig gemacht werden
es: El force push no se puede deshacer fácilmente
fr: Cela ne peut pas être facilement annulé
it: Questa azione non può essere annullata facilmente
ru: Это действие сложно отменить
tr: Zorla push kolayca geri alınamaz
zh: 强制推送无法轻松撤销

source: Force Push
ar: فرض الدفع
fr: Push forcé
it: Push Forzato
ru: Принудительная отправка
tr: Zorla Push
zh: 强制推送

source: Uncommitted Changes
ar: تغييرات غير مثبتة
de: Nicht committete Änderungen
es: Cambios sin confirmar
fr: Modifications non validées
it: Modifiche Non Committate
ru: Незафиксированные изменения
tr: Commit edilmemiş değişiklikler
zh: 未提交的更改

# youHaveUncommittedChanges
source: You have {changeCount} uncommitted change{plural}. Switching branches may cause data loss. Please commit or stash your changes first.
ar: لديك تغييرات غير مثبتة في دليل العمل الخاص بك
de: Sie haben {changeCount} nicht committete Änderung{plural}. Der Wechsel verwirft diese Änderungen.
es: Tiene {changeCount} cambio{plural} sin confirmar. Cambiar de rama puede causar pérdida de datos. Por favor, confirme o haga stash de sus cambios primero.
fr: Vous avez des modifications non validées
it: Hai {changeCount} modifica{plural} non committata.\n\nCambiare branch potrebbe causare perdita di dati. Committa o salva in stash le tue modifiche prima.
ru: У вас есть {changeCount} незафиксированное изменение{plural}. Переключение веток может привести к потере данных. Пожалуйста, зафиксируйте или отложите ваши изменения сначала.
tr: Commit edilmemiş değişiklikleriniz var
zh: 您有未提交的更改

source: Switch Anyway
ar: التبديل على أي حال
de: Trotzdem wechseln
es: Cambiar de todas formas
fr: Changer quand même
it: Cambia Comunque
ru: Переключить в любом случае
tr: Yine de Değiştir
zh: 仍然切换

source: Branch Switch Failed
ar: فشل تبديل الفرع
de: Branch-Wechsel fehlgeschlagen
es: Error al cambiar de rama
fr: Échec du changement de branche
it: Cambio Branch Fallito
ru: Не удалось переключить ветку
tr: Dal Değiştirme Başarısız
zh: 分支切换失败

# failedToSwitchToBranch
source: Failed to switch to branch "{branchName}": {error}
ar: فشل التبديل إلى الفرع {branchName}
de: Fehler beim Wechseln zu Branch "{branchName}": {error}
es: Error al cambiar a la rama {branchName}: {error}
fr: Échec du basculement vers la branche "{branchName}": {error}
it: Impossibile passare al branch "{branchName}":\n\n{error}
ru: Не удалось переключиться на ветку "{branchName}": {error}
tr: "{branchName}" dalına geçiş başarısız: {error}
zh: 切换到分支失败

source: General Search
ar: بحث عام
de: Allgemeine Suche
es: Búsqueda general
fr: Recherche générale
it: Ricerca Generale
ru: Общий поиск
tr: Genel Arama
zh: 常规搜索

# searchInCommitOrAuthorOrHash
source: Search in commit message, author, or hash...
ar: البحث في رسالة التثبيت أو المؤلف أو التجزئة
de: In Commit-Nachricht, Autor oder Hash suchen...
es: Buscar en commit, autor o hash
fr: Rechercher dans le commit, l'auteur ou le hash
it: Cerca nel messaggio di commit, autore o hash...
ru: Поиск в сообщении коммита, авторе или хеше...
tr: Commit mesajı, yazar veya hash'te ara
zh: 在提交消息、作者或哈希中搜索

source: Case sensitive
ar: حساس لحالة الأحرف
de: Groß-/Kleinschreibung beachten
es: Distinguir mayúsculas/minúsculas
fr: Sensible à la casse
it: Sensibile alle maiuscole
ru: Учитывать регистр
tr: Büyük/küçük harf duyarlı
zh: 区分大小写

source: Regular expression
ar: تعبير نمطي
de: Regulärer Ausdruck
es: Expresión regular
fr: Expression régulière
it: Espressione regolare
ru: Регулярное выражение
tr: Düzenli İfade
zh: 正则表达式

source: Fuzzy match
ar: مطابقة غير دقيقة
de: Unscharf übereinstimmen
es: Coincidencia difusa
fr: Correspondance floue
it: Corrispondenza fuzzy
ru: Нечёткое сопоставление
tr: Benzer Eşleşme
zh: 模糊匹配

source: Specific Filters
ar: مرشحات محددة
de: Spezifische Filter
es: Filtros específicos
fr: Filtres spécifiques
it: Filtri Specifici
ru: Специфические фильтры
tr: Özel Filtreler
zh: 特定筛选

# authorLabel
source: Author
ar: المؤلف
de: Autor
es: Autor
fr: Auteur
it: Autore
ru: Автор
tr: Yazar
zh: 作者

source: Filter by author name or email
ar: التصفية حسب اسم المؤلف أو البريد الإلكتروني
de: Nach Autorenname oder E-Mail filtern
es: Filtrar por nombre o email de autor
fr: Filtrer par nom ou email de l'auteur
it: Filtra per nome o email dell'autore
ru: Фильтр по имени или email автора
tr: Yazar adı veya e-postasına göre filtrele
zh: 按作者名称或邮箱筛选

# committerLabel
source: Committer
ar: المثبت
fr: Valideur
it: Autore Commit
ru: Фиксатор
zh: 提交者

source: Filter by committer name or email
ar: التصفية حسب اسم المثبت أو البريد الإلكتروني
de: Nach Committer-Name oder E-Mail filtern
es: Filtrar por nombre o email de committer
fr: Filtrer par nom ou email du valideur
it: Filtra per nome o email del committer
ru: Фильтр по имени или email фиксатора
tr: Committer adı veya e-postasına göre filtrele
zh: 按提交者名称或邮箱筛选

# filePathLabel
source: File path
ar: مسار الملف
de: Dateipfad
es: Ruta de archivo
fr: Chemin du fichier
it: Percorso file
ru: Путь к файлу
tr: Dosya Yolu
zh: 文件路径

# filterByFilePathExample
source: Filter by file path (e.g., src/main.dart)
ar: التصفية حسب مسار الملف (مثال: src/main.dart)
de: Nach Dateipfad filtern (z.B. src/main.dart)
es: Filtrar por ruta de archivo (ej. src/main.dart)
fr: Filtrer par chemin de fichier (ex: src/main.dart)
it: Filtra per percorso file (es., src/main.dart)
ru: Фильтр по пути к файлу (например, src/main.dart)
tr: Dosya yoluna göre filtrele (örn., src/main.dart)
zh: 按文件路径筛选 (例如: src/main.dart)

# commitHashLabel
source: Commit hash
ar: تجزئة التثبيت
es: Hash de commit
fr: Hash du commit
it: Hash commit
ru: Хеш коммита
zh: 提交哈希

# filterByCommitHashPrefix
source: Filter by commit hash prefix (e.g., abc123)
ar: التصفية حسب بادئة تجزئة التثبيت
de: Nach Commit-Hash-Präfix filtern (z.B. abc123)
es: Filtrar por prefijo de hash de commit
fr: Filtrer par préfixe de hash de commit (ex: abc123)
it: Filtra per prefisso hash commit (es., abc123)
ru: Фильтр по префиксу хеша коммита (например, abc123)
tr: Commit hash ön ekine göre filtrele
zh: 按提交哈希前缀筛选

source: Commit Details
ar: تفاصيل التثبيت
es: Detalles del commit
fr: Détails du commit
it: Dettagli del commit
ru: Детали коммита
tr: Commit Detayları
zh: 提交详情

source: Commit Message
ar: رسالة التثبيت
de: Commit-Nachricht
es: Mensaje del commit
fr: Message du commit
it: Messaggio del commit
ru: Сообщение коммита
tr: Commit Mesajı
zh: 提交信息

source: Additional Details
ar: تفاصيل إضافية
de: Zusätzliche Details
es: Detalles adicionales
fr: Détails supplémentaires
it: Dettagli aggiuntivi
ru: Дополнительные детали
tr: Ek Detaylar
zh: 附加详情

source: Show
ar: إظهار
de: Anzeigen
es: Mostrar
fr: Afficher
it: Mostra
ru: Показать
tr: Göster
zh: 显示

source: Hide
ar: إخفاء
de: Ausblenden
es: Ocultar
fr: Masquer
it: Nascondi
ru: Скрыть
tr: Gizle
zh: 隐藏

source: Name
ar: الاسم
es: Nombre
fr: Nom
it: Nome
ru: Имя
tr: İsim
zh: 名称

source: Hash
ar: التجزئة
ru: Хеш
zh: 哈希

source: Parent
ar: الأصل
de: Elternteil
es: Padre
it: Genitore
ru: Родитель
tr: Ebeveyn
zh: 父提交
