Repository: kartalbas/flutter-gitui
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

source: Parents
ar: الأصول
de: Elternteile
es: Padres
it: Genitori
ru: Родители
tr: Ebeveynler
zh: 父提交

source: References
ar: المراجع
de: Referenzen
es: Referencias
fr: Références
it: Riferimenti
ru: Ссылки
tr: Referanslar
zh: 引用

# localTab
source: Local
ar: محلي
de: Lokal
it: Locale
ru: Локальные
tr: Yerel
zh: 本地

# remoteTab
source: Remote
ar: بعيد
es: Remoto
fr: Distant
it: Remoto
ru: Удалённые
tr: Uzak
zh: 远程

# dateRangeSection
source: Date Range
ar: نطاق التاريخ
de: Datumsbereich
es: Rango de fechas
fr: Plage de dates
it: Intervallo Date
ru: Диапазон дат
tr: Tarih Aralığı
zh: 日期范围

source: From date
ar: من تاريخ
de: Von Datum
es: Desde fecha
fr: Date de début
it: Da data
ru: С даты
tr: Başlangıç Tarihi
zh: 从日期

source: To date
ar: إلى تاريخ
de: Bis Datum
es: Hasta fecha
fr: Date de fin
it: A data
ru: До даты
tr: Bitiş Tarihi
zh: 到日期

source: Last 30 days
ar: آخر 30 يومًا
de: Letzte 30 Tage
es: Últimos 30 días
fr: 30 derniers jours
it: Ultimi 30 giorni
ru: Последние 30 дней
tr: Son 30 gün
zh: 最近 30 天

source: Search Syntax
ar: صياغة البحث
de: Suchsyntax
es: Sintaxis de búsqueda
fr: Syntaxe de recherche
it: Sintassi Ricerca
ru: Синтаксис поиска
tr: Arama Sözdizimi
zh: 搜索语法

# syntaxAuthorFilter
source: Filter by author
ar: author:اسم - التصفية حسب المؤلف
de: Nach Autor filtern
es: author:<nombre> - Filtrar por autor
fr: author:nom - Filtrer par auteur
it: Filtra per autore
ru: Фильтр по автору
tr: author:ad - Yazara göre filtrele
zh: author:name - 按作者筛选

# syntaxFileFilter
source: Filter by file path
ar: file:مسار - التصفية حسب الملف
de: Nach Dateipfad filtern
es: file:<ruta> - Filtrar por archivo
fr: file:chemin - Filtrer par fichier
it: Filtra per percorso file
ru: Фильтр по пути к файлу
tr: file:yol - Dosyaya göre filtrele
zh: file:path - 按文件筛选

# syntaxHashFilter
source: Filter by hash prefix
ar: hash:تجزئة - التصفية حسب التجزئة
de: Nach Hash-Präfix filtern
es: hash:<prefijo> - Filtrar por hash
fr: hash:préfixe - Filtrer par hash
it: Filtra per prefisso hash
ru: Фильтр по префиксу хеша
tr: hash:abc - Hash'e göre filtrele
zh: hash:abc - 按哈希筛选

# syntaxFromDateFilter
source: From date (YYYY-MM-DD)
ar: from:YYYY-MM-DD - التصفية من تاريخ
de: Von Datum (JJJJ-MM-TT)
es: from:<fecha> - Desde fecha (AAAA-MM-DD)
fr: from:AAAA-MM-JJ - Depuis la date
it: Da data (AAAA-MM-GG)
ru: С даты (ГГГГ-ММ-ДД)
tr: from:tarih - Başlangıç tarihi
zh: from:YYYY-MM-DD - 从日期筛选

# syntaxToDateFilter
source: To date (or "yesterday", "week")
ar: to:YYYY-MM-DD - التصفية إلى تاريخ
de: Bis Datum (oder "yesterday", "week")
es: to:<fecha> - Hasta fecha (AAAA-MM-DD)
fr: to:AAAA-MM-JJ - Jusqu'à la date
it: A data (o "yesterday", "week")
ru: До даты (или "yesterday", "week")
tr: to:tarih - Bitiş tarihi
zh: to:YYYY-MM-DD - 到日期筛选

# syntaxExactPhrase
source: Exact phrase (use quotes)
ar: "عبارة" - بحث عن عبارة محددة
de: Exakte Phrase (Anführungszeichen verwenden)
es: "frase exacta" - Buscar frase exacta
fr: "phrase exacte" - Correspondance exacte
it: Frase esatta (usa le virgolette)
ru: Точная фраза (используйте кавычки)
tr: "tam ifade" - Tam ifade araması
zh: "exact phrase" - 精确短语

source: Select date
ar: اختر تاريخًا
de: Datum auswählen
es: Seleccionar fecha
fr: Sélectionner la date
it: Seleziona data
ru: Выберите дату
tr: Tarih Seç
zh: 选择日期

# clearFiltersButton
source: Clear filters
ar: مسح المرشحات
de: Filter löschen
es: Limpiar filtros
fr: Effacer les filtres
it: Cancella filtri
ru: Очистить фильтры
tr: Filtreleri temizle
zh: 清除过滤器

# advancedSearchButton
source: Search
ar: بحث
de: Suchen
es: Búsqueda avanzada
fr: Rechercher
it: Cerca
ru: Поиск
tr: Ara
zh: 搜索

# operationInProgress
source: Waiting...
ar: جاري الانتظار...
de: Operation läuft
es: Operación en progreso
fr: En attente...
it: In attesa...
ru: Ожидание...
tr: İşlem devam ediyor...
zh: 操作进行中

# operationsCompleted
source: All operations completed successfully
ar: اكتملت جميع العمليات بنجاح
de: Alle Operationen erfolgreich abgeschlossen
es: {completed} de {total} operaciones completadas
fr: Toutes les opérations terminées avec succès
it: Tutte le operazioni completate con successo
ru: Все операции успешно завершены
tr: İşlemler tamamlandı
zh: 操作已完成

# operationsCompletedWithErrors
source: Completed with errors
ar: اكتمل مع أخطاء
de: Mit Fehlern abgeschlossen
es: {completed} de {total} operaciones completadas ({errors} con errores)
fr: Terminé avec des erreurs
it: Completato con errori
ru: Завершено с ошибками
tr: İşlemler hatalarla tamamlandı
zh: 操作完成但有错误

# successCount
source: {successCount} successful, {failureCount} failed
ar: {count} نجحت
de: {successCount} erfolgreich, {failureCount} fehlgeschlagen
es: {count} exitoso(s)
fr: {count} réussi(e)s
it: {successCount} riusciti, {failureCount} falliti
ru: {successCount} успешно, {failureCount} с ошибкой
tr: Başarılı: {count}
zh: 成功: {count}

source: Completed
ar: مكتمل
de: Abgeschlossen
es: Completado
fr: Terminé
it: Completato
ru: Завершено
tr: Tamamlandı
zh: 已完成

source: Failed
ar: فشل
de: Fehlgeschlagen
es: Fallido
fr: Échec
it: Fallito
ru: Не удалось
tr: Başarısız
zh: 失败

# createBranchDialogTitle
source: Create Branch
ar: إنشاء فرع
de: Branch erstellen
es: Crear rama
fr: Créer une branche
it: Crea Branch
ru: Создать ветку
tr: Dal Oluştur
zh: 创建分支

# branchPrefixLabel
source: Branch prefix:
ar: بادئة الفرع
de: Branch-Präfix:
es: Prefijo de rama
fr: Préfixe de branche:
it: Prefisso branch:
ru: Префикс ветки:
tr: Dal ön eki:
zh: 分支前缀:

source: No prefix
ar: بدون بادئة
de: Kein Präfix
es: Sin prefijo
fr: Aucun préfixe
it: Nessun prefisso
ru: Без префикса
tr: Ön ek yok
zh: 无前缀

# featurePrefix
source: Feature
es: Prefijo de característica
fr: Fonctionnalité
it: Funzionalità
ru: Функция
tr: Özellik
zh: 功能

# releasePrefix
source: Release
es: Prefijo de release
fr: Version
it: Rilascio
ru: Выпуск
tr: Sürüm
zh: 发布

# hotfixPrefix
source: Hotfix
es: Prefijo de hotfix
fr: Correctif urgent
it: Correzione Urgente
ru: Горячее исправление
zh: 热修复

# bugfixPrefix
source: Bugfix
es: Prefijo de corrección de errores
fr: Correctif
it: Correzione Bug
ru: Исправление
tr: Hata Düzeltme
zh: 错误修复

# customPrefix
source: Custom
ar: بادئة مخصصة
de: Benutzerdefiniert
es: Prefijo personalizado
fr: Personnalisé
it: Personalizzato
ru: Пользовательский
tr: Özel ön ek
zh: 自定义

# customPrefixLabel
source: Custom prefix
ar: بادئة مخصصة
de: Benutzerdefiniertes Präfix
es: Prefijo personalizado
fr: Préfixe personnalisé
it: Prefisso personalizzato
ru: Пользовательский префикс
tr: Özel Ön Ek
zh: 自定义前缀

# customPrefixHint
source: e.g., experiment/
ar: custom/
de: z.B. experiment/
es: custom/
fr: ex: experience/
it: es., experiment/
ru: например, experiment/
tr: custom/
zh: 例如: feature/

# customPrefixHelper
source: Must end with /
ar: أدخل بادئة مخصصة للفرع (يجب أن تنتهي بـ /)
de: Muss mit / enden
es: El prefijo debe terminar con /
fr: Doit se terminer par /
it: Deve terminare con /
ru: Должен заканчиваться на /
tr: Ön ek '/' ile bitmelidir
zh: 输入自定义分支前缀 (必须以 / 结尾)

# branchNameHint
source: e.g., user-authentication
ar: اسم-الميزة
de: z.B. user-authentication
es: nombre-caracteristica
fr: ex: authentification-utilisateur
it: es., user-authentication
ru: например, user-authentication
tr: örn., kullanici-dogrulama
zh: 例如: user-authentication

# fullBranchNameLabel
source: Full branch name:
ar: الاسم الكامل للفرع
de: Vollständiger Branch-Name:
es: Nombre completo de rama
fr: Nom complet de la branche:
it: Nome completo del branch:
ru: Полное имя ветки:
tr: Tam Dal Adı
zh: 完整分支名称

# enterBranchNameLabel
source: (enter branch name)
ar: أدخل اسم الفرع
de: (Branch-Name eingeben)
es: Introduzca el nombre de rama
fr: (entrez le nom de la branche)
it: (inserisci nome branch)
ru: (введите имя ветки)
tr: Dal adı girin
zh: 输入分支名称

source: Branch name cannot be empty
ar: لا يمكن أن يكون اسم الفرع فارغًا
de: Branch-Name darf nicht leer sein
es: El nombre de rama no puede estar vacío
fr: Le nom de la branche ne peut pas être vide
it: Il nome del branch non può essere vuoto
ru: Имя ветки не может быть пустым
tr: Dal adı boş olamaz
zh: 分支名称不能为空

# branchNameInvalidCharacters
source: Branch name contains invalid characters
ar: يحتوي اسم الفرع على أحرف غير صالحة
de: Branch-Name enthält ungültige Zeichen
es: El nombre de rama contiene caracteres no válidos
fr: Le nom de la branche contient des caractères invalides
it: Il nome del branch contiene caratteri non validi
ru: Имя ветки содержит недопустимые символы
tr: Dal adı geçersiz karakterler içeriyor
zh: 分支名称包含无效字符

# customPrefixMustEndWithSlash
source: Custom prefix must end with /
ar: يجب أن تنتهي البادئة المخصصة بـ /
de: Benutzerdefiniertes Präfix muss mit / enden
es: El prefijo personalizado debe terminar con /
fr: Le préfixe personnalisé doit se terminer par /
it: Il prefisso personalizzato deve terminare con /
ru: Пользовательский префикс должен заканчиваться на /
tr: Özel ön ek '/' ile bitmelidir
zh: 自定义前缀必须以 / 结尾

# willCreateInRepositories
source: Will create in {count} {repositoryLabel}:
ar: سيتم الإنشاء في {count} مستودع (مستودعات)
de: Wird in {count} {repositoryLabel} erstellt:
es: Se creará en: {path}\repositories
fr: Créera dans les dépôts suivants:
it: Verrà creato in {count} {repositoryLabel}:
ru: Будет создано в {count} {repositoryLabel}:
tr: Şu depoda(larda) oluşturulacak:
zh: 将在 {count} 个仓库中创建

source: repository
ar: المستودع
es: Repositorio
fr: Dépôt
ru: репозиторий
tr: Depo
zh: 仓库

# setUpstreamLabel
source: Set upstream (push -u origin)
ar: تعيين المنبع
de: Upstream setzen (push -u origin)
es: Establecer upstream
fr: Définir la branche en amont
it: Imposta upstream (push -u origin)
ru: Установить upstream (push -u origin)
tr: Upstream belirle
zh: 设置上游

# setUpstreamDescription
source: Push the branch and set remote tracking
ar: ربط الفرع المحلي بفرع بعيد للدفع والسحب
de: Branch pushen und Remote-Tracking setzen
es: Configurar rama remota para seguimiento
fr: Configurer le suivi de la branche distante
it: Pusha il branch e imposta il tracciamento remoto
ru: Отправить ветку и установить отслеживание удалённого репозитория
tr: Uzak takip dalı oluştur
zh: 设置此分支跟踪的远程分支

# checkoutAfterCreationLabel
source: Checkout after creation
ar: الانتقال بعد الإنشاء
de: Nach Erstellung auschecken
es: Checkout después de crear
fr: Checkout après création
it: Checkout dopo la creazione
ru: Переключиться после создания
tr: Oluşturduktan sonra checkout et
zh: 创建后检出

# checkoutAfterCreationDescription
source: Switch to the new branch immediately
ar: التبديل تلقائيًا إلى الفرع الجديد بعد إنشائه
de: Sofort zum neuen Branch wechseln
es: Cambiar a la nueva rama después de crearla
fr: Basculer vers la nouvelle branche immédiatement
it: Passa immediatamente al nuovo branch
ru: Переключиться на новую ветку сразу
tr: Hemen yeni dala geç
zh: 立即切换到新分支

# createBranchButton
source: Create Branch
ar: إنشاء فرع
de: Branch erstellen
es: Crear rama
fr: Créer la branche
it: Crea Branch
ru: Создать ветку
tr: Dal Oluştur
zh: 创建分支

# createPullRequestDialogTitle
source: Create Pull Request
ar: إنشاء طلب سحب
de: Pull Request erstellen
es: Crear pull request
fr: Créer une pull request
it: Crea Pull Request
ru: Создать Pull Request
tr: Pull Request Oluştur
zh: 创建拉取请求

# sourceBranchLabel
source: Source Branch
ar: الفرع المصدر
de: Quell-Branch
es: Rama de origen
fr: Branche source
it: Branch Sorgente
ru: Исходная ветка
tr: Kaynak Dal
zh: 源分支

# targetBranchLabel
source: Target Branch
ar: الفرع المستهدف
de: Ziel-Branch
es: Rama de destino
fr: Branche cible
it: Branch Destinazione
ru: Целевая ветка
tr: Hedef Dal
zh: 目标分支

# searchOrSelectBranch
source: Search or select a branch
ar: البحث أو تحديد فرع
de: Branch suchen oder auswählen
es: Buscar o seleccionar rama
fr: Rechercher ou sélectionner une branche
it: Cerca o seleziona un branch
ru: Найти или выбрать ветку
tr: Dal ara veya seç
zh: 搜索或选择分支

source: Select target branch
ar: اختر الفرع المستهدف
de: Ziel-Branch auswählen
es: Seleccionar rama de destino
fr: Sélectionner la branche cible
it: Seleziona branch di destinazione...
ru: Выберите целевую ветку...
tr: Hedef dal seç
zh: 选择目标分支

# pullRequestTitleLabel
source: Pull Request Title
ar: عنوان طلب السحب
de: Pull-Request-Titel
es: Título del pull request
fr: Titre de la pull request
it: Titolo Pull Request
ru: Заголовок Pull Request
tr: Pull Request Başlığı
zh: 拉取请求标题

source: Enter PR title
ar: أدخل عنوان طلب السحب
de: PR-Titel eingeben
es: Introduzca título de PR
fr: Entrez le titre de la PR
it: Inserisci titolo PR
ru: Введите заголовок PR
tr: Pull request başlığı girin
zh: 输入拉取请求标题

# enterPRTitleValidation
source: Please enter a title
ar: يرجى إدخال عنوان لطلب السحب
de: Bitte geben Sie einen Titel ein
es: Por favor, introduzca un título para el PR
fr: Veuillez entrer un titre
it: Inserisci un titolo
ru: Пожалуйста, введите заголовок
tr: Lütfen bir başlık girin
zh: 请输入拉取请求标题

# descriptionLabel
source: Description
ar: الوصف
de: Beschreibung
es: Descripción
it: Descrizione
ru: Описание
tr: Açıklama
zh: 描述

# enterPRDescription
source: Enter PR description (optional)
ar: أدخل وصفًا لطلب السحب (اختياري)
de: PR-Beschreibung eingeben (optional)
es: Introduzca descripción de PR
fr: Entrez la description de la PR (optionnel)
it: Inserisci descrizione PR (opzionale)
ru: Введите описание PR (необязательно)
tr: Pull request açıklaması girin (isteğe bağlı)
zh: 描述此拉取请求的目的和更改...

# createAsDraftLabel
source: Create as draft
ar: إنشاء كمسودة
de: Als Entwurf erstellen
es: Crear como borrador
fr: Créer comme brouillon
it: Crea come bozza
ru: Создать как черновик
tr: Taslak olarak oluştur
zh: 创建为草稿

# draftPRDescription
source: Draft pull requests cannot be merged until marked as ready
ar: طلب السحب المسودة لا يمكن دمجه حتى يتم وضع علامة عليه كجاهز
de: Entwurfs-Pull-Requests können nicht gemergt werden, bis sie als bereit markiert sind
es: Crear PR como borrador para recibir comentarios anticipados
fr: Les pull requests brouillon ne peuvent pas être fusionnées tant qu'elles ne sont pas marquées comme prêtes
it: Crea come bozza (non pronto per la revisione)
ru: Черновики pull request не могут быть объединены до отметки как готовые
tr: Gözden geçirmeye hazır değil olarak işaretle
zh: 草稿拉取请求不能合并直到标记为准备审查

# prInfoMessage
source: This will open your browser to create a pull request with pre-filled information
ar: سيتم إنشاء طلب السحب على المنصة البعيدة (GitHub، GitLab، إلخ)
de: Dies öffnet Ihren Browser, um einen Pull Request mit vorausgefüllten Details zu erstellen.
es: Esto creará un pull request en el repositorio remoto
fr: Cela ouvrira votre navigateur pour créer une pull request avec votre service Git
it: Questo aprirà il browser per creare una pull request con informazioni pre-compilate
ru: Это откроет браузер для создания pull request с предзаполненной информацией
tr: Bu işlem GitHub CLI kullanır ve GitHub kimlik doğrulaması gerektirir
zh: 这将在远程仓库创建拉取请求

# createPRButton
source: Create PR
ar: إنشاء طلب السحب
de: PR erstellen
es: Crear PR
fr: Créer la PR
it: Crea PR
ru: Создать PR
tr: Pull Request Oluştur
zh: 创建拉取请求

# projectDialogCreateTitle
source: Create Project
ar: إنشاء مشروع
de: Projekt erstellen
es: Crear proyecto
fr: Créer un projet
it: Crea Progetto
ru: Создать проект
tr: Proje Oluştur
zh: 创建项目

# projectDialogEditTitle
source: Edit Project
ar: تعديل المشروع
de: Projekt bearbeiten
es: Editar proyecto
fr: Modifier le projet
it: Modifica Progetto
ru: Изменить проект
tr: Projeyi Düzenle
zh: 编辑项目

# projectNameLabel
source: Project Name
ar: اسم المشروع
de: Projektname
es: Nombre del proyecto
fr: Nom du projet
it: Nome Progetto
ru: Имя проекта
tr: Proje Adı
zh: 项目名称

source: Enter project name
ar: أدخل اسم المشروع
de: Projektnamen eingeben
es: Introduzca nombre del proyecto
fr: Entrez le nom du projet
it: Inserisci nome progetto
ru: Введите имя проекта
tr: Proje adı girin
zh: 输入项目名称

# enterProjectNameValidation
source: Please enter a project name
ar: يرجى إدخال اسم للمشروع
de: Bitte geben Sie einen Projektnamen ein
es: Por favor, introduzca un nombre de proyecto
fr: Veuillez entrer un nom de projet
it: Inserisci un nome per il progetto
ru: Пожалуйста, введите имя проекта
tr: Lütfen bir proje adı girin
zh: 请输入项目名称

# projectDescriptionLabel
source: Description (Optional)
ar: وصف المشروع
de: Beschreibung (optional)
es: Descripción del proyecto
fr: Description (Optionnelle)
it: Descrizione (Opzionale)
ru: Описание (необязательно)
tr: Proje Açıklaması
zh: 项目描述

source: Enter project description
ar: أدخل وصفًا للمشروع (اختياري)
de: Projektbeschreibung eingeben
es: Introduzca descripción del proyecto
fr: Entrez la description du projet
it: Inserisci descrizione progetto
ru: Введите описание проекта
tr: Proje açıklaması girin (isteğe bağlı)
zh: 输入项目描述 (可选)

# projectColorLabel
source: Project Color
ar: لون المشروع
de: Projektfarbe
es: Color del proyecto
fr: Couleur du projet
it: Colore Progetto
ru: Цвет проекта
tr: Proje Rengi
zh: 项目颜色

# previewLabel
source: Preview
ar: معاينة
de: Vorschau
es: Vista previa
fr: Aperçu
it: Anteprima
ru: Предпросмотр
tr: Önizleme
zh: 预览

# projectNamePreviewPlaceholder
source: Project Name
ar: اسم المشروع
de: Projektname
es: Mi Proyecto Genial
fr: Nom du projet
it: (nome progetto)
ru: Имя проекта
tr: Proje Adı
zh: 项目名称预览

# saveProjectButton
source: Save
ar: حفظ
de: Speichern
es: Guardar proyecto
fr: Sauvegarder le projet
it: Salva Progetto
ru: Сохранить
tr: Projeyi Kaydet
zh: 保存项目

# createProjectButton
source: Create
ar: إنشاء
de: Erstellen
es: Crear proyecto
fr: Créer
it: Crea Progetto
ru: Создать
tr: Proje Oluştur
zh: 创建项目

# createTagDialogDescription
source: Create a tag to mark an important point in repository history.
ar: أنشئ وسماً لتحديد نقطة مهمة في تاريخ المستودع.
de: Einen Tag erstellen, um einen wichtigen Punkt im Repository-Verlauf zu markieren
es: Crear una nueva etiqueta en el HEAD actual
fr: Créer un tag pour marquer un point important dans l'historique du dépôt.
it: Crea un nuovo tag in un commit specificato
ru: Создайте тег для отметки важной точки в истории репозитория.
tr: Mevcut HEAD'de yeni bir etiket oluştur
zh: 在当前 HEAD 创建新标签

source: Target Commit
ar: الإيداع المستهدف
de: Ziel-Commit
es: Commit de destino
fr: Commit cible
it: Commit Destinazione
ru: Целевой коммит
tr: Hedef Commit
zh: 目标提交

source: HEAD (current commit)
ar: HEAD (الإيداع الحالي)
de: HEAD (aktueller Commit)
es: HEAD (commit actual)
fr: HEAD (commit actuel)
it: HEAD (commit corrente)
ru: HEAD (текущий коммит)
tr: HEAD (Mevcut commit)
zh: HEAD (当前提交)

# enterTagName
source: Please enter a tag name
ar: يرجى إدخال اسم الوسم
de: Tag-Name eingeben
es: Introduzca nombre de etiqueta
fr: Entrez le nom du tag
it: Inserisci un nome per il tag
ru: Пожалуйста, введите имя тега
tr: Bir etiket adı girin
zh: 输入标签名称

# tagNameNoSpaces
source: Tag name cannot contain spaces
ar: اسم الوسم لا يمكن أن يحتوي على مسافات
de: Tag-Name darf keine Leerzeichen enthalten
es: El nombre de etiqueta no puede contener espacios
fr: Le nom du tag ne peut pas contenir d'espaces
it: Il nome del tag non può contenere spazi
ru: Имя тега не может содержать пробелы
tr: Etiket adı boşluk içeremez
zh: 标签名称不能包含空格

# enterTagMessage
source: Please enter a message for annotated tag
ar: يرجى إدخال رسالة للوسم المشروح
de: Bitte geben Sie eine Nachricht für den annotierten Tag ein
es: Introduzca mensaje de etiqueta
fr: Veuillez entrer un message pour le tag annoté
it: Inserisci un messaggio per il tag
ru: Пожалуйста, введите сообщение для тега с аннотацией
tr: Bir etiket mesajı girin
zh: 输入标签消息

# mergeABranchInto
source: Merge a branch into {currentBranch}
ar: دمج فرع في {currentBranch}
de: Einen Branch in {currentBranch} mergen
es: Fusionar una rama en la rama actual
fr: Fusionner une branche dans {currentBranch}
it: Unisci un branch in {targetBranch}
ru: Объединить ветку в {currentBranch}
tr: Bir dalı {targetBranch} dalına birleştir
zh: 将分支合并到

# noOtherBranchesAvailable
source: No other branches available to merge
ar: لا توجد فروع أخرى متاحة للدمج
de: Keine anderen Branches zum Mergen verfügbar
es: No hay otras ramas disponibles
fr: Aucune autre branche disponible à fusionner
it: Nessun altro branch disponibile
ru: Нет других доступных веток для слияния
tr: Birleştirmek için başka dal yok
zh: 无其他可用分支

source: Branch to Merge
ar: الفرع المراد دمجه
de: Zu mergender Branch
es: Rama a fusionar
fr: Branche à fusionner
it: Branch da unire
ru: Ветка для слияния
tr: Birleştirilecek Dal
zh: 要合并的分支

source: Select a branch
ar: اختر فرعًا
de: Wählen Sie einen Branch
es: Seleccione una rama
fr: Sélectionner une branche
it: Seleziona un branch
ru: Выберите ветку
tr: Bir dal seç
zh: 选择分支

source: (remote)
ar: بعيد
es: Remoto
fr: Distant
it: Remoto
ru: (удалённый)
tr: Uzak
zh: 远程

source: Merge Options
ar: خيارات الدمج
de: Merge-Optionen
es: Opciones de merge
fr: Options de fusion
it: Opzioni di Unione
ru: Параметры слияния
tr: Birleştirme Seçenekleri
zh: 合并选项

source: Fast-forward only
ar: تقديم سريع فقط
de: Nur Fast-Forward
es: Solo fast-forward
fr: Fast-forward uniquement
it: Solo fast-forward
ru: Только быстрая перемотка
tr: Sadece Fast-Forward
zh: 仅快进

# abortIfFastForwardNotPossible
source: Abort if fast-forward is not possible
ar: إلغاء إذا لم يكن التقديم السريع ممكنًا
de: Abbrechen, wenn Fast-Forward nicht möglich ist
es: Abortar si fast-forward no es posible
fr: Abandonner si le fast-forward n'est pas possible
it: Interrompi se fast-forward non possibile
ru: Прервать, если быстрая перемотка невозможна
tr: Fast-forward mümkün değilse iptal et
zh: 无法快进时中止

source: No fast-forward
ar: بدون تقديم سريع
de: Kein Fast-Forward
es: Sin fast-forward
fr: Pas de fast-forward
it: Nessun Fast-Forward
ru: Без быстрой перемотки
tr: Fast-Forward Yok
zh: 不快进

# alwaysCreateMergeCommit
source: Always create a merge commit
ar: إنشاء تثبيت دمج دائمًا
de: Immer einen Merge-Commit erstellen
es: Siempre crear commit de fusión
fr: Toujours créer un commit de fusion
it: Crea sempre commit di unione
ru: Всегда создавать коммит слияния
tr: Her zaman birleştirme commit'i oluştur
zh: 始终创建合并提交

# combineAllCommitsIntoSingleCommit
source: Combine all commits into a single commit
ar: دمج جميع التثبيتات في تثبيت واحد
de: Alle Commits zu einem einzigen Commit kombinieren
es: Combinar todos los commits en uno solo
fr: Combiner tous les commits en un seul commit
it: Combina tutti i commit in un singolo commit
ru: Объединить все коммиты в один коммит
tr: Tüm commit'leri tek bir commit'te birleştir
zh: 将所有提交合并为单个提交

source: Custom merge message
ar: رسالة دمج مخصصة
de: Benutzerdefinierte Merge-Nachricht
es: Mensaje de merge personalizado
fr: Message de fusion personnalisé
it: Messaggio di unione personalizzato
ru: Пользовательское сообщение слияния
tr: Özel Birleştirme Mesajı
zh: 自定义合并消息

source: Enter custom merge commit message
ar: أدخل رسالة تثبيت دمج مخصصة
de: Benutzerdefinierte Merge-Commit-Nachricht eingeben
es: Introduzca mensaje de commit de merge personalizado
fr: Entrez un message de commit de fusion personnalisé
it: Inserisci messaggio commit di unione personalizzato
ru: Введите пользовательское сообщение коммита слияния
tr: Özel birleştirme commit mesajı girin
zh: 输入自定义合并提交消息 (可选)

source: Merge Message
ar: رسالة الدمج
de: Merge-Nachricht
es: Mensaje de merge
fr: Message de fusion
it: Messaggio di Unione
ru: Сообщение слияния
tr: Birleştirme Mesajı
zh: 合并消息

# squashMergeWillCombineAllCommits
source: Squash merge will combine all commits. You will need to commit manually after the merge.
ar: سيدمج دمج السحق جميع التثبيتات من الفرع في تثبيت واحد
de: Squash-Merge kombiniert alle Commits. Sie müssen nach dem Merge committen.
es: El squash merge combinará todos los commits en uno solo
fr: La fusion par squash combinera tous les commits en un seul
it: L'unione squash combinerà tutti i commit in uno
ru: Объединяющее слияние объединит все коммиты. Вам нужно будет выполнить коммит вручную после слияния.
tr: Squash birleştirme tüm commit'leri tek bir commit'te birleştirecek
zh: 压缩合并将把所有提交合并为一个
