Repository: kartalbas/flutter-gitui
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# snackbarUpdatedRemoteUrl
source: Updated "{remoteName}" URL
ar: تم تحديث رابط "{remoteName}"
de: "{remoteName}" URL aktualisiert
es: URL de "{remoteName}" actualizada
fr: URL de "{remoteName}" mise à jour
it: URL di "{remoteName}" aggiornato
ru: URL "{remoteName}" обновлен
tr: "{remoteName}" URL'si güncellendi
zh: 已更新"{remoteName}"的URL

# snackbarFailedToUpdateUrl
source: Failed to update URL: {error}
ar: فشل تحديث الرابط: {error}
de: URL-Aktualisierung fehlgeschlagen: {error}
es: Error al actualizar URL: {error}
fr: Échec de la mise à jour de l'URL : {error}
it: Aggiornamento URL fallito: {error}
ru: Ошибка обновления URL: {error}
tr: URL güncelleme başarısız: {error}
zh: 更新URL失败：{error}

# snackbarFailedToRename
source: Failed to rename: {error}
ar: فشل إعادة التسمية: {error}
de: Umbenennung fehlgeschlagen: {error}
es: Error al renombrar: {error}
fr: Échec du renommage : {error}
it: Rinomina fallita: {error}
ru: Ошибка переименования: {error}
tr: Yeniden adlandırma başarısız: {error}
zh: 重命名失败：{error}

# snackbarPruned
source: Pruned "{remoteName}"
ar: تم تقليم "{remoteName}"
de: "{remoteName}" bereinigt
es: "{remoteName}" podado
fr: "{remoteName}" élagué
it: "{remoteName}" potato
ru: "{remoteName}" очищен
tr: "{remoteName}" budandı
zh: 已修剪"{remoteName}"

# snackbarFailedToPrune
source: Failed to prune: {error}
ar: فشل التقليم: {error}
de: Bereinigung fehlgeschlagen: {error}
es: Error al podar: {error}
fr: Échec de l'élagage : {error}
it: Potatura fallita: {error}
ru: Ошибка очистки: {error}
tr: Budama başarısız: {error}
zh: 修剪失败：{error}

# snackbarDeleted
source: Deleted "{remoteName}"
ar: تم حذف "{remoteName}"
de: "{remoteName}" gelöscht
es: "{remoteName}" eliminado
fr: "{remoteName}" supprimé
it: "{remoteName}" eliminato
ru: "{remoteName}" удален
tr: "{remoteName}" silindi
zh: 已删除"{remoteName}"

# snackbarFailedToDelete
source: Failed to delete: {error}
ar: فشل الحذف: {error}
de: Löschen fehlgeschlagen: {error}
es: Error al eliminar: {error}
fr: Échec de la suppression : {error}
it: Eliminazione fallita: {error}
ru: Ошибка удаления: {error}
tr: Silme başarısız: {error}
zh: 删除失败：{error}

# snackbarAppliedStash
source: Applied {stashRef}
ar: تم تطبيق {stashRef}
de: {stashRef} angewendet
es: {stashRef} aplicado
fr: {stashRef} appliqué
it: {stashRef} applicato
ru: {stashRef} применен
tr: {stashRef} uygulandı
zh: 已应用{stashRef}

# snackbarPoppedStash
source: Popped {stashRef}
ar: تم استرجاع {stashRef}
de: {stashRef} wiederhergestellt
es: {stashRef} restaurado
fr: {stashRef} restauré
it: {stashRef} ripristinato
ru: {stashRef} восстановлен
tr: {stashRef} geri yüklendi
zh: 已恢复{stashRef}

# snackbarCreatedBranchFrom
source: Created branch "{branchName}" from {stashRef}
ar: تم إنشاء الفرع "{branchName}" من {stashRef}
de: Branch "{branchName}" von {stashRef} erstellt
es: Rama "{branchName}" creada desde {stashRef}
fr: Branche "{branchName}" créée depuis {stashRef}
it: Branch "{branchName}" creato da {stashRef}
ru: Ветка "{branchName}" создана из {stashRef}
tr: "{branchName}" dalı {stashRef} üzerinden oluşturuldu
zh: 已从{stashRef}创建分支"{branchName}"

# snackbarDroppedStash
source: Dropped {stashRef}
ar: تم إسقاط {stashRef}
de: {stashRef} verworfen
es: {stashRef} descartado
fr: {stashRef} abandonné
it: {stashRef} scartato
ru: {stashRef} удален
tr: {stashRef} atıldı
zh: 已丢弃{stashRef}

# snackbarTagCreated
source: Tag "{tagName}" created successfully
ar: تم إنشاء الوسم "{tagName}" بنجاح
de: Tag "{tagName}" erfolgreich erstellt
es: Etiqueta "{tagName}" creada exitosamente
fr: Tag "{tagName}" créé avec succès
it: Tag "{tagName}" creato con successo
ru: Тег "{tagName}" успешно создан
tr: "{tagName}" etiketi başarıyla oluşturuldu
zh: 已成功创建标签"{tagName}"

# snackbarTagsFetched
source: Tags fetched successfully
ar: تم جلب الوسوم بنجاح
de: Tags erfolgreich abgerufen
es: Etiquetas obtenidas exitosamente
fr: Tags récupérés avec succès
it: Tag recuperati con successo
ru: Теги успешно получены
tr: Etiketler başarıyla alındı
zh: 已成功获取标签

# snackbarErrorLoadingCommit
source: Error loading commit: {error}
ar: خطأ في تحميل الإيداع: {error}
de: Fehler beim Laden des Commits: {error}
es: Error al cargar commit: {error}
fr: Erreur lors du chargement du commit : {error}
it: Errore nel caricamento del commit: {error}
ru: Ошибка загрузки коммита: {error}
tr: Commit yüklenirken hata: {error}
zh: 加载提交时出错：{error}

# snackbarFailedToCreateTag
source: Failed to create tag: {error}
ar: فشل إنشاء الوسم: {error}
de: Tag-Erstellung fehlgeschlagen: {error}
es: Error al crear etiqueta: {error}
fr: Échec de création de la balise : {error}
it: Creazione tag fallita: {error}
ru: Не удалось создать тег: {error}
tr: Etiket oluşturulamadı: {error}
zh: 创建标签失败：{error}

# snackbarFailedToFetchTags
source: Failed to fetch tags: {error}
ar: فشل جلب الوسوم: {error}
de: Tags abrufen fehlgeschlagen: {error}
es: Error al obtener etiquetas: {error}
fr: Échec de récupération des balises : {error}
it: Recupero tag fallito: {error}
ru: Не удалось получить теги: {error}
tr: Etiketler alınamadı: {error}
zh: 获取标签失败：{error}

# snackbarNoRemotesConfigured
source: No remotes configured
ar: لم يتم تكوين أي مستودعات بعيدة
de: Keine Remotes konfiguriert
es: No hay remotos configurados
fr: Aucun dépôt distant configuré
it: Nessun repository remoto configurato
ru: Нет настроенных удалённых репозиториев
tr: Yapılandırılmış uzak depo yok
zh: 未配置远程仓库

# snackbarAllTagsPushed
source: All tags pushed to {remoteName}
ar: تم دفع جميع الوسوم إلى {remoteName}
de: Alle Tags zu {remoteName} gepusht
es: Todas las etiquetas enviadas a {remoteName}
fr: Toutes les balises envoyées vers {remoteName}
it: Tutti i tag inviati a {remoteName}
ru: Все теги отправлены в {remoteName}
tr: Tüm etiketler {remoteName} konumuna gönderildi
zh: 所有标签已推送到 {remoteName}

# snackbarTagPushed
source: Tag "{tagName}" pushed to {remoteName}
ar: تم دفع الوسم "{tagName}" إلى {remoteName}
de: Tag "{tagName}" zu {remoteName} gepusht
es: Etiqueta "{tagName}" enviada a {remoteName}
fr: Balise "{tagName}" envoyée vers {remoteName}
it: Tag "{tagName}" inviato a {remoteName}
ru: Тег "{tagName}" отправлен в {remoteName}
tr: "{tagName}" etiketi {remoteName} konumuna gönderildi
zh: 标签 "{tagName}" 已推送到 {remoteName}

# snackbarFailedToPushTag
source: Failed to push tag: {error}
ar: فشل دفع الوسم: {error}
de: Tag pushen fehlgeschlagen: {error}
es: Error al enviar etiqueta: {error}
fr: Échec d'envoi de la balise : {error}
it: Invio tag fallito: {error}
ru: Не удалось отправить тег: {error}
tr: Etiket gönderilemedi: {error}
zh: 推送标签失败：{error}

# snackbarTagsPushed
source: {count, plural, =1{1 tag pushed} other{{count} tags pushed}} to {remoteName}
ar: {count, plural, =1{تم دفع وسم واحد} other{تم دفع {count} وسم}} إلى {remoteName}
de: {count, plural, =1{1 Tag gepusht} other{{count} Tags gepusht}} zu {remoteName}
es: {count, plural, =1{1 etiqueta enviada} other{{count} etiquetas enviadas}} a {remoteName}
fr: {count, plural, =1{1 balise envoyée} other{{count} balises envoyées}} vers {remoteName}
it: {count, plural, =1{1 tag inviato} other{{count} tag inviati}} a {remoteName}
ru: {count, plural, =1{Отправлен 1 тег} other{Отправлено {count} тегов}} в {remoteName}
tr: {count, plural, =1{1 etiket} other{{count} etiket}} {remoteName} konumuna gönderildi
zh: {count, plural, =1{已推送 1 个标签} other{已推送 {count} 个标签}}到 {remoteName}

# snackbarFailedToPushTags
source: Failed to push tags: {error}
ar: فشل دفع الوسوم: {error}
de: Tags pushen fehlgeschlagen: {error}
es: Error al enviar etiquetas: {error}
fr: Échec d'envoi des balises : {error}
it: Invio tag fallito: {error}
ru: Не удалось отправить теги: {error}
tr: Etiketler gönderilemedi: {error}
zh: 推送标签失败：{error}

# snackbarCheckedOutTag
source: Checked out tag "{tagName}"
ar: تم التبديل إلى الوسم "{tagName}"
de: Tag "{tagName}" ausgecheckt
es: Etiqueta "{tagName}" seleccionada
fr: Balise "{tagName}" extraite
it: Tag "{tagName}" estratto
ru: Переключено на тег "{tagName}"
tr: "{tagName}" etiketine geçildi
zh: 已切换到标签 "{tagName}"

# snackbarFailedToCheckoutTag
source: Failed to checkout tag: {error}
ar: فشل التبديل إلى الوسم: {error}
de: Tag auschecken fehlgeschlagen: {error}
es: Error al seleccionar etiqueta: {error}
fr: Échec d'extraction de la balise : {error}
it: Estrazione tag fallita: {error}
ru: Не удалось переключиться на тег: {error}
tr: Etikete geçilemedi: {error}
zh: 切换标签失败：{error}

# snackbarTagDeleted
source: Tag "{tagName}" deleted
ar: تم حذف الوسم "{tagName}"
de: Tag "{tagName}" gelöscht
es: Etiqueta "{tagName}" eliminada
fr: Étiquette "{tagName}" supprimée
it: Tag "{tagName}" eliminato
ru: Тег "{tagName}" удалён
tr: "{tagName}" etiketi silindi
zh: 标签"{tagName}"已删除

# snackbarTagsDeleted
source: {count, plural, =1{1 tag deleted} other{{count} tags deleted}}
ar: {count, plural, =1{تم حذف وسم واحد} other{تم حذف {count} وسم}}
de: {count, plural, =1{1 Tag gelöscht} other{{count} Tags gelöscht}}
es: {count, plural, =1{1 etiqueta eliminada} other{{count} etiquetas eliminadas}}
fr: {count, plural, =1{1 balise supprimée} other{{count} balises supprimées}}
it: {count, plural, =1{1 tag eliminato} other{{count} tag eliminati}}
ru: {count, plural, =1{Удалён 1 тег} other{Удалено {count} тегов}}
tr: {count, plural, =1{1 etiket silindi} other{{count} etiket silindi}}
zh: {count, plural, =1{已删除 1 个标签} other{已删除 {count} 个标签}}

# snackbarFailedToDeleteTag
source: Failed to delete tag: {error}
ar: فشل حذف الوسم: {error}
de: Tag löschen fehlgeschlagen: {error}
es: Error al eliminar etiqueta: {error}
fr: Échec de suppression de la balise : {error}
it: Eliminazione tag fallita: {error}
ru: Не удалось удалить тег: {error}
tr: Etiket silinemedi: {error}
zh: 删除标签失败：{error}

# snackbarFailedToDeleteTags
source: Failed to delete tags: {error}
ar: فشل حذف الوسوم: {error}
de: Tags löschen fehlgeschlagen: {error}
es: Error al eliminar etiquetas: {error}
fr: Échec de suppression des balises : {error}
it: Eliminazione tag fallita: {error}
ru: Не удалось удалить теги: {error}
tr: Etiketler silinemedi: {error}
zh: 删除标签失败：{error}

# snackbarDiffCopied
source: Diff copied to clipboard
ar: تم نسخ الاختلافات إلى الحافظة
de: Diff in Zwischenablage kopiert
es: Diferencias copiadas al portapapeles
fr: Diff copié dans le presse-papiers
it: Diff copiato negli appunti
ru: Различия скопированы в буфер обмена
tr: Fark panoya kopyalandı
zh: 差异已复制到剪贴板

# snackbarCopiedToClipboard
source: Copied to clipboard
ar: تم النسخ إلى الحافظة
de: In Zwischenablage kopiert
es: Copiado al portapapeles
fr: Copié dans le presse-papiers
it: Copiato negli appunti
ru: Скопировано в буфер обмена
tr: Panoya kopyalandı
zh: 已复制到剪贴板

# snackbarLineCopied
source: Line copied to clipboard
ar: تم نسخ السطر إلى الحافظة
de: Zeile in Zwischenablage kopiert
es: Línea copiada al portapapeles
fr: Ligne copiée dans le presse-papiers
it: Riga copiata negli appunti
ru: Строка скопирована в буфер обмена
tr: Satır panoya kopyalandı
zh: 行已复制到剪贴板

# snackbarPathCopied
source: Path copied: {path}
ar: تم نسخ المسار: {path}
de: Pfad kopiert: {path}
es: Ruta copiada: {path}
fr: Chemin copié : {path}
it: Percorso copiato: {path}
ru: Путь скопирован: {path}
tr: Yol kopyalandı: {path}
zh: 路径已复制：{path}

# snackbarFileCopied
source: Copied: {fileName}
ar: تم النسخ: {fileName}
de: Kopiert: {fileName}
es: Copiado: {fileName}
fr: Copié : {fileName}
it: Copiato: {fileName}
ru: Скопировано: {fileName}
tr: Kopyalandı: {fileName}
zh: 已复制：{fileName}

# snackbarOutputCopied
source: Output copied to clipboard
ar: تم نسخ المخرجات إلى الحافظة
de: Ausgabe in Zwischenablage kopiert
es: Salida copiada al portapapeles
fr: Sortie copiée dans le presse-papiers
it: Output copiato negli appunti
ru: Вывод скопирован в буфер обмена
tr: Çıktı panoya kopyalandı
zh: 输出已复制到剪贴板

# snackbarGitServiceNotAvailable
source: Git service not available
ar: خدمة Git غير متاحة
de: Git-Dienst nicht verfügbar
es: Servicio Git no disponible
fr: Service Git non disponible
it: Servizio Git non disponibile
ru: Служба Git недоступна
tr: Git servisi kullanılamıyor
zh: Git 服务不可用

# snackbarCommitNotFound
source: Commit not found
ar: لم يتم العثور على الإيداع
de: Commit nicht gefunden
es: Commit no encontrado
fr: Commit introuvable
it: Commit non trovato
ru: Коммит не найден
tr: Commit bulunamadı
zh: 未找到提交

# snackbarNoRepositoryOpen
source: No repository open
ar: لا يوجد مستودع مفتوح
de: Kein Repository geöffnet
es: No hay repositorio abierto
fr: Aucun dépôt ouvert
it: Nessun repository aperto
ru: Нет открытого репозитория
tr: Açık depo yok
zh: 未打开仓库

# snackbarRepositoryPathNotAvailable
source: Repository path not available
ar: مسار المستودع غير متاح
de: Repository-Pfad nicht verfügbar
es: Ruta del repositorio no disponible
fr: Chemin du dépôt non disponible
it: Percorso del repository non disponibile
ru: Путь к репозиторию недоступен
tr: Depo yolu kullanılamıyor
zh: 仓库路径不可用

# snackbarFailedToOpenExternalTool
source: Failed to open external tool: {error}
ar: فشل فتح الأداة الخارجية: {error}
de: Externes Tool öffnen fehlgeschlagen: {error}
es: Error al abrir herramienta externa: {error}
fr: Échec d'ouverture de l'outil externe : {error}
it: Apertura strumento esterno fallita: {error}
ru: Не удалось открыть внешний инструмент: {error}
tr: Harici araç açılamadı: {error}
zh: 打开外部工具失败：{error}

# snackbarFailedToLoadDiff
source: Failed to load diff: {error}
ar: فشل تحميل الاختلافات: {error}
de: Diff laden fehlgeschlagen: {error}
es: Error al cargar diferencias: {error}
fr: Échec de chargement du diff : {error}
it: Caricamento diff fallito: {error}
ru: Не удалось загрузить различия: {error}
tr: Fark yüklenemedi: {error}
zh: 加载差异失败：{error}

# snackbarFileNotFound
source: File not found
ar: الملف غير موجود
de: Datei nicht gefunden
es: Archivo no encontrado
fr: Fichier non trouvé
it: File non trovato
ru: Файл не найден
tr: Dosya bulunamadı
zh: 文件未找到

# snackbarSourceFileNotFound
source: Source file not found
ar: الملف المصدر غير موجود
de: Quelldatei nicht gefunden
es: Archivo fuente no encontrado
fr: Fichier source non trouvé
it: File sorgente non trovato
ru: Исходный файл не найден
tr: Kaynak dosya bulunamadı
zh: 源文件未找到

# snackbarNoFileCopied
source: No file copied
ar: لم يتم نسخ أي ملف
de: Keine Datei kopiert
es: Ningún archivo copiado
fr: Aucun fichier copié
it: Nessun file copiato
ru: Файл не скопирован
tr: Dosya kopyalanmadı
zh: 未复制文件

# snackbarFileRenamed
source: Renamed to {newName}
ar: تمت إعادة التسمية إلى {newName}
de: Umbenannt in {newName}
es: Renombrado a {newName}
fr: Renommé en {newName}
it: Rinominato in {newName}
ru: Переименовано в {newName}
tr: {newName} olarak yeniden adlandırıldı
zh: 已重命名为 {newName}

# snackbarFailedToRenameFile
source: Failed to rename file: {error}
ar: فشلت إعادة تسمية الملف: {error}
de: Datei konnte nicht umbenannt werden: {error}
es: Fallo al renombrar archivo: {error}
fr: Échec du renommage du fichier : {error}
it: Rinomina file fallita: {error}
ru: Не удалось переименовать файл: {error}
tr: Dosya yeniden adlandırılamadı: {error}
zh: 重命名文件失败：{error}

# snackbarFileDeleted
source: Deleted: {fileName}
ar: تم الحذف: {fileName}
de: Gelöscht: {fileName}
es: Eliminado: {fileName}
fr: Supprimé : {fileName}
it: Eliminato: {fileName}
ru: Удалено: {fileName}
tr: Silindi: {fileName}
zh: 已删除：{fileName}

# snackbarFailedToDeleteFile
source: Failed to delete file: {error}
ar: فشل حذف الملف: {error}
de: Datei konnte nicht gelöscht werden: {error}
es: Fallo al eliminar archivo: {error}
fr: Échec de la suppression du fichier : {error}
it: Eliminazione file fallita: {error}
ru: Не удалось удалить файл: {error}
tr: Dosya silinemedi: {error}
zh: 删除文件失败：{error}

# snackbarFilePasted
source: Pasted: {newFileName}
ar: تم اللصق: {newFileName}
de: Eingefügt: {newFileName}
es: Pegado: {newFileName}
fr: Collé : {newFileName}
it: Incollato: {newFileName}
ru: Вставлено: {newFileName}
tr: Yapıştırıldı: {newFileName}
zh: 已粘贴：{newFileName}

# snackbarFailedToPasteFile
source: Failed to paste file: {error}
ar: فشل لصق الملف: {error}
de: Datei konnte nicht eingefügt werden: {error}
es: Fallo al pegar archivo: {error}
fr: Échec du collage du fichier : {error}
it: Incolla file fallito: {error}
ru: Не удалось вставить файл: {error}
tr: Dosya yapıştırılamadı: {error}
zh: 粘贴文件失败：{error}

# snackbarFileSaved
source: File saved to {outputPath}
ar: تم حفظ الملف في {outputPath}
de: Datei gespeichert in {outputPath}
es: Archivo guardado en {outputPath}
fr: Fichier enregistré dans {outputPath}
it: File salvato in {outputPath}
ru: Файл сохранён в {outputPath}
tr: Dosya {outputPath} konumuna kaydedildi
zh: 文件已保存到 {outputPath}

# snackbarFileDownloaded
source: File downloaded to repository and folder opened
ar: تم تنزيل الملف إلى المستودع وفتح المجلد
de: Datei ins Repository heruntergeladen und Ordner geöffnet
es: Archivo descargado al repositorio y carpeta abierta
fr: Fichier téléchargé dans le dépôt et dossier ouvert
it: File scaricato nel repository e cartella aperta
ru: Файл загружен в репозиторий и папка открыта
tr: Dosya depoya indirildi ve klasör açıldı
zh: 文件已下载到仓库并打开文件夹

# snackbarFailedToDownloadFile
source: Failed to download file: {error}
ar: فشل تنزيل الملف: {error}
de: Datei herunterladen fehlgeschlagen: {error}
es: Error al descargar archivo: {error}
fr: Échec de téléchargement du fichier : {error}
it: Download file fallito: {error}
ru: Не удалось загрузить файл: {error}
tr: Dosya indirilemedi: {error}
zh: 下载文件失败：{error}

# snackbarFailedToDownloadAndOpenFolder
source: Failed to download and open folder: {error}
ar: فشل التنزيل وفتح المجلد: {error}
de: Download und Ordner öffnen fehlgeschlagen: {error}
es: Error al descargar y abrir carpeta: {error}
fr: Échec de téléchargement et d'ouverture du dossier : {error}
it: Download e apertura cartella falliti: {error}
ru: Не удалось загрузить и открыть папку: {error}
tr: İndirme ve klasör açma başarısız: {error}
zh: 下载并打开文件夹失败：{error}

# snackbarFailedToOpenFileManager
source: Failed to open file manager: {error}
ar: فشل فتح مدير الملفات: {error}
de: Dateimanager konnte nicht geöffnet werden: {error}
es: Fallo al abrir el administrador de archivos: {error}
fr: Échec de l'ouverture du gestionnaire de fichiers : {error}
it: Apertura del gestore file fallita: {error}
ru: Не удалось открыть файловый менеджер: {error}
tr: Dosya yöneticisi açılamadı: {error}
zh: 打开文件管理器失败：{error}

# snackbarFailedToOpenEditor
source: Failed to open editor: {error}
ar: فشل فتح المحرر: {error}
de: Editor öffnen fehlgeschlagen: {error}
es: Error al abrir editor: {error}
fr: Échec d'ouverture de l'éditeur : {error}
it: Apertura editor fallita: {error}
ru: Не удалось открыть редактор: {error}
tr: Editör açılamadı: {error}
zh: 打开编辑器失败：{error}

# snackbarFailedToOpenFileInEditor
source: Failed to open file in editor: {error}
ar: فشل فتح الملف في المحرر: {error}
de: Datei in Editor öffnen fehlgeschlagen: {error}
es: Error al abrir archivo en editor: {error}
fr: Échec d'ouverture du fichier dans l'éditeur : {error}
it: Apertura file nell'editor fallita: {error}
ru: Не удалось открыть файл в редакторе: {error}
tr: Dosya editörde açılamadı: {error}
zh: 在编辑器中打开文件失败：{error}

# snackbarMergeCompleted
source: Merge completed successfully
ar: اكتمل الدمج بنجاح
de: Merge erfolgreich abgeschlossen
es: Fusión completada exitosamente
fr: Fusion terminée avec succès
it: Fusione completata con successo
ru: Слияние успешно завершено
tr: Birleştirme başarıyla tamamlandı
zh: 合并成功完成

# snackbarMergeAborted
source: Merge aborted
ar: تم إلغاء الدمج
de: Merge abgebrochen
es: Fusión abortada
fr: Fusion annulée
it: Fusione annullata
ru: Слияние прервано
tr: Birleştirme iptal edildi
zh: 合并已中止

# snackbarConflictResolved
source: Resolved {fileName} using {choice}
ar: تم حل {fileName} باستخدام {choice}
de: {fileName} mit {choice} aufgelöst
es: {fileName} resuelto usando {choice}
fr: {fileName} résolu en utilisant {choice}
it: {fileName} risolto usando {choice}
ru: {fileName} разрешён с использованием {choice}
tr: {fileName}, {choice} kullanılarak çözüldü
zh: 已使用 {choice} 解决 {fileName}

# snackbarFailedToApplyStash
source: Failed to apply stash: {error}
ar: فشل تطبيق المخبأ: {error}
de: Stash anwenden fehlgeschlagen: {error}
es: Error al aplicar stash: {error}
fr: Échec d'application du stash : {error}
it: Applicazione stash fallita: {error}
ru: Не удалось применить сохранение: {error}
tr: Saklama uygulanamadı: {error}
zh: 应用储藏失败：{error}

# snackbarFailedToPopStash
source: Failed to pop stash: {error}
ar: فشل استخراج المخبأ: {error}
de: Stash wiederherstellen fehlgeschlagen: {error}
es: Error al restaurar stash: {error}
fr: Échec de restauration du stash : {error}
it: Ripristino stash fallito: {error}
ru: Не удалось восстановить сохранение: {error}
tr: Saklama geri yüklenemedi: {error}
zh: 恢复储藏失败：{error}

# snackbarFailedToCreateBranch
source: Failed to create branch: {error}
ar: فشل إنشاء الفرع: {error}
de: Branch erstellen fehlgeschlagen: {error}
es: Error al crear rama: {error}
fr: Échec de création de la branche : {error}
it: Creazione branch fallita: {error}
ru: Не удалось создать ветку: {error}
tr: Dal oluşturulamadı: {error}
zh: 创建分支失败：{error}

# snackbarFailedToDropStash
source: Failed to drop stash: {error}
ar: فشل حذف المخبأ: {error}
de: Stash verwerfen fehlgeschlagen: {error}
es: Error al descartar stash: {error}
fr: Échec de suppression du stash : {error}
it: Eliminazione stash fallita: {error}
ru: Не удалось удалить сохранение: {error}
tr: Saklama silinemedi: {error}
zh: 删除储藏失败：{error}

# snackbarRemoteRenamed
source: Renamed "{remoteName}" to "{newName}"
ar: تمت إعادة تسمية "{remoteName}" إلى "{newName}"
de: "{remoteName}" in "{newName}" umbenannt
es: "{remoteName}" renombrado a "{newName}"
fr: "{remoteName}" renommé en "{newName}"
it: "{remoteName}" rinominato in "{newName}"
ru: "{remoteName}" переименовано в "{newName}"
tr: "{remoteName}", "{newName}" olarak yeniden adlandırıldı
zh: "{remoteName}" 已重命名为 "{newName}"

# snackbarViewDiffComingSoon
source: View diff for {commitHash} (coming soon)
ar: عرض الاختلافات لـ {commitHash} (قريباً)
de: Diff anzeigen für {commitHash} (demnächst)
es: Ver diferencias para {commitHash} (próximamente)
fr: Voir le diff pour {commitHash} (bientôt disponible)
it: Visualizza diff per {commitHash} (prossimamente)
ru: Просмотр различий для {commitHash} (скоро)
tr: {commitHash} için farkı görüntüle (yakında)
zh: 查看 {commitHash} 的差异（即将推出）

# clearFiltersAction
source: Clear filters
ar: مسح الفلاتر
de: Filter löschen
es: Limpiar filtros
fr: Effacer les filtres
it: Cancella filtri
ru: Очистить фильтры
tr: Filtreleri temizle
zh: 清除过滤器

# noBranchAvailable
source: No branch
ar: لا يوجد فرع
de: Kein Branch
es: Sin rama
fr: Aucune branche
it: Nessun branch
ru: Нет ветки
tr: Dal yok
zh: 无分支

# hintTextCommandPalette
source: What do you want to do?
ar: ماذا تريد أن تفعل؟
de: Was möchten Sie tun?
es: ¿Qué quieres hacer?
fr: Que voulez-vous faire ?
it: Cosa vuoi fare?
ru: Что вы хотите сделать?
tr: Ne yapmak istiyorsunuz?
zh: 你想做什么？

# hintTextSearchFiles
source: Search files...
ar: البحث عن الملفات...
de: Dateien durchsuchen...
es: Buscar archivos...
fr: Rechercher des fichiers...
it: Cerca file...
ru: Поиск файлов...
tr: Dosya ara...
zh: 搜索文件...

# hintTextCommitMessage
source: Enter commit message...
ar: أدخل رسالة الالتزام...
de: Commit-Nachricht eingeben...
es: Ingresa el mensaje del commit...
fr: Entrez le message du commit...
it: Inserisci messaggio di commit...
ru: Введите сообщение коммита...
tr: Commit mesajı girin...
zh: 输入提交消息...
