Repository: kartalbas/flutter-gitui
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

source: No remotes configured
ar: لا توجد مستودعات بعيدة مُعدّة
de: Keine Remotes konfiguriert
es: No hay remotos configurados
fr: Aucun distant configuré
it: Nessun remoto configurato
ru: Удалённые репозитории не настроены
tr: Yapılandırılmış uzak yok
zh: 未配置远程仓库

source: Select Remote
ar: اختر المستودع البعيد
de: Remote auswählen
es: Seleccionar remoto
fr: Sélectionner un distant
it: Seleziona remoto
ru: Выбрать удалённый репозиторий
tr: Uzak Seç
zh: 选择远程仓库

# allTagsPushedSuccess
source: All tags pushed to {remoteName}
ar: تم دفع جميع الوسوم إلى {remoteName}
de: Alle Tags zu {remoteName} gepusht
es: Todas las etiquetas enviadas a {remoteName}
fr: Tous les tags poussés vers {remoteName}
it: Tutti i tag pushati a {remoteName}
ru: Все теги отправлены в {remoteName}
tr: Tüm etiketler {remoteName} üzerine push edildi
zh: 所有标签已推送到 {remoteName}

# pushTagsError
source: Failed to push tags: {error}
ar: فشل دفع الوسوم: {error}
de: Fehler beim Pushen der Tags: {error}
es: Error al enviar etiquetas: {error}
fr: Échec de l'envoi des tags: {error}
it: Errore nel push dei tag: {error}
ru: Ошибка отправки тегов: {error}
tr: Etiket push hatası: {error}
zh: 推送标签失败: {error}

source: Pushing Tags
ar: جاري دفع الوسوم
de: Tags werden gepusht
es: Enviando etiquetas
fr: Envoi des tags
it: Push dei tag
ru: Отправка тегов
tr: Etiketler Push Ediliyor
zh: 正在推送标签

# pushedTagToRemote
source: Pushed {tagName} to {remoteName}
ar: تم دفع {tagName} إلى {remoteName}
de: {tagName} zu {remoteName} gepusht
es: {tagName} enviado a {remoteName}
fr: {tagName} poussé vers {remoteName}
it: {tagName} pushato a {remoteName}
ru: {tagName} отправлен в {remoteName}
tr: {tagName} {remoteName} üzerine push edildi
zh: {tagName} 已推送到 {remoteName}

# tagsPushedSuccess
source: {count, plural, =1{{count} tag pushed to {remoteName}} other{{count} tags pushed to {remoteName}}}
ar: {count, plural, =1{تم دفع وسم واحد إلى {remoteName}} other{تم دفع {count} وسوم إلى {remoteName}}}
de: {count, plural, =1{{count} Tag zu {remoteName} gepusht} other{{count} Tags zu {remoteName} gepusht}}
es: {count, plural, =1{{count} etiqueta enviada a {remoteName}} other{{count} etiquetas enviadas a {remoteName}}}
fr: {count, plural, =1{{count} tag poussé vers {remoteName}} other{{count} tags poussés vers {remoteName}}}
it: {count, plural, =1{{count} tag pushato a {remoteName}} other{{count} tag pushati a {remoteName}}}
ru: {count, plural, =1{{count} тег отправлен в {remoteName}} other{{count} тегов отправлено в {remoteName}}}
tr: {count, plural, =1{{count} etiket {remoteName} üzerine push edildi} other{{count} etiket {remoteName} üzerine push edildi}}
zh: {count, plural, =1{{count} 个标签已推送到 {remoteName}} other{{count} 个标签已推送到 {remoteName}}}

# deleteTagsDialogTitle
source: Delete Tags?
ar: حذف الوسوم؟
de: Tags löschen?
es: ¿Eliminar etiquetas?
fr: Supprimer les tags?
it: Elimina tag?
ru: Удалить теги?
tr: Etiketler Silinsin mi?
zh: 删除标签?

# deleteTagsConfirmation
source: Delete {count, plural, =1{{count} tag} other{{count} tags}}? This action cannot be undone.
ar: حذف {count, plural, =1{وسم واحد} other{{count} وسوم}}؟ لا يمكن التراجع عن هذا الإجراء.
de: {count, plural, =1{{count} Tag löschen} other{{count} Tags löschen}}? Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Eliminar {count, plural, =1{{count} etiqueta} other{{count} etiquetas}}? Esta acción no se puede deshacer.
fr: Supprimer {count, plural, =1{{count} tag} other{{count} tags}}? Cette action ne peut pas être annulée.
it: Elimina {count, plural, =1{{count} tag} other{{count} tag}}?\n\nQuesta azione non può essere annullata.
ru: Удалить {count, plural, =1{{count} тег} other{{count} тегов}}? Это действие нельзя отменить.
tr: {count, plural, =1{{count} etiket} other{{count} etiket}} silinsin mi? Bu işlem geri alınamaz.
zh: 删除 {count, plural, =1{{count} 个标签} other{{count} 个标签}}? 此操作无法撤销。

source: Tags to delete:
ar: الوسوم المراد حذفها:
de: Zu löschende Tags:
es: Etiquetas a eliminar:
fr: Tags à supprimer:
it: Tag da eliminare:
ru: Теги для удаления:
tr: Silinecek etiketler:
zh: 要删除的标签:

source: Also delete from remote
ar: حذف من المستودع البعيد أيضاً
de: Auch von Remote löschen
es: También eliminar del remoto
fr: Supprimer également du distant
it: Elimina anche dal remoto
ru: Также удалить с удалённого репозитория
tr: Uzaktan da sil
zh: 同时从远程删除

# deleteFromRemoteDescription
source: Delete tags from remote repository to prevent them from coming back when fetching
ar: حذف الوسوم من المستودع البعيد لمنع عودتها عند الجلب
de: Tags vom Remote-Repository löschen, um zu verhindern, dass sie beim Abrufen zurückkommen
es: Eliminar etiquetas del repositorio remoto para evitar que vuelvan al obtenerlas
fr: Supprimer les tags du dépôt distant pour éviter qu'ils ne reviennent lors de la récupération
it: Elimina i tag dal repository remoto per evitare che tornino durante il fetch
ru: Удалить теги из удалённого репозитория, чтобы они не вернулись при загрузке
tr: Etiketleri uzak depodan silin, getirme sırasında geri gelmelerini önleyin
zh: 从远程仓库删除标签以防止获取时返回

# deletingTagsLocalAndRemote
source: Deleting Tags (Local & Remote)
ar: جاري حذف الوسوم (محلياً وبعيداً)
de: Tags werden gelöscht (Lokal & Remote)
es: Eliminando etiquetas (Local y Remoto)
fr: Suppression des tags (Local et Distant)
it: Eliminazione tag (Locale e Remoto)
ru: Удаление тегов (Локально и удалённо)
tr: Etiketler Siliniyor (Yerel ve Uzak)
zh: 正在删除标签 (本地和远程)

# deletingTagsLocal
source: Deleting Tags
ar: جاري حذف الوسوم
de: Tags werden gelöscht
es: Eliminando etiquetas
fr: Suppression des tags
it: Eliminazione tag
ru: Удаление тегов
tr: Etiketler Siliniyor
zh: 正在删除标签

# deletedTagLocally
source: Deleted {tagName} locally
ar: تم حذف {tagName} محلياً
de: {tagName} lokal gelöscht
es: {tagName} eliminada localmente
fr: {tagName} supprimé localement
it: {tagName} eliminato localmente
ru: {tagName} удалён локально
tr: {tagName} yerel olarak silindi
zh: {tagName} 已在本地删除

# deletedTagFromRemote
source: Deleted {tagName} from {remoteName}
ar: تم حذف {tagName} من {remoteName}
de: {tagName} von {remoteName} gelöscht
es: {tagName} eliminada de {remoteName}
fr: {tagName} supprimé de {remoteName}
it: {tagName} eliminato da {remoteName}
ru: {tagName} удалён из {remoteName}
tr: {tagName} {remoteName} üzerinden silindi
zh: {tagName} 已从 {remoteName} 删除

# tagsDeletedSuccess
source: {count, plural, =1{{count} tag deleted} other{{count} tags deleted}}
ar: {count, plural, =1{تم حذف وسم واحد} other{تم حذف {count} وسوم}}
de: {count, plural, =1{{count} Tag gelöscht} other{{count} Tags gelöscht}}
es: {count, plural, =1{{count} etiqueta eliminada} other{{count} etiquetas eliminadas}}
fr: {count, plural, =1{{count} tag supprimé} other{{count} tags supprimés}}
it: {count, plural, =1{{count} tag eliminato} other{{count} tag eliminati}}
ru: {count, plural, =1{{count} тег удалён} other{{count} тегов удалено}}
tr: {count, plural, =1{{count} etiket silindi} other{{count} etiket silindi}}
zh: {count, plural, =1{{count} 个标签已删除} other{{count} 个标签已删除}}

# deleteTagsError
source: Failed to delete tags: {error}
ar: فشل حذف الوسوم: {error}
de: Fehler beim Löschen der Tags: {error}
es: Error al eliminar etiquetas: {error}
fr: Échec de la suppression des tags: {error}
it: Errore nell'eliminazione dei tag: {error}
ru: Ошибка удаления тегов: {error}
tr: Etiket silme hatası: {error}
zh: 删除标签失败: {error}

# localBadge
source: LOCAL
ar: محلي
de: LOKAL
it: LOCALE
ru: ЛОКАЛЬНЫЙ
tr: YEREL
zh: 本地

source: View Diff
ar: عرض المقارنة
de: Diff anzeigen
es: Ver diferencias
fr: Voir les différences
it: Visualizza differenze
ru: Показать различия
tr: Farkı Görüntüle
zh: 查看差异

source: Type
ar: النوع
de: Typ
es: Tipo
it: Tipo
ru: Тип
tr: Tür
zh: 类型

source: Annotated
ar: مشروح
de: Annotiert
es: Anotada
fr: Annoté
it: Annotato
ru: С аннотацией
tr: Açıklamalı
zh: 附注

source: Lightweight
ar: خفيف
de: Leichtgewichtig
es: Ligera
fr: Léger
it: Leggero
ru: Облегчённый
tr: Hafif
zh: 轻量

source: Tagger
ar: الواسم
es: Etiquetador
it: Autore Tag
ru: Создатель тега
tr: Etiketleyen
zh: 标签者

source: Date
ar: التاريخ
de: Datum
es: Fecha
it: Data
ru: Дата
tr: Tarih
zh: 日期

# checkoutTagDialogTitle
source: Checkout Tag?
ar: سحب الوسم؟
de: Tag auschecken?
es: ¿Hacer checkout de etiqueta?
fr: Checkout du tag?
it: Checkout del tag?
ru: Переключиться на тег?
tr: Etiket Checkout Edilsin mi?
zh: 检出标签?

# checkoutTagConfirmation
source: Checkout tag "{tagName}"? This will put you in a detached HEAD state.
ar: سحب الوسم "{tagName}"؟ سيؤدي هذا إلى وضعك في حالة HEAD منفصل.
de: Tag "{tagName}" auschecken? Dies versetzt Sie in einen "detached HEAD"-Zustand.
es: ¿Hacer checkout de la etiqueta "{tagName}"? Esto lo dejará en un estado de HEAD separado.
fr: Checkout du tag "{tagName}"? Cela vous placera dans un état HEAD détaché.
it: Checkout del tag "{tagName}"?\n\nQuesto ti metterà in uno stato HEAD scollegato.
ru: Переключиться на тег "{tagName}"? Это переведёт вас в состояние отделённого HEAD.
tr: "{tagName}" etiketi checkout edilsin mi? Bu sizi ayrık HEAD durumuna getirecektir.
zh: 检出标签 "{tagName}"? 这将使您进入分离 HEAD 状态。

# checkedOutTagSuccess
source: Checked out tag "{tagName}"
ar: تم سحب الوسم "{tagName}"
de: Tag "{tagName}" ausgecheckt
es: Checkout de etiqueta "{tagName}" realizado
fr: Checkout du tag "{tagName}" effectué
it: Checkout del tag "{tagName}" effettuato
ru: Переключено на тег "{tagName}"
tr: "{tagName}" etiketi checkout edildi
zh: 已检出标签 "{tagName}"

# checkoutTagError
source: Failed to checkout tag: {error}
ar: فشل سحب الوسم: {error}
de: Fehler beim Auschecken des Tags: {error}
es: Error al hacer checkout de la etiqueta: {error}
fr: Échec du checkout du tag: {error}
it: Errore nel checkout del tag: {error}
ru: Ошибка переключения на тег: {error}
tr: Etiket checkout hatası: {error}
zh: 检出标签失败: {error}

# tagPushedSuccess
source: Tag "{tagName}" pushed to {remoteName}
ar: تم دفع الوسم "{tagName}" إلى {remoteName}
de: Tag "{tagName}" zu {remoteName} gepusht
es: Etiqueta "{tagName}" enviada a {remoteName}
fr: Tag "{tagName}" poussé vers {remoteName}
it: Tag "{tagName}" pushato a {remoteName}
ru: Тег "{tagName}" отправлен в {remoteName}
tr: "{tagName}" etiketi {remoteName} üzerine push edildi
zh: 标签 "{tagName}" 已推送到 {remoteName}

# pushTagError
source: Failed to push tag: {error}
ar: فشل دفع الوسم: {error}
de: Fehler beim Pushen des Tags: {error}
es: Error al enviar etiqueta: {error}
fr: Échec de l'envoi du tag: {error}
it: Errore nel push del tag: {error}
ru: Ошибка отправки тега: {error}
tr: Etiket push hatası: {error}
zh: 推送标签失败: {error}

# deleteTagDialogTitle
source: Delete Tag?
ar: حذف الوسم؟
de: Tag löschen?
es: ¿Eliminar etiqueta?
fr: Supprimer le tag?
it: Elimina tag?
ru: Удалить тег?
tr: Etiket Silinsin mi?
zh: 删除标签?

# deletingTagLocalAndRemote
source: Deleting Tag (Local & Remote)
ar: جاري حذف الوسم (محلياً وبعيداً)
de: Tag wird gelöscht (Lokal & Remote)
es: Eliminando etiqueta (Local y Remoto)
fr: Suppression du tag (Local et Distant)
it: Eliminazione tag (Locale e Remoto)
ru: Удаление тега (Локально и удалённо)
tr: Etiket Siliniyor (Yerel ve Uzak)
zh: 正在删除标签 (本地和远程)

source: Deleting Tag
ar: جاري حذف الوسم
de: Tag wird gelöscht
es: Eliminando etiqueta
fr: Suppression du tag
it: Eliminazione tag
ru: Удаление тега
tr: Etiket Siliniyor
zh: 正在删除标签

# deletingTagLocally
source: Deleting "{tagName}" locally...
ar: جاري حذف "{tagName}" محلياً...
de: "{tagName}" wird lokal gelöscht...
es: Eliminando "{tagName}" localmente...
fr: Suppression de "{tagName}" localement...
it: Eliminazione di "{tagName}" localmente...
ru: Удаление "{tagName}" локально...
tr: "{tagName}" yerel olarak siliniyor...
zh: 正在本地删除 "{tagName}"...

# deletingTagFromRemote
source: Deleting "{tagName}" from {remoteName}...
ar: جاري حذف "{tagName}" من {remoteName}...
de: "{tagName}" wird von {remoteName} gelöscht...
es: Eliminando "{tagName}" de {remoteName}...
fr: Suppression de "{tagName}" de {remoteName}...
it: Eliminazione di "{tagName}" da {remoteName}...
ru: Удаление "{tagName}" из {remoteName}...
tr: "{tagName}" {remoteName} üzerinden siliniyor...
zh: 正在从 {remoteName} 删除 "{tagName}"...

source: Updating list...
ar: جاري تحديث القائمة...
de: Liste wird aktualisiert...
es: Actualizando lista...
fr: Mise à jour de la liste...
it: Aggiornamento lista...
ru: Обновление списка...
tr: Liste güncelleniyor...
zh: 正在更新列表...

# tagDeletedSuccess
source: Tag "{tagName}" deleted
ar: تم حذف الوسم "{tagName}"
de: Tag "{tagName}" gelöscht
es: Etiqueta "{tagName}" eliminada
fr: Tag "{tagName}" supprimé
it: Tag "{tagName}" eliminato
ru: Тег "{tagName}" удалён
tr: "{tagName}" etiketi silindi
zh: 标签 "{tagName}" 已删除

# deleteTagError
source: Failed to delete tag: {error}
ar: فشل حذف الوسم: {error}
de: Fehler beim Löschen des Tags: {error}
es: Error al eliminar etiqueta: {error}
fr: Échec de la suppression du tag: {error}
it: Errore nell'eliminazione del tag: {error}
ru: Ошибка удаления тега: {error}
tr: Etiket silme hatası: {error}
zh: 删除标签失败: {error}

source: This week
ar: هذا الأسبوع
de: Diese Woche
es: Esta semana
fr: Cette semaine
it: Questa settimana
ru: На этой неделе
tr: Bu hafta
zh: 本周

source: This month
ar: هذا الشهر
de: Diesen Monat
es: Este mes
fr: Ce mois
it: Questo mese
ru: В этом месяце
tr: Bu ay
zh: 本月

source: This Year
ar: هذا العام
de: Dieses Jahr
es: Este año
fr: Cette année
it: Quest'anno
ru: В этом году
tr: Bu Yıl
zh: 今年

# yearsAgo
source: {count, plural, =1{1 Year Ago} other{{count} Years Ago}}
ar: {count, plural, =1{منذ عام} other{منذ {count} أعوام}}
de: {count, plural, =1{Vor 1 Jahr} other{Vor {count} Jahren}}
es: {count, plural, =1{Hace 1 año} other{Hace {count} años}}
fr: {count, plural, =1{Il y a 1 an} other{Il y a {count} ans}}
it: {count, plural, =1{1 anno fa} other{{count} anni fa}}
ru: {count, plural, =1{1 год назад} other{{count} лет назад}}
tr: {count, plural, =1{1 Yıl Önce} other{{count} Yıl Önce}}
zh: {count, plural, =1{1 年前} other{{count} 年前}}

source: Non-versioned
ar: بدون إصدار
de: Nicht versioniert
es: Sin versión
fr: Non versionné
it: Non versionato
ru: Без версии
tr: Sürümsüz
zh: 无版本

# groupTagCount
source: {count, plural, =1{{count} tag} other{{count} tags}}
ar: {count, plural, =1{وسم واحد} other{{count} وسوم}}
es: {count, plural, =1{{count} etiqueta} other{{count} etiquetas}}
it: {count, plural, =1{{count} tag} other{{count} tag}}
ru: {count, plural, =1{{count} тег} other{{count} тегов}}
tr: {count, plural, =1{{count} etiket} other{{count} etiket}}
zh: {count, plural, =1{{count} 个标签} other{{count} 个标签}}

source: No Stashes
ar: لا يوجد مخزون
de: Keine Stashes
es: Sin stashes
fr: Aucun stash
it: Nessuno stash
ru: Нет отложенных изменений
tr: Stash Yok
zh: 无储藏

# createStashToSaveWork
source: Create a stash to save your work in progress
ar: أنشئ مخزوناً لحفظ عملك الجاري
de: Erstellen Sie einen Stash, um Ihre laufenden Arbeiten zu speichern
es: Cree un stash para guardar su trabajo en progreso
fr: Créez un stash pour sauvegarder votre travail en cours
it: Crea uno stash per salvare il tuo lavoro in corso
ru: Создайте stash для сохранения вашей работы
tr: Devam eden çalışmanızı kaydetmek için bir stash oluşturun
zh: 创建储藏以保存您的工作进度

source: Create Stash
ar: إنشاء مخزون
de: Stash erstellen
es: Crear stash
fr: Créer un stash
it: Crea stash
ru: Создать stash
tr: Stash Oluştur
zh: 创建储藏

# openRepositoryToManageStashes
source: Open a repository to manage stashes
ar: افتح مستودعاً لإدارة المخزون
de: Öffnen Sie ein Repository, um Stashes zu verwalten
es: Abra un repositorio para administrar stashes
fr: Ouvrez un dépôt pour gérer les stashes
it: Apri un repository per gestire gli stash
ru: Откройте репозиторий для управления stash
tr: Stash'leri yönetmek için bir depo açın
zh: 打开仓库以管理储藏

# stashCount
source: {count, plural, =1{{count} Stash} other{{count} Stashes}}
ar: {count, plural, =1{مخزون واحد} other{{count} مخزونات}}
it: {count, plural, =1{{count} Stash} other{{count} Stash}}
ru: {count, plural, =1{{count} Stash} other{{count} Stash}}
tr: {count, plural, =1{{count} Stash} other{{count} Stash}}
zh: {count, plural, =1{{count} 个储藏} other{{count} 个储藏}}

# createStashDialogTitle
source: Create Stash
ar: إنشاء مخزون
de: Stash erstellen
es: Crear stash
fr: Créer un stash
it: Crea stash
ru: Создать stash
tr: Stash Oluştur
zh: 创建储藏

# saveChangesToStash
source: Save your current changes to a stash
ar: احفظ تغييراتك الحالية في مخزون
de: Speichern Sie Ihre aktuellen Änderungen in einem Stash
es: Guardar sus cambios actuales en un stash
fr: Enregistrer vos modifications actuelles dans un stash
it: Salva le tue modifiche correnti in uno stash
ru: Сохранить текущие изменения в stash
tr: Mevcut değişikliklerinizi bir stash'e kaydedin
zh: 将当前更改保存到储藏

source: Message (optional)
ar: الرسالة (اختياري)
de: Nachricht (optional)
es: Mensaje (opcional)
fr: Message (optionnel)
it: Messaggio (opzionale)
ru: Сообщение (необязательно)
tr: Mesaj (isteğe bağlı)
zh: 消息 (可选)

# describeWorkPlaceholder
source: Describe what you were working on...
ar: صف ما كنت تعمل عليه...
de: Beschreiben Sie, woran Sie gearbeitet haben...
es: Describa en qué estaba trabajando...
fr: Décrivez ce sur quoi vous travailliez...
it: Descrivi su cosa stavi lavorando...
ru: Опишите, над чем вы работали...
tr: Üzerinde çalıştığınız şeyi açıklayın...
zh: 描述您正在进行的工作...

source: Stash all files
ar: تخزين جميع الملفات
de: Alle Dateien stashen
es: Stash de todos los archivos
fr: Stash de tous les fichiers
it: Stash di tutti i file
ru: Отложить все файлы
tr: Tüm dosyaları stash'le
zh: 储藏所有文件

# toggleSelectSpecificFiles
source: Toggle to select specific files
ar: التبديل لتحديد ملفات محددة
de: Umschalten, um bestimmte Dateien auszuwählen
es: Alternar para seleccionar archivos específicos
fr: Basculer pour sélectionner des fichiers spécifiques
it: Attiva per selezionare file specifici
ru: Переключить для выбора конкретных файлов
tr: Belirli dosyaları seçmek için değiştir
zh: 切换以选择特定文件

# selectFilesToStash
source: Select files to stash ({selected}/{total})
ar: حدد الملفات للتخزين ({selected}/{total})
de: Dateien zum Stashen auswählen ({selected}/{total})
es: Seleccionar archivos para stash ({selected}/{total})
fr: Sélectionner les fichiers à stasher ({selected}/{total})
it: Seleziona file per lo stash ({selected}/{total})
ru: Выбрать файлы для stash ({selected}/{total})
tr: Stash'lenecek dosyaları seçin ({selected}/{total})
zh: 选择要储藏的文件 ({selected}/{total})

source: No files to stash
ar: لا توجد ملفات للتخزين
de: Keine Dateien zum Stashen
es: No hay archivos para stash
fr: Aucun fichier à stasher
it: Nessun file per lo stash
ru: Нет файлов для stash
tr: Stash'lenecek dosya yok
zh: 没有要储藏的文件

source: Include untracked files
ar: تضمين الملفات غير المتعقبة
de: Unverfolgte Dateien einschließen
es: Incluir archivos sin seguimiento
fr: Inclure les fichiers non suivis
it: Includi file non tracciati
ru: Включить неотслеживаемые файлы
tr: İzlenmeyen dosyaları dahil et
zh: 包含未跟踪的文件

source: Keep staged changes
ar: الاحتفاظ بالتغييرات المرحلية
de: Gestagete Änderungen behalten
es: Mantener cambios preparados
fr: Conserver les modifications indexées
it: Mantieni le modifiche in stage
ru: Сохранить проиндексированные изменения
tr: Hazırlanan değişiklikleri tut
zh: 保留暂存的更改

# keepChangesInIndex
source: Keep changes in the index after stashing
ar: الاحتفاظ بالتغييرات في الفهرس بعد التخزين
de: Änderungen im Index nach dem Stashen behalten
es: Mantener cambios en el índice después del stash
fr: Conserver les modifications dans l'index après le stash
it: Mantieni le modifiche nell'indice dopo lo stash
ru: Сохранить изменения в индексе после stash
tr: Stash'ten sonra değişiklikleri indekste tut
zh: 储藏后在索引中保留更改

# stashCreatedSuccess
source: Stash created successfully
ar: تم إنشاء المخزون بنجاح
de: Stash erfolgreich erstellt
es: Stash creado correctamente
fr: Stash créé avec succès
it: Stash creato con successo
ru: Stash успешно создан
tr: Stash başarıyla oluşturuldu
zh: 储藏创建成功

# createStashError
source: Failed to create stash: {error}
ar: فشل إنشاء المخزون: {error}
de: Fehler beim Erstellen des Stashes: {error}
es: Error al crear stash: {error}
fr: Échec de la création du stash: {error}
it: Errore nella creazione dello stash: {error}
ru: Ошибка создания stash: {error}
tr: Stash oluşturma hatası: {error}
zh: 创建储藏失败: {error}

# clearAllStashesDialogTitle
source: Clear All Stashes?
ar: مسح كل المخزون؟
de: Alle Stashes löschen?
es: ¿Limpiar todos los stashes?
fr: Effacer tous les stashes?
it: Cancella tutti gli stash?
ru: Очистить все stash?
tr: Tüm Stash'ler Temizlensin mi?
zh: 清除所有储藏?

# clearAllStashesConfirmation
source: This will permanently delete all stashes. This action cannot be undone.
ar: سيؤدي هذا إلى حذف كل المخزون نهائياً. لا يمكن التراجع عن هذا الإجراء.
de: Dies löscht dauerhaft alle Stashes. Diese Aktion kann nicht rückgängig gemacht werden.
es: Esto eliminará permanentemente todos los stashes. Esta acción no se puede deshacer.
fr: Cela supprimera définitivement tous les stashes. Cette action ne peut pas être annulée.
it: Questo eliminerà permanentemente tutti gli stash.\n\nQuesta azione non può essere annullata.
ru: Это навсегда удалит все stash. Это действие нельзя отменить.
tr: Bu, tüm stash'leri kalıcı olarak silecektir. Bu işlem geri alınamaz.
zh: 这将永久删除所有储藏。 此操作无法撤销。

# allStashesClearedSuccess
source: All stashes cleared
ar: تم مسح كل المخزون
de: Alle Stashes gelöscht
es: Todos los stashes limpiados
fr: Tous les stashes effacés
it: Tutti gli stash cancellati
ru: Все stash очищены
tr: Tüm stash'ler temizlendi
zh: 所有储藏已清除

# clearStashesError
source: Failed to clear stashes: {error}
ar: فشل مسح المخزون: {error}
de: Fehler beim Löschen der Stashes: {error}
es: Error al limpiar stashes: {error}
fr: Échec de l'effacement des stashes: {error}
it: Errore nella cancellazione degli stash: {error}
ru: Ошибка очистки stash: {error}
tr: Stash temizleme hatası: {error}
zh: 清除储藏失败: {error}

source: Create Branch
ar: إنشاء فرع
de: Branch erstellen
es: Crear rama
fr: Créer une branche
it: Crea branch
ru: Создать ветку
tr: Dal Oluştur
zh: 创建分支

# appliedStashSuccess
source: Applied {stashRef}
ar: تم تطبيق {stashRef}
de: {stashRef} angewendet
es: {stashRef} aplicado
fr: {stashRef} appliqué
it: {stashRef} applicato
ru: {stashRef} применён
tr: {stashRef} uygulandı
zh: 已应用 {stashRef}

# applyStashError
source: Failed to apply stash: {error}
ar: فشل تطبيق المخزون: {error}
de: Fehler beim Anwenden des Stashes: {error}
es: Error al aplicar stash: {error}
fr: Échec de l'application du stash: {error}
it: Errore nell'applicazione dello stash: {error}
ru: Ошибка применения stash: {error}
tr: Stash uygulama hatası: {error}
zh: 应用储藏失败: {error}

# poppedStashSuccess
source: Popped {stashRef}
ar: تم استخراج {stashRef}
de: {stashRef} gepoppt
es: {stashRef} extraído
fr: {stashRef} extrait
it: {stashRef} estratto
ru: {stashRef} извлечён
tr: {stashRef} çıkarıldı
zh: 已弹出 {stashRef}

# popStashError
source: Failed to pop stash: {error}
ar: فشل استخراج المخزون: {error}
de: Fehler beim Poppen des Stashes: {error}
es: Error al extraer stash: {error}
fr: Échec de l'extraction du stash: {error}
it: Errore nell'estrazione dello stash: {error}
ru: Ошибка извлечения stash: {error}
tr: Stash çıkarma hatası: {error}
zh: 弹出储藏失败: {error}

# loadDiffError
source: Failed to load diff: {error}
ar: فشل تحميل المقارنة: {error}
de: Fehler beim Laden des Diffs: {error}
es: Error al cargar diferencias: {error}
fr: Échec du chargement des différences: {error}
it: Errore nel caricamento delle differenze: {error}
ru: Ошибка загрузки различий: {error}
tr: Fark yükleme hatası: {error}
zh: 加载差异失败: {error}

source: Create Branch from Stash
ar: إنشاء فرع من المخزون
de: Branch aus Stash erstellen
es: Crear rama desde stash
fr: Créer une branche depuis le stash
it: Crea branch da stash
ru: Создать ветку из stash
tr: Stash'ten Dal Oluştur
zh: 从储藏创建分支
