Repository: kartalbas/flutter-gitui
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# createBranchFromStashDescription
source: Create a new branch from {stashRef}
ar: إنشاء فرع جديد من {stashRef}
de: Einen neuen Branch aus {stashRef} erstellen
es: Crear una nueva rama desde {stashRef}
fr: Créer une nouvelle branche depuis {stashRef}
it: Crea un nuovo branch da {stashRef}
ru: Создать новую ветку из {stashRef}
tr: {stashRef} üzerinden yeni bir dal oluştur
zh: 从 {stashRef} 创建新分支

source: Branch name...
ar: اسم الفرع
es: Nombre de rama
fr: Nom de la branche
it: Nome del branch
ru: Имя ветки
tr: Dal Adı
zh: 分支名称

# createdBranchFromStashSuccess
source: Created branch "{branchName}" from {stashRef}
ar: تم إنشاء الفرع "{branchName}" من {stashRef}
de: Branch "{branchName}" aus {stashRef} erstellt
es: Rama "{branchName}" creada desde {stashRef}
fr: Branche "{branchName}" créée depuis {stashRef}
it: Branch "{branchName}" creato da {stashRef}
ru: Ветка "{branchName}" создана из {stashRef}
tr: "{branchName}" dalı {stashRef} üzerinden oluşturuldu
zh: 分支 "{branchName}" 已从 {stashRef} 创建

# createBranchError
source: Failed to create branch: {error}
ar: فشل إنشاء الفرع: {error}
de: Fehler beim Erstellen des Branches: {error}
es: Error al crear rama: {error}
fr: Échec de la création de la branche: {error}
it: Errore nella creazione del branch: {error}
ru: Ошибка создания ветки: {error}
tr: Dal oluşturma hatası: {error}
zh: 创建分支失败: {error}

# dropStashDialogTitle
source: Drop Stash?
ar: إسقاط المخزون؟
de: Stash verwerfen?
es: ¿Descartar stash?
fr: Abandonner le stash?
it: Elimina stash?
ru: Удалить stash?
tr: Stash Bırakılsın mı?
zh: 丢弃储藏?

# dropStashConfirmation
source: Drop {stashRef}? This action cannot be undone.
ar: إسقاط {stashRef}؟ لا يمكن التراجع عن هذا الإجراء.
de: {stashRef} verwerfen? Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Descartar {stashRef}? Esta acción no se puede deshacer.
fr: Abandonner {stashRef}? Cette action ne peut pas être annulée.
it: Elimina {stashRef}?\n\nQuesta azione non può essere annullata.
ru: Удалить {stashRef}? Это действие нельзя отменить.
tr: {stashRef} bırakılsın mı? Bu işlem geri alınamaz.
zh: 丢弃 {stashRef}? 此操作无法撤销。

# droppedStashSuccess
source: Dropped {stashRef}
ar: تم إسقاط {stashRef}
de: {stashRef} verworfen
es: {stashRef} descartado
fr: {stashRef} abandonné
it: {stashRef} eliminato
ru: {stashRef} удалён
tr: {stashRef} bırakıldı
zh: 已丢弃 {stashRef}

# dropStashError
source: Failed to drop stash: {error}
ar: فشل إسقاط المخزون: {error}
de: Fehler beim Verwerfen des Stashes: {error}
es: Error al descartar stash: {error}
fr: Échec de l'abandon du stash: {error}
it: Errore nell'eliminazione dello stash: {error}
ru: Ошибка удаления stash: {error}
tr: Stash bırakma hatası: {error}
zh: 丢弃储藏失败: {error}

# stashDiffDialogTitle
source: Stash Diff - {stashRef}
ar: مقارنة المخزون - {stashRef}
es: Diferencias de stash - {stashRef}
fr: Différences du stash - {stashRef}
it: Diff dello stash - {stashRef}
ru: Различия stash - {stashRef}
tr: Stash Farkı - {stashRef}
zh: 储藏差异 - {stashRef}

source: No changes
ar: لا توجد تغييرات
de: Keine Änderungen
es: Sin cambios
fr: Aucun changement
it: Nessuna modifica
ru: Нет изменений
tr: Değişiklik yok
zh: 无变更

source: Clone Repository
ar: استنساخ المستودع
de: Repository klonen
es: Clonar repositorio
fr: Cloner le dépôt
it: Clona repository
ru: Клонировать репозиторий
tr: Depo klonla
zh: 克隆仓库

# cloneRepositoryDescription
source: Clone a Git repository from a URL
ar: استنساخ مستودع Git من عنوان URL بعيد
de: Ein Git-Repository von einer URL klonen
es: Clonar un repositorio Git desde una URL
fr: Cloner un dépôt Git depuis une URL
it: Clona un repository Git da un URL
ru: Клонировать Git-репозиторий из URL
tr: Bir URL'den Git deposu klonla
zh: 从 URL 克隆 Git 仓库

source: Repository URL
ar: عنوان URL للمستودع
es: URL del repositorio
fr: URL du dépôt
it: URL del repository
ru: URL репозитория
tr: Depo URL'si
zh: 仓库 URL

source: Destination Path
ar: مسار الوجهة
de: Zielpfad
es: Ruta de destino
fr: Chemin de destination
it: Percorso di destinazione
ru: Путь назначения
tr: Hedef Yolu
zh: 目标路径

source: Branch (optional)
ar: الفرع (اختياري)
es: Rama (opcional)
fr: Branche (optionnelle)
it: Branch (opzionale)
ru: Ветка (необязательно)
tr: Dal (isteğe bağlı)
zh: 分支 (可选)

source: Shallow Clone
ar: استنساخ سطحي
de: Flaches Klonen
es: Clon superficial
fr: Clone superficiel
it: Clone superficiale
ru: Поверхностное клонирование
tr: Sığ Klonlama
zh: 浅克隆

# shallowCloneDescription
source: Clone only recent history to save space
ar: استنساخ أحدث التواريخ فقط (أسرع، حجم أصغر)
de: Nur den aktuellen Verlauf klonen, um Speicherplatz zu sparen
es: Clonar solo el historial reciente para ahorrar espacio
fr: Cloner uniquement l'historique récent pour économiser de l'espace
it: Clona solo la cronologia recente per risparmiare spazio
ru: Клонировать только последнюю историю для экономии места
tr: Alan kazanmak için sadece son geçmişi klonla
zh: 仅克隆最近的历史记录以节省空间

source: Depth:
ar: العمق
de: Tiefe:
es: Profundidad:
fr: Profondeur:
it: Profondità:
ru: Глубина:
tr: Derinlik:
zh: 深度:

# cloningRepositoryProgress
source: Cloning repository... This may take a while.
ar: جارٍ استنساخ المستودع...
de: Repository wird geklont... Dies kann eine Weile dauern.
es: Clonando repositorio... Esto puede tardar un momento.
fr: Clonage du dépôt... Cela peut prendre un moment.
it: Clonazione repository... Potrebbe richiedere un momento.
ru: Клонирование репозитория... Это может занять некоторое время.
tr: Depo klonlanıyor... Bu biraz zaman alabilir.
zh: 正在克隆仓库... 这可能需要一些时间。

source: Clone
ar: استنساخ
de: Klonen
es: Clonar
fr: Cloner
it: Clona
ru: Клонировать
tr: Klonla
zh: 克隆

# directorySelectionNotAvailableInBrowser
source: Directory selection is not available in web browsers
ar: تحديد المجلد غير متاح في المتصفح
de: Verzeichnisauswahl ist in Webbrowsern nicht verfügbar
es: La selección de directorio no está disponible en navegadores web
fr: La sélection de répertoire n'est pas disponible dans les navigateurs web
it: La selezione della directory non è disponibile nei browser web
ru: Выбор каталога недоступен в веб-браузерах
tr: Web tarayıcılarında dizin seçimi kullanılamaz
zh: Web 浏览器中不支持目录选择

source: Select Destination for Clone
ar: اختر وجهة الاستنساخ
de: Ziel für Klonen auswählen
es: Seleccionar destino para clonación
fr: Sélectionner la destination pour le clone
it: Seleziona destinazione per il clone
ru: Выбрать место назначения для клонирования
tr: Klonlama için Hedef Seç
zh: 选择克隆目标

# pleaseEnterRepositoryUrl
source: Please enter a repository URL
ar: يرجى إدخال عنوان URL للمستودع
de: Bitte geben Sie eine Repository-URL ein
es: Por favor, introduzca una URL de repositorio
fr: Veuillez entrer une URL de dépôt
it: Inserisci un URL del repository
ru: Пожалуйста, введите URL репозитория
tr: Lütfen bir depo URL'si girin
zh: 请输入仓库 URL

# pleaseEnterDestinationPath
source: Please enter a destination path
ar: يرجى إدخال مسار الوجهة
de: Bitte geben Sie einen Zielpfad ein
es: Por favor, introduzca una ruta de destino
fr: Veuillez entrer un chemin de destination
it: Inserisci un percorso di destinazione
ru: Пожалуйста, введите путь назначения
tr: Lütfen bir hedef yolu girin
zh: 请输入目标路径

# repositoryClonedSuccess
source: Repository cloned successfully to {path}
ar: تم استنساخ المستودع بنجاح
de: Repository erfolgreich nach {path} geklont
es: Repositorio clonado correctamente en {path}
fr: Dépôt cloné avec succès vers {path}
it: Repository clonato con successo in {path}
ru: Репозиторий успешно клонирован в {path}
tr: Depo başarıyla {path} konumuna klonlandı
zh: 仓库已成功克隆到 {path}

source: Repository cloned but failed to open
ar: تم استنساخ المستودع ولكن فشل في فتحه
de: Repository geklont, aber Öffnen fehlgeschlagen
es: Repositorio clonado pero no se pudo abrir
fr: Dépôt cloné mais échec de l'ouverture
it: Repository clonato ma impossibile aprirlo
ru: Репозиторий клонирован, но не удалось открыть
tr: Depo klonlandı ancak açılamadı
zh: 仓库已克隆但打开失败

# cloneRepositoryError
source: Failed to clone repository: {error}
ar: فشل استنساخ المستودع
de: Fehler beim Klonen des Repositorys: {error}
es: Error al clonar repositorio: {error}
fr: Échec du clonage du dépôt: {error}
it: Errore nella clonazione del repository: {error}
ru: Ошибка клонирования репозитория: {error}
tr: Depo klonlama hatası: {error}
zh: 克隆仓库失败: {error}

source: Reference
ar: المرجع
de: Referenz
es: Referencia
fr: Référence
it: Riferimento
ru: Ссылка
tr: Referans
zh: 引用

source: Created
ar: تم الإنشاء
de: Erstellt
es: Creado
fr: Créé
it: Creato
ru: Создано
tr: Oluşturuldu
zh: 创建于

# openRepositoryToManageTags
source: Open a repository to manage tags
ar: افتح مستودعاً لإدارة الوسوم
de: Öffnen Sie ein Repository, um Tags zu verwalten
es: Abra un repositorio para administrar etiquetas
fr: Ouvrez un dépôt pour gérer les tags
it: Apri un repository per gestire i tag
ru: Откройте репозиторий для управления тегами
tr: Etiketleri yönetmek için bir depo açın
zh: 打开仓库以管理标签

source: Working Directory Clean
ar: مجلد العمل نظيف
de: Arbeitsverzeichnis sauber
es: Directorio de trabajo limpio
fr: Répertoire de travail propre
it: Directory di Lavoro Pulita
ru: Рабочий каталог чист
tr: Çalışma Dizini Temiz
zh: 工作目录清理

source: No changes to commit
ar: لا توجد تغييرات للإيداع
de: Keine Änderungen zum Committen
es: No hay cambios para confirmar
fr: Aucune modification à valider
it: Nessuna modifica da committare
ru: Нет изменений для фиксации
tr: Commit edilecek değişiklik yok
zh: 无更改可提交

source: Error Loading Status
ar: خطأ في تحميل الحالة
de: Fehler beim Laden des Status
es: Error al cargar estado
fr: Erreur lors du chargement du statut
it: Errore nel Caricamento dello Stato
ru: Ошибка загрузки статуса
tr: Durum Yüklenirken Hata
zh: 加载状态时出错

source: Error Loading Stashes
ar: خطأ في تحميل المخزون
de: Fehler beim Laden der Stashes
es: Error al cargar stashes
fr: Erreur lors du chargement des stashes
it: Errore nel Caricamento degli Stash
ru: Ошибка загрузки Stash
tr: Stash'ler Yüklenirken Hata
zh: 加载储藏时出错

# createStashToSaveWorkInProgress
source: Create a stash to save your work in progress
ar: أنشئ مخزوناً لحفظ عملك الجاري
de: Einen Stash erstellen, um Ihre laufende Arbeit zu speichern
es: Crear stash para guardar trabajo en progreso
fr: Créez un stash pour sauvegarder votre travail en cours
it: Crea uno stash per salvare il lavoro in corso
ru: Создайте stash для сохранения текущей работы
tr: Devam eden çalışmanızı kaydetmek için bir stash oluşturun
zh: 创建储藏以保存正在进行的工作

source: Error Loading Tags
ar: خطأ في تحميل الوسوم
de: Fehler beim Laden der Tags
es: Error al cargar etiquetas
fr: Erreur lors du chargement des tags
it: Errore nel Caricamento dei Tag
ru: Ошибка загрузки тегов
tr: Etiketler Yüklenirken Hata
zh: 加载标签时出错

# openRepositoryToBrowseFiles
source: Open a repository to browse files
ar: افتح مستودعًا لتصفح الملفات
de: Öffnen Sie ein Repository, um Dateien zu durchsuchen
es: Abra un repositorio para explorar archivos
fr: Ouvrez un dépôt pour parcourir les fichiers
it: Apri un repository per sfogliare i file
ru: Откройте репозиторий для просмотра файлов
tr: Dosyaları göz atmak için bir depo açın
zh: 打开仓库以浏览文件

source: No File Selected
ar: لم يتم تحديد ملف
de: Keine Datei ausgewählt
es: No se seleccionó ningún archivo
fr: Aucun fichier sélectionné
it: Nessun File Selezionato
ru: Файл не выбран
tr: Dosya Seçilmedi
zh: 未选择文件

# selectFileToViewHistoryOrPreview
source: Select a file from the tree to view its history or preview
ar: حدد ملفًا لعرض السجل أو المعاينة
de: Wählen Sie eine Datei aus dem Baum, um deren Verlauf anzuzeigen oder eine Vorschau zu sehen
es: Seleccione un archivo para ver historial o vista previa
fr: Sélectionnez un fichier pour voir l'historique ou l'aperçu
it: Seleziona un file dall'albero per visualizzare la cronologia o l'anteprima
ru: Выберите файл из дерева для просмотра его истории или предпросмотра
tr: Geçmişini görüntülemek veya önizlemek için ağaçtan bir dosya seçin
zh: 从树中选择文件以查看其历史或预览

source: No local branches
ar: لا توجد فروع محلية
de: Keine lokalen Branches
es: Sin ramas locales
fr: Aucune branche locale
it: Nessun branch locale
ru: Нет локальных веток
tr: Yerel dal yok
zh: 无本地分支

source: No remote branches
ar: لا توجد فروع بعيدة
de: Keine Remote-Branches
es: Sin ramas remotas
fr: Aucune branche distante
it: Nessun branch remoto
ru: Нет удалённых веток
tr: Uzak dal yok
zh: 无远程分支

# errorLoadingBranches
source: Error loading branches: {error}
ar: خطأ في تحميل الفروع: {error}
de: Fehler beim Laden der Branches: {error}
es: Error al cargar ramas: {error}
fr: Erreur de chargement des branches: {error}
it: Errore nel caricamento dei rami: {error}
ru: Ошибка загрузки веток: {error}
tr: Dallar yüklenirken hata: {error}
zh: 加载分支时出错：{error}

source: No Remotes
ar: لا توجد مستودعات بعيدة
de: Keine Remotes
es: Sin remotos
fr: Aucun distant
it: Nessun Remoto
ru: Нет удалённых репозиториев
tr: Uzak Yok
zh: 无远程

# addRemoteToCollaborate
source: Add a remote repository to collaborate
ar: أضف مستودعًا بعيدًا للتعاون
de: Fügen Sie ein Remote-Repository hinzu, um zusammenzuarbeiten
es: Añada un remoto para colaborar con otros
fr: Ajouter un dépôt distant pour collaborer
it: Aggiungi un repository remoto per collaborare
ru: Добавьте удалённый репозиторий для совместной работы
tr: İşbirliği yapmak için uzak bir depo ekleyin
zh: 添加远程仓库以进行协作

source: Add Remote
ar: إضافة مستودع بعيد
de: Remote hinzufügen
es: Añadir remoto
fr: Ajouter un distant
it: Aggiungi Remoto
ru: Добавить удалённый репозиторий
tr: Uzak Ekle
zh: 添加远程

source: No Results
ar: لا توجد نتائج
de: Keine Ergebnisse
es: Sin resultados
fr: Aucun résultat
it: Nessun Risultato
ru: Нет результатов
tr: Sonuç Yok
zh: 无结果

source: No remotes match "{query}"
ar: لا توجد مستودعات بعيدة تطابق الاستعلام
de: Keine Remotes entsprechen "{query}"
es: No hay remotos que coincidan con "{query}"
fr: Aucun distant ne correspond à la requête
it: Nessun remoto corrisponde a "{query}"
ru: Нет удалённых репозиториев, соответствующих "{query}"
tr: "{query}" ile eşleşen uzak yok
zh: 没有远程匹配 "{query}"

source: Clear Search
ar: مسح البحث
de: Suche löschen
es: Limpiar búsqueda
fr: Effacer la recherche
it: Cancella Ricerca
ru: Очистить поиск
tr: Aramayı Temizle
zh: 清除搜索

source: Error loading remotes
ar: خطأ في تحميل المستودعات البعيدة
de: Fehler beim Laden der Remotes
es: Error al cargar remotos
fr: Erreur lors du chargement des distants
it: Errore nel caricamento dei remoti
ru: Ошибка загрузки удалённых репозиториев
tr: Uzaklar yüklenirken hata
zh: 加载远程时出错

source: No Workspaces Yet
ar: لا توجد مساحات عمل بعد
de: Noch keine Arbeitsbereiche
es: Aún no hay espacios de trabajo
fr: Aucun espace de travail pour le moment
it: Nessuna Area di Lavoro
ru: Рабочих областей пока нет
tr: Henüz Çalışma Alanı Yok
zh: 尚无工作区

# createWorkspaceToOrganize
source: Create a workspace to organize your repositories
ar: أنشئ مساحة عمل لتنظيم مستودعاتك
de: Einen Arbeitsbereich erstellen, um Ihre Repositories zu organisieren
es: Cree un espacio de trabajo para organizar repositorios
fr: Créez un espace de travail pour organiser vos dépôts
it: Crea un'area di lavoro per organizzare i tuoi repository
ru: Создайте рабочую область для организации ваших репозиториев
tr: Depolarınızı düzenlemek için bir çalışma alanı oluşturun
zh: 创建工作区以组织您的仓库

source: No Repositories Yet
ar: لا توجد مستودعات بعد
de: Noch keine Repositories
es: Aún no hay repositorios
fr: Aucun dépôt pour le moment
it: Nessun Repository
ru: Репозиториев пока нет
tr: Henüz Depo Yok
zh: 尚无仓库

# addRepositoryToGetStarted
source: Add a repository to get started
ar: أضف مستودعًا للبدء
de: Fügen Sie ein Repository hinzu, um zu beginnen
es: Añada un repositorio para comenzar
fr: Ajoutez un dépôt pour commencer
it: Aggiungi un repository per iniziare
ru: Добавьте репозиторий для начала работы
tr: Başlamak için bir depo ekleyin
zh: 添加仓库以开始

source: Open Repository
ar: فتح المستودع
de: Repository öffnen
es: Abrir repositorio
fr: Ouvrir le dépôt
it: Apri repository
ru: Открыть репозиторий
tr: Depo Aç
zh: 打开仓库

# browseExistingRepository
source: Browse an existing repository
ar: تصفح مستودع موجود
de: Existierendes Repository durchsuchen
es: Explorar repositorio existente
fr: Parcourir un dépôt existant
it: Sfoglia un repository esistente
ru: Обзор существующего репозитория
tr: Mevcut bir depoya göz atın
zh: 浏览现有仓库

# cloneFromRemoteUrl
source: Clone from a remote URL
ar: استنساخ من عنوان URL بعيد
de: Von einer Remote-URL klonen
es: Clonar desde URL remota
fr: Cloner depuis une URL distante
it: Clona da un URL remoto
ru: Клонировать из удалённого URL
tr: Uzak bir URL'den klonlayın
zh: 从远程 URL 克隆

# initializeRepository
source: Create Git Repository
ar: تهيئة المستودع
de: Repository initialisieren
es: Inicializar repositorio
fr: Initialiser le dépôt
it: Inizializza repository
ru: Инициализировать репозиторий
tr: Depo başlat
zh: 初始化仓库

# createNewGitRepository
source: Create a new Git repository in a directory
ar: إنشاء مستودع Git جديد
de: Ein neues Git-Repository in einem Verzeichnis erstellen
es: Crear nuevo repositorio Git
fr: Créer un nouveau dépôt Git dans un répertoire
it: Crea un nuovo repository Git in una directory
ru: Создать новый Git-репозиторий в каталоге
tr: Bir dizinde yeni Git deposu oluşturun
zh: 创建新的 Git 仓库

# addedRemoteSuccess
source: Added remote "{remoteName}"
ar: تمت إضافة المستودع البعيد بنجاح
de: Remote "{remoteName}" hinzugefügt
es: Remoto "{name}" añadido correctamente
fr: Distant "{remoteName}" ajouté
it: Remoto "{remoteName}" aggiunto
ru: Удалённый репозиторий "{remoteName}" добавлен
tr: "{remoteName}" uzağı eklendi
zh: 已添加远程 "{remoteName}"

# addRemoteError
source: Failed to add remote: {error}
ar: فشل إضافة المستودع البعيد
de: Fehler beim Hinzufügen des Remotes: {error}
es: Error al añadir remoto: {error}
fr: Échec de l'ajout du distant: {error}
it: Impossibile aggiungere il remoto: {error}
ru: Не удалось добавить удалённый репозиторий: {error}
tr: Uzak ekleme hatası: {error}
zh: 添加远程失败: {error}

# fetchedAllRemotesSuccess
source: Fetched from all remotes
ar: تم جلب جميع المستودعات البعيدة بنجاح
de: Von allen Remotes abgerufen
es: Todos los remotos obtenidos correctamente
fr: Tous les distants récupérés avec succès
it: Recuperati dati da tutti i remoti
ru: Загружено из всех удалённых репозиториев
tr: Tüm uzaklardan getirme yapıldı
zh: 已成功从所有远程获取

# fetchRemotesError
source: Failed to fetch: {error}
ar: فشل جلب المستودعات البعيدة
de: Fehler beim Abrufen: {error}
es: Error al obtener remotos: {error}
fr: Échec de la récupération des distants: {error}
it: Impossibile recuperare: {error}
ru: Не удалось загрузить: {error}
tr: Getirme hatası: {error}
zh: 从远程获取时出错: {error}

source: Blame
ar: إلقاء اللوم
es: Culpar
fr: Blâme
zh: 追溯

source: Preview
ar: معاينة
de: Vorschau
es: Vista previa
fr: Aperçu
it: Anteprima
ru: Предпросмотр
tr: Önizleme
zh: 预览

source: View Options
ar: خيارات العرض
de: Anzeigeoptionen
es: Opciones de visualización
fr: Options d'affichage
it: Opzioni Visualizzazione
ru: Параметры просмотра
tr: Görünüm Seçenekleri
zh: 查看选项

source: Show Hidden Files
ar: إظهار الملفات المخفية
de: Versteckte Dateien anzeigen
es: Mostrar archivos ocultos
fr: Afficher les fichiers cachés
it: Mostra File Nascosti
ru: Показывать скрытые файлы
tr: Gizli Dosyaları Göster
zh: 显示隐藏文件

source: Show Ignored Files
ar: إظهار الملفات المتجاهلة
de: Ignorierte Dateien anzeigen
es: Mostrar archivos ignorados
fr: Afficher les fichiers ignorés
it: Mostra File Ignorati
ru: Показывать игнорируемые файлы
tr: Yok Sayılan Dosyaları Göster
zh: 显示被忽略的文件

source: Expand All
ar: توسيع الكل
de: Alle erweitern
es: Expandir todo
fr: Tout développer
it: Espandi Tutto
ru: Развернуть всё
tr: Tümünü Genişlet
zh: 全部展开

source: Collapse All
ar: طي الكل
de: Alle einklappen
es: Contraer todo
fr: Tout réduire
it: Comprimi Tutto
ru: Свернуть всё
tr: Tümünü Daralt
zh: 全部折叠

source: Advanced Search
ar: بحث متقدم
de: Erweiterte Suche
es: Búsqueda avanzada
fr: Recherche avancée
it: Ricerca Avanzata
ru: Расширенный поиск
tr: Gelişmiş Arama
zh: 高级搜索

# clearFilters
source: Clear filters ({count})
ar: مسح المرشحات ({count})
de: Filter löschen ({count})
es: Limpiar filtros ({count})
fr: Effacer les filtres ({count})
it: Cancella filtri ({count})
ru: Очистить фильтры ({count})
tr: Filtreleri temizle ({count})
zh: 清除筛选 ({count})

# commitsSquashedSuccess
source: Commits squashed successfully
ar: تم دمج التثبيتات بنجاح
de: Commits erfolgreich gesquasht
es: {count} commits comprimidos correctamente
fr: Commits fusionnés avec succès
it: Commit compressi con successo
ru: Коммиты успешно объединены
tr: Commit'ler başarıyla squash edildi
zh: {count, plural, =1{{count} 个提交已压缩} other{{count} 个提交已压缩}}

# cherryPickingCommits
source: Cherry-picking {count, plural, =1{{count} commit} other{{count} commits}}...
ar: جارٍ انتقاء التثبيتات...
de: {count, plural, =1{{count} Commit} other{{count} Commits}} wird cherry-gepickt
es: Haciendo cherry-pick de {count, plural, =1{{count} commit} other{{count} commits}}...
fr: Cherry-pick de {count, plural, =1{{count} commit} other{{count} commits}}...
it: Cherry-pick di {count, plural, =1{{count} commit} other{{count} commit}} in corso...
ru: Выполняется cherry-pick {count, plural, =1{{count} коммита} other{{count} коммитов}}...
tr: {count, plural, =1{{count} commit} other{{count} commit}} cherry-pick ediliyor...
zh: 正在拣选 {count, plural, =1{{count} 个提交} other{{count} 个提交}}...

# cherryPickedSuccess
source: Cherry-picked {count, plural, =1{{count} commit} other{{count} commits}} successfully
ar: تم الانتقاء بنجاح
de: {count, plural, =1{{count} Commit} other{{count} Commits}} erfolgreich cherry-gepickt
es: Cherry-pick de {count, plural, =1{{count} commit} other{{count} commits}} realizado correctamente
fr: Cherry-pick de {count, plural, =1{{count} commit} other{{count} commits}} réussi
it: Cherry-pick di {count, plural, =1{{count} commit} other{{count} commit}} completato con successo
ru: Cherry-pick выполнен для {count, plural, =1{{count} коммита} other{{count} коммитов}} успешно
tr: {count, plural, =1{{count} commit} other{{count} commit}} başarıyla cherry-pick edildi
zh: 已成功拣选 {count, plural, =1{{count} 个提交} other{{count} 个提交}}

# cherryPickFailed
source: Cherry-pick failed: {error}
ar: فشل الانتقاء
de: Cherry-Pick fehlgeschlagen: {error}
es: Error al hacer cherry-pick: {error}
fr: Échec du cherry-pick: {error}
it: Cherry-pick fallito: {error}
ru: Cherry-pick не удался: {error}
tr: Cherry-pick hatası: {error}
zh: 拣选失败: {error}

# revertingCommit
source: Reverting commit {hash}...
ar: جارٍ التراجع عن التثبيت...
de: Commit {hash} wird zurückgesetzt...
es: Revirtiendo commit {hash}...
fr: Annulation du commit...
it: Ripristino del commit {hash} in corso...
ru: Отмена коммита {hash}...
tr: Commit {hash} geri alınıyor...
zh: 正在还原提交

# revertedSuccess
source: Reverted commit {hash} successfully
ar: تم التراجع بنجاح
de: Commit {hash} erfolgreich zurückgesetzt
es: Commit revertido correctamente
fr: Commit {hash} annulé avec succès
it: Commit {hash} ripristinato con successo
ru: Коммит {hash} успешно отменён
tr: Commit {hash} başarıyla geri alındı
zh: 已成功还原提交 {hash}

# revertFailed
source: Revert failed: {error}
ar: فشل التراجع
de: Zurücksetzen fehlgeschlagen: {error}
es: Reversión fallida: {error}
fr: Échec de l'annulation: {error}
it: Ripristino fallito: {error}
ru: Отмена не удалась: {error}
tr: Geri alma başarısız: {error}
zh: 还原失败: {error}

# resettingToCommit
source: Resetting to {hash}...
ar: جارٍ إعادة التعيين إلى التثبيت...
de: Wird auf {hash} zurückgesetzt...
es: Restableciendo a {hash}...
fr: Réinitialisation au commit...
it: Reset a {hash} in corso...
ru: Сброс до {hash}...
tr: {hash} konumuna sıfırlanıyor...
zh: 正在重置到提交
