Repository: kartalbas/flutter-gitui
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

source: Workspaces
ar: مساحات العمل
de: Arbeitsbereiche
es: Espacios de trabajo
fr: Espaces de travail
it: Aree di lavoro
ru: Рабочие области
tr: Çalışma Alanları
zh: 工作区

source: Repositories:
ar: المستودعات:
es: Repositorios
fr: Dépôts
it: Repository
ru: Репозитории
tr: Depolar
zh: 仓库

source: Changes
ar: التغييرات
de: Änderungen
es: Cambios
fr: Changements
it: Modifiche
ru: Изменения
tr: Değişiklikler
zh: 变更

source: History
ar: السجل
de: Verlauf
es: Historial
fr: Historique
it: Cronologia
ru: История
tr: Geçmiş
zh: 历史

source: Browse
ar: استعراض
de: Durchsuchen
es: Explorar
fr: Parcourir
it: Sfoglia
ru: Обзор
tr: Gözat
zh: 浏览

source: Branches
ar: الفروع
es: Ramas
it: Branch
ru: Ветки
tr: Dallar
zh: 分支

source: Remotes
ar: البعيدة
es: Remotos
fr: Distants
it: Remoti
ru: Удалённые
tr: Uzaklar
zh: 远程

source: Stashes
ar: المخزون
it: Stash
ru: Stash
tr: Stash'ler
zh: 储藏

source: Tags
ar: الوسوم
es: Etiquetas
it: Tag
ru: Теги
tr: Etiketler
zh: 标签

source: Settings
ar: الإعدادات
de: Einstellungen
es: Configuración
fr: Paramètres
it: Impostazioni
ru: Настройки
tr: Ayarlar
zh: 设置

source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ru: Отмена
tr: İptal
zh: 取消

source: OK
ar: موافق
ru: ОК
tr: Tamam
zh: 确定

source: Save
ar: حفظ
de: Speichern
es: Guardar
fr: Enregistrer
it: Salva
ru: Сохранить
tr: Kaydet
zh: 保存

source: Delete
ar: حذف
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
ru: Удалить
tr: Sil
zh: 删除

source: Create
ar: إنشاء
de: Erstellen
es: Crear
fr: Créer
it: Crea
ru: Создать
tr: Oluştur
zh: 创建

source: Close
ar: إغلاق
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ru: Закрыть
tr: Kapat
zh: 关闭

source: Done
ar: تم
de: Fertig
es: Hecho
fr: Terminé
it: Fatto
ru: Готово
tr: Tamam
zh: 完成

source: Refresh
ar: تحديث
de: Aktualisieren
es: Actualizar
fr: Actualiser
it: Aggiorna
ru: Обновить
tr: Yenile
zh: 刷新

source: Search
ar: بحث
de: Suchen
es: Buscar
fr: Rechercher
it: Cerca
ru: Поиск
tr: Ara
zh: 搜索

source: Browse
ar: استعراض
de: Durchsuchen
es: Explorar
fr: Parcourir
it: Sfoglia
ru: Обзор
tr: Gözat
zh: 浏览

source: Apply
ar: تطبيق
de: Anwenden
es: Aplicar
fr: Appliquer
it: Applica
ru: Применить
tr: Uygula
zh: 应用

source: Checkout
ar: سحب
de: Auschecken
ru: Переключить
zh: 检出

source: Push
ar: دفع
ru: Отправить
zh: 推送

source: Pull
ar: سحب
ru: Получить
zh: 拉取

# repositoriesSelected
source: {count} selected
ar: {count} محدد
de: {count} ausgewählt
es: {count} seleccionados
fr: {count} sélectionnés
it: {count} selezionati
ru: Выбрано: {count}
tr: {count} seçili
zh: 已选择 {count} 个

source: Checkout to Main
ar: السحب إلى الرئيسي
de: Zu Main wechseln
es: Cambiar a Main
fr: Basculer vers Main
it: Passa a Main
ru: Переключить на Main
tr: Main'e Geç
zh: 切换到主分支

# checkoutAllReposTooltip
source: Checkout all selected repos to their main branch
ar: سحب جميع المستودعات المحددة إلى فرعها الرئيسي
de: Alle ausgewählten Repos auf ihren Hauptbranch wechseln
es: Cambiar todos los repositorios seleccionados a su rama principal
fr: Basculer tous les dépôts sélectionnés vers leur branche principale
it: Passa tutti i repository selezionati al loro branch principale
ru: Переключить все выбранные репозитории на их главную ветку
tr: Tüm seçili depoları ana dallarına geçir
zh: 将所有选定的仓库切换到它们的主分支

# allReposMustHaveCleanStatus
source: All selected repos must have clean status
ar: يجب أن تكون جميع المستودعات المحددة بحالة نظيفة
de: Alle ausgewählten Repos müssen einen sauberen Status haben
es: Todos los repositorios seleccionados deben tener un estado limpio
fr: Tous les dépôts sélectionnés doivent avoir un statut propre
it: Tutti i repository selezionati devono avere uno stato pulito
ru: Все выбранные репозитории должны иметь чистый статус
tr: Tüm seçili depoların temiz durumu olmalı
zh: 所有选定的仓库必须具有干净状态

# pullAllReposTooltip
source: Pull changes for all selected repos
ar: سحب التغييرات لجميع المستودعات المحددة
de: Änderungen für alle ausgewählten Repos pullen
es: Obtener cambios para todos los repositorios seleccionados
fr: Tirer les modifications pour tous les dépôts sélectionnés
it: Tira le modifiche per tutti i repository selezionati
ru: Получить изменения для всех выбранных репозиториев
tr: Tüm seçili depolar için değişiklikleri çek
zh: 为所有选定的仓库拉取更改

# createBranchTooltip
source: Create a new branch in the selected repo
ar: إنشاء فرع جديد في المستودع المحدد
de: Neuen Branch im ausgewählten Repo erstellen
es: Crear una nueva rama en el repositorio seleccionado
fr: Créer une nouvelle branche dans le dépôt sélectionné
it: Crea un nuovo branch nel repository selezionato
ru: Создать новую ветку в выбранном репозитории
tr: Seçili depoda yeni bir dal oluştur
zh: 在选定的仓库中创建新分支

# selectOnlyOneRepoForBranch
source: Select only one repository to create a branch
ar: حدد مستودعاً واحداً فقط لإنشاء فرع
de: Wählen Sie nur ein Repository aus, um einen Branch zu erstellen
es: Seleccione solo un repositorio para crear una rama
fr: Sélectionnez un seul dépôt pour créer une branche
it: Seleziona solo un repository per creare un branch
ru: Выберите только один репозиторий для создания ветки
tr: Dal oluşturmak için yalnızca bir depo seçin
zh: 只选择一个仓库来创建分支

source: Create PR
ar: إنشاء طلب سحب
de: PR erstellen
es: Crear PR
fr: Créer PR
it: Crea PR
ru: Создать PR
tr: PR Oluştur
zh: 创建 PR

# createPrTooltip
source: Create a pull request for the selected repo
ar: إنشاء طلب سحب للمستودع المحدد
de: Pull Request für das ausgewählte Repo erstellen
es: Crear una solicitud de extracción para el repositorio seleccionado
fr: Créer une pull request pour le dépôt sélectionné
it: Crea una pull request per il repository selezionato
ru: Создать pull request для выбранного репозитория
tr: Seçili depo için bir pull request oluştur
zh: 为选定的仓库创建拉取请求

# selectOnlyOneRepoForPr
source: Select only one repository to create a PR
ar: حدد مستودعاً واحداً فقط لإنشاء طلب سحب
de: Wählen Sie nur ein Repository aus, um einen PR zu erstellen
es: Seleccione solo un repositorio para crear un PR
fr: Sélectionnez un seul dépôt pour créer un PR
it: Seleziona solo un repository per creare un PR
ru: Выберите только один репозиторий для создания PR
tr: PR oluşturmak için yalnızca bir depo seçin
zh: 只选择一个仓库来创建 PR

source: Fetch
ar: جلب
ru: Загрузить
zh: 获取

source: Merge
ar: دمج
ru: Объединить
zh: 合并

source: Commit
ar: إيداع
ru: Зафиксировать
zh: 提交

source: Stash
ar: تخزين
ru: Отложить
zh: 储藏

source: Diff
ar: المقارنة
ru: Различия
zh: 差异

source: Pop
ar: استخراج
ru: Извлечь
zh: 弹出

source: Drop
ar: إسقاط
de: Verwerfen
es: Descartar
fr: Abandonner
it: Elimina
ru: Удалить
tr: Bırak
zh: 丢弃

source: Branch
ar: فرع
es: Rama
fr: Branche
ru: Ветка
tr: Dal
zh: 分支

source: No Repository Open
ar: لا يوجد مستودع مفتوح
de: Kein Repository geöffnet
es: Ningún repositorio abierto
fr: Aucun dépôt ouvert
it: Nessun repository aperto
ru: Репозиторий не открыт
tr: Açık Depo Yok
zh: 未打开仓库

# openRepositoryToContinue
source: Open a repository to continue
ar: افتح مستودعاً للمتابعة
de: Öffnen Sie ein Repository, um fortzufahren
es: Abra un repositorio para continuar
fr: Ouvrez un dépôt pour continuer
it: Apri un repository per continuare
ru: Откройте репозиторий для продолжения
tr: Devam etmek için bir depo açın
zh: 打开仓库以继续

# errorLoadingData
source: Error Loading {dataType}
ar: خطأ في تحميل {dataType}
de: Fehler beim Laden von {dataType}
es: Error al cargar {dataType}
fr: Erreur de chargement de {dataType}
it: Errore nel caricamento di {dataType}
ru: Ошибка загрузки {dataType}
tr: {dataType} yüklenirken hata
zh: 加载 {dataType} 时出错

# error
source: Error: {error}
ar: خطأ: {error}
de: Fehler: {error}
fr: Erreur: {error}
it: Errore: {error}
ru: Ошибка: {error}
tr: Hata: {error}
zh: 错误：{error}

source: Retry
ar: إعادة المحاولة
de: Wiederholen
es: Reintentar
fr: Réessayer
it: Riprova
ru: Повторить
tr: Yeniden Dene
zh: 重试

# selectedCount
source: {count} selected
ar: {count} محدد
de: {count} ausgewählt
es: {count} seleccionado
fr: {count} sélectionné
it: {count} selezionato
ru: {count} выбрано
tr: {count} seçili
zh: {count} 已选择

source: Exit Selection
ar: الخروج من التحديد
de: Auswahl beenden
es: Salir de selección
fr: Quitter la sélection
it: Esci dalla selezione
ru: Выйти из режима выбора
tr: Seçimden Çık
zh: 退出选择

source: Select All
ar: تحديد الكل
de: Alle auswählen
es: Seleccionar todo
fr: Tout sélectionner
it: Seleziona tutto
ru: Выбрать всё
tr: Tümünü Seç
zh: 全选

source: Clear Selection
ar: مسح التحديد
de: Auswahl löschen
es: Limpiar selección
fr: Effacer la sélection
it: Cancella selezione
ru: Очистить выбор
tr: Seçimi Temizle
zh: 清除选择

source: Clear All
ar: مسح الكل
de: Alle löschen
es: Limpiar todo
fr: Tout effacer
it: Cancella tutto
ru: Очистить все
tr: Tümünü temizle
zh: 清除全部

source: Reset All
ar: إعادة تعيين الكل
de: Alle zurücksetzen
es: Restablecer todo
fr: Tout réinitialiser
it: Reimposta tutto
ru: Сбросить всё
tr: Tümünü Sıfırla
zh: 全部重置

source: Deselect All
ar: إلغاء تحديد الكل
de: Alle abwählen
es: Deseleccionar todo
fr: Tout désélectionner
it: Deseleziona tutto
ru: Снять выбор со всего
tr: Tümünün Seçimini Kaldır
zh: 全部取消选择

# searchPlaceholder
source: Search {itemType}...
ar: بحث {itemType}...
de: {itemType} suchen...
es: Buscar {itemType}...
fr: Rechercher {itemType}...
it: Cerca {itemType}...
ru: Поиск {itemType}...
tr: {itemType} ara...
zh: 搜索 {itemType}...

# regexSearchPlaceholder
source: Regex search...
ar: بحث نمطي...
de: Regex-Suche...
es: Búsqueda regex...
fr: Recherche regex...
it: Ricerca regex...
ru: Поиск по регулярному выражению...
tr: Regex araması...
zh: 正则表达式搜索...

# itemCount
source: {count, plural, =1{{count} {itemType}} other{{count} {itemTypePlural}}}
ar: {count, plural, =0{لا توجد عناصر} =1{عنصر واحد} two{عنصران} few{{count} عناصر} many{{count} عنصرًا} other{{count} عنصر}}
zh: {count, plural, =1{{count} 个 {itemType}} other{{count} 个 {itemTypePlural}}}

source: of {total}
ar: من {total}
de: von {total}
es: de {total}
fr: sur {total}
it: di {total}
ru: из {total}
tr: {total} üzerinden
zh: 共 {total} 个

# noMatchesFound
source: No {itemType} match "{query}"
ar: لا توجد {itemType} مطابقة لـ "{query}"
de: Keine {itemType} entsprechen "{query}"
es: No hay {itemType} que coincidan con "{query}"
fr: Aucun {itemType} ne correspond à "{query}"
it: Nessun {itemType} corrisponde a "{query}"
ru: Нет {itemType}, соответствующих "{query}"
tr: "{query}" ile eşleşen {itemType} yok
zh: 没有匹配 "{query}" 的 {itemType}

source: Create Tag
ar: إنشاء وسم
de: Tag erstellen
es: Crear etiqueta
fr: Créer un tag
it: Crea tag
ru: Создать тег
tr: Etiket Oluştur
zh: 创建标签

source: Select Tags
ar: تحديد الوسوم
de: Tags auswählen
es: Seleccionar etiquetas
fr: Sélectionner des tags
it: Seleziona tag
ru: Выбрать теги
tr: Etiket Seç
zh: 选择标签

source: Fetch Tags
ar: جلب الوسوم
de: Tags abrufen
es: Obtener etiquetas
fr: Récupérer les tags
it: Recupera tag
ru: Загрузить теги
tr: Etiketleri Getir
zh: 获取标签

source: Advanced Filters
ar: مرشحات متقدمة
de: Erweiterte Filter
es: Filtros avanzados
fr: Filtres avancés
it: Filtri avanzati
ru: Расширенные фильтры
tr: Gelişmiş Filtreler
zh: 高级筛选

source: Sort Tags
ar: ترتيب الوسوم
de: Tags sortieren
es: Ordenar etiquetas
fr: Trier les tags
it: Ordina tag
ru: Сортировать теги
tr: Etiketleri Sırala
zh: 标签排序

# sortNameAZ
source: Name (A-Z)
ar: الاسم (أ-ي)
es: Nombre (A-Z)
fr: Nom (A-Z)
it: Nome (A-Z)
ru: Имя (А-Я)
tr: İsim (A-Z)
zh: 名称 (A-Z)

# sortNameZA
source: Name (Z-A)
ar: الاسم (ي-أ)
es: Nombre (Z-A)
fr: Nom (Z-A)
it: Nome (Z-A)
ru: Имя (Я-А)
tr: İsim (Z-A)
zh: 名称 (Z-A)

# sortDateNewest
source: Date (Newest)
ar: التاريخ (الأحدث)
de: Datum (Neueste)
es: Fecha (Más reciente)
fr: Date (Plus récent)
it: Data (Più recente)
ru: Дата (Новые)
tr: Tarih (En Yeni)
zh: 日期 (最新)

# sortDateOldest
source: Date (Oldest)
ar: التاريخ (الأقدم)
de: Datum (Älteste)
es: Fecha (Más antigua)
fr: Date (Plus ancien)
it: Data (Più vecchio)
ru: Дата (Старые)
tr: Tarih (En Eski)
zh: 日期 (最旧)

# sortVersionLowHigh
source: Version (Low-High)
ar: الإصدار (من المنخفض للمرتفع)
de: Version (Niedrig-Hoch)
es: Versión (Baja-Alta)
fr: Version (Bas-Haut)
it: Versione (Bassa-Alta)
ru: Версия (По возрастанию)
tr: Sürüm (Düşük-Yüksek)
zh: 版本 (从低到高)

# sortVersionHighLow
source: Version (High-Low)
ar: الإصدار (من المرتفع للمنخفض)
de: Version (Hoch-Niedrig)
es: Versión (Alta-Baja)
fr: Version (Haut-Bas)
it: Versione (Alta-Bassa)
ru: Версия (По убыванию)
tr: Sürüm (Yüksek-Düşük)
zh: 版本 (从高到低)

source: Group Tags
ar: تجميع الوسوم
de: Tags gruppieren
es: Agrupar etiquetas
fr: Grouper les tags
it: Raggruppa tag
ru: Группировать теги
tr: Etiketleri Grupla
zh: 标签分组

source: No Grouping
ar: بدون تجميع
de: Keine Gruppierung
es: Sin agrupar
fr: Pas de groupement
it: Nessun raggruppamento
ru: Без группировки
tr: Gruplama Yok
zh: 不分组

source: By Prefix
ar: حسب البادئة
de: Nach Präfix
es: Por prefijo
fr: Par préfixe
it: Per prefisso
ru: По префиксу
tr: Ön Eke Göre
zh: 按前缀

source: By Version
ar: حسب الإصدار
de: Nach Version
es: Por versión
fr: Par version
it: Per versione
ru: По версии
tr: Sürüme Göre
zh: 按版本

source: By Author
ar: حسب المؤلف
de: Nach Autor
es: Por autor
fr: Par auteur
it: Per autore
ru: По автору
tr: Yazara Göre
zh: 按作者

source: By Date
ar: حسب التاريخ
de: Nach Datum
es: Por fecha
fr: Par date
it: Per data
ru: По дате
tr: Tarihe Göre
zh: 按日期

# allWithCount
source: All ({count})
ar: الكل ({count})
de: Alle ({count})
es: Todas ({count})
fr: Tous ({count})
it: Tutti ({count})
ru: Все ({count})
tr: Tümü ({count})
zh: 全部 ({count})

# annotatedWithCount
source: Annotated ({count})
ar: مشروحة ({count})
de: Annotiert ({count})
es: Anotadas ({count})
fr: Annotés ({count})
it: Annotati ({count})
ru: С аннотацией ({count})
tr: Açıklamalı ({count})
zh: 附注 ({count})

# lightweightWithCount
source: Lightweight ({count})
ar: خفيفة ({count})
de: Leichtgewichtig ({count})
es: Ligeras ({count})
fr: Légers ({count})
it: Leggeri ({count})
ru: Облегчённые ({count})
tr: Hafif ({count})
zh: 轻量 ({count})

source: Push {count}
ar: دفع {count}
de: {count} pushen
fr: Pousser {count}
ru: Отправить {count}
tr: {count} Push
zh: 推送 {count} 个

source: Sync Status
ar: حالة المزامنة
de: Synchronisierungsstatus
es: Estado de sincronización
fr: État de synchronisation
it: Stato di sincronizzazione
ru: Статус синхронизации
tr: Senkronizasyon Durumu
zh: 同步状态

# tagsNotPushed
source: {count, plural, =1{{count} tag not pushed to remote} other{{count} tags not pushed to remote}}
ar: {count, plural, =1{وسم واحد لم يُدفع إلى المستودع البعيد} other{{count} وسوم لم تُدفع إلى المستودع البعيد}}
de: {count, plural, =1{{count} Tag nicht gepusht} other{{count} Tags nicht gepusht}}
es: {count, plural, =1{{count} etiqueta no enviada} other{{count} etiquetas no enviadas}}
fr: {count, plural, =1{{count} tag non poussé} other{{count} tags non poussés}}
it: {count, plural, =1{{count} tag non pushato} other{{count} tag non pushati}}
ru: {count, plural, =1{{count} тег не отправлен} other{{count} тегов не отправлено}}
tr: {count, plural, =1{{count} etiket push edilmedi} other{{count} etiket push edilmedi}}
zh: {count, plural, =1{{count} 个标签未推送} other{{count} 个标签未推送}}

# tagsAvailableToFetch
source: {count, plural, =1{{count} tag available to fetch} other{{count} tags available to fetch}}
ar: {count, plural, =1{وسم واحد متاح للجلب} other{{count} وسوم متاحة للجلب}}
de: {count, plural, =1{{count} Tag verfügbar zum Abrufen} other{{count} Tags verfügbar zum Abrufen}}
es: {count, plural, =1{{count} etiqueta disponible} other{{count} etiquetas disponibles}}
fr: {count, plural, =1{{count} tag disponible} other{{count} tags disponibles}}
it: {count, plural, =1{{count} tag disponibile} other{{count} tag disponibili}}
ru: {count, plural, =1{{count} тег доступен} other{{count} тегов доступно}}
tr: {count, plural, =1{{count} etiket mevcut} other{{count} etiket mevcut}}
zh: {count, plural, =1{{count} 个标签可获取} other{{count} 个标签可获取}}

source: Push All
ar: دفع الكل
de: Alle pushen
es: Enviar todo
fr: Tout pousser
it: Carica tutto
ru: Отправить все
tr: Tümünü Gönder
zh: 全部推送

source: Fetch All
ar: جلب الكل
de: Alle abrufen
es: Obtener todo
fr: Tout récupérer
it: Scarica tutto
ru: Получить все
tr: Tümünü Getir
zh: 全部获取

source: No Tags
ar: لا توجد وسوم
de: Keine Tags
es: Sin etiquetas
fr: Aucun tag
it: Nessun tag
ru: Нет тегов
tr: Etiket Yok
zh: 无标签

# createTagToMarkHistory
source: Create a tag to mark important points in history
ar: أنشئ وسماً لتحديد نقاط مهمة في السجل
de: Erstellen Sie einen Tag, um wichtige Punkte im Verlauf zu markieren
es: Cree una etiqueta para marcar puntos importantes en el historial
fr: Créez un tag pour marquer les points importants de l'historique
it: Crea un tag per contrassegnare punti importanti nella cronologia
ru: Создайте тег для отметки важных точек в истории
tr: Geçmişteki önemli noktaları işaretlemek için bir etiket oluşturun
zh: 创建标签以标记历史中的重要节点

# authorFilter
source: Author: {author}
ar: المؤلف: {author}
de: Autor: {author}
es: Autor: {author}
fr: Auteur: {author}
it: Autore: {author}
ru: Автор: {author}
tr: Yazar: {author}
zh: 作者: {author}

source: Regex
ar: نمط
zh: 正则

# pushTagsCount
source: Push {count, plural, =1{{count} Tag} other{{count} Tags}}
ar: دفع {count, plural, =1{وسم واحد} other{{count} وسوم}}
de: {count, plural, =1{{count} Tag pushen} other{{count} Tags pushen}}
es: {count, plural, =1{Enviar {count} etiqueta} other{Enviar {count} etiquetas}}
fr: {count, plural, =1{Pousser {count} tag} other{Pousser {count} tags}}
it: {count, plural, =1{Push {count} tag} other{Push {count} tag}}
ru: {count, plural, =1{Отправить {count} тег} other{Отправить {count} тегов}}
tr: {count, plural, =1{{count} Etiket Push Et} other{{count} Etiket Push Et}}
zh: {count, plural, =1{推送 {count} 个标签} other{推送 {count} 个标签}}

# deleteTagsCount
source: Delete {count, plural, =1{{count} Tag} other{{count} Tags}}
ar: حذف {count, plural, =1{وسم واحد} other{{count} وسوم}}
de: {count, plural, =1{{count} Tag löschen} other{{count} Tags löschen}}
es: {count, plural, =1{Eliminar {count} etiqueta} other{Eliminar {count} etiquetas}}
fr: {count, plural, =1{Supprimer {count} tag} other{Supprimer {count} tags}}
it: {count, plural, =1{Elimina {count} tag} other{Elimina {count} tag}}
ru: {count, plural, =1{Удалить {count} тег} other{Удалить {count} тегов}}
tr: {count, plural, =1{{count} Etiket Sil} other{{count} Etiket Sil}}
zh: {count, plural, =1{删除 {count} 个标签} other{删除 {count} 个标签}}

source: Date Range
ar: نطاق التاريخ
de: Datumsbereich
es: Rango de fechas
fr: Plage de dates
it: Intervallo di date
ru: Диапазон дат
tr: Tarih Aralığı
zh: 日期范围

source: Author / Tagger
ar: المؤلف / الواسم
de: Autor / Tagger
es: Autor / Etiquetador
fr: Auteur / Tagger
it: Autore / Tagger
ru: Автор / Создатель тега
tr: Yazar / Etiketleyen
zh: 作者 / 标签者

source: All authors
ar: جميع المؤلفين
de: Alle Autoren
es: Todos los autores
fr: Tous les auteurs
it: Tutti gli autori
ru: Все авторы
tr: Tüm yazarlar
zh: 所有作者

# noAuthorsFound
source: No authors found in tags
ar: لم يتم العثور على مؤلفين في الوسوم
de: Keine Autoren in Tags gefunden
es: No se encontraron autores en las etiquetas
fr: Aucun auteur trouvé dans les tags
it: Nessun autore trovato nei tag
ru: Авторы в тегах не найдены
tr: Etiketlerde yazar bulunamadı
zh: 标签中未找到作者

source: Use Regular Expressions
ar: استخدام التعبيرات النمطية
de: Reguläre Ausdrücke verwenden
es: Usar expresiones regulares
fr: Utiliser les expressions régulières
it: Usa espressioni regolari
ru: Использовать регулярные выражения
tr: Düzenli İfadeler Kullan
zh: 使用正则表达式

# enableRegexMatching
source: Enable regex pattern matching in search
ar: تفعيل البحث بالتعبيرات النمطية
de: Regex-Musterabgleich in der Suche aktivieren
es: Habilitar coincidencia de patrones regex en la búsqueda
fr: Activer la correspondance de motif regex dans la recherche
it: Abilita la corrispondenza dei pattern regex nella ricerca
ru: Включить сопоставление с регулярными выражениями в поиске
tr: Aramada regex kalıp eşleştirmeyi etkinleştir
zh: 在搜索中启用正则表达式模式匹配

source: Today
ar: اليوم
de: Heute
es: Hoy
fr: Aujourd'hui
it: Oggi
ru: Сегодня
tr: Bugün
zh: 今天

source: Last Week
ar: الأسبوع الماضي
de: Letzte Woche
es: Última semana
fr: La semaine dernière
it: Ultima settimana
ru: На прошлой неделе
tr: Geçen Hafta
zh: 上周

source: Last Month
ar: الشهر الماضي
de: Letzter Monat
es: Último mes
fr: Le mois dernier
it: Ultimo mese
ru: В прошлом месяце
tr: Geçen Ay
zh: 上月

source: Last Year
ar: العام الماضي
de: Letztes Jahr
es: Último año
fr: L'année dernière
it: Ultimo anno
ru: В прошлом году
tr: Geçen Yıl
zh: 去年

source: Custom Range
ar: نطاق مخصص
de: Benutzerdefinierter Bereich
es: Rango personalizado
fr: Plage personnalisée
it: Intervallo personalizzato
ru: Пользовательский диапазон
tr: Özel Aralık
zh: 自定义范围

source: All Time
ar: كل الأوقات
de: Alle Zeiten
es: Todo el tiempo
fr: Tout le temps
it: Tutto il tempo
ru: За всё время
tr: Tüm Zamanlar
zh: 全部时间

# createTagDialogTitle
source: Create Tag
ar: إنشاء وسم
de: Tag erstellen
es: Crear etiqueta
fr: Créer un tag
it: Crea tag
ru: Создать тег
tr: Etiket Oluştur
zh: 创建标签

# createTagDescription
source: Create a new tag at the current HEAD
ar: إنشاء وسم جديد عند HEAD الحالي
de: Einen neuen Tag am aktuellen HEAD erstellen
es: Crear una nueva etiqueta en el HEAD actual
fr: Créer un nouveau tag au HEAD actuel
it: Crea un nuovo tag all'HEAD corrente
ru: Создать новый тег на текущем HEAD
tr: Mevcut HEAD'de yeni bir etiket oluştur
zh: 在当前 HEAD 创建新标签

source: Tag Name
ar: اسم الوسم
es: Nombre de etiqueta
fr: Nom du tag
it: Nome del tag
ru: Имя тега
tr: Etiket Adı
zh: 标签名称

source: Annotated Tag
ar: وسم مشروح
de: Annotierter Tag
es: Etiqueta anotada
fr: Tag annoté
it: Tag annotato
ru: Тег с аннотацией
tr: Açıklamalı Etiket
zh: 附注标签

# includeMessageWithTag
source: Include a message with the tag
ar: تضمين رسالة مع الوسم
de: Eine Nachricht mit dem Tag einschließen
es: Incluir un mensaje con la etiqueta
fr: Inclure un message avec le tag
it: Includi un messaggio con il tag
ru: Включить сообщение с тегом
tr: Etiketle birlikte bir mesaj ekle
zh: 在标签中包含消息

source: Message
ar: الرسالة
de: Nachricht
es: Mensaje
it: Messaggio
ru: Сообщение
tr: Mesaj
zh: 消息

# releaseNotesPlaceholder
source: Release notes or description...
ar: ملاحظات الإصدار أو الوصف...
de: Release-Notizen oder Beschreibung...
es: Notas de versión o descripción...
fr: Notes de version ou description...
it: Note di rilascio o descrizione...
ru: Заметки о выпуске или описание...
tr: Sürüm notları veya açıklama...
zh: 发布说明或描述...

# tagCreatedSuccess
source: Tag "{tagName}" created successfully
ar: تم إنشاء الوسم "{tagName}" بنجاح
de: Tag "{tagName}" erfolgreich erstellt
es: Etiqueta "{tagName}" creada correctamente
fr: Tag "{tagName}" créé avec succès
it: Tag "{tagName}" creato con successo
ru: Тег "{tagName}" успешно создан
tr: "{tagName}" etiketi başarıyla oluşturuldu
zh: 标签 "{tagName}" 创建成功

# tagCreatedError
source: Failed to create tag: {error}
ar: فشل إنشاء الوسم: {error}
de: Fehler beim Erstellen des Tags: {error}
es: Error al crear la etiqueta: {error}
fr: Échec de la création du tag: {error}
it: Errore nella creazione del tag: {error}
ru: Ошибка создания тега: {error}
tr: Etiket oluşturma hatası: {error}
zh: 创建标签失败: {error}

# tagsFetchedSuccess
source: Tags fetched successfully
ar: تم جلب الوسوم بنجاح
de: Tags erfolgreich abgerufen
es: Etiquetas obtenidas correctamente
fr: Tags récupérés avec succès
it: Tag recuperati con successo
ru: Теги успешно загружены
tr: Etiketler başarıyla getirildi
zh: 标签获取成功

# tagsFetchedError
source: Failed to fetch tags: {error}
ar: فشل جلب الوسوم: {error}
de: Fehler beim Abrufen der Tags: {error}
es: Error al obtener etiquetas: {error}
fr: Échec de la récupération des tags: {error}
it: Errore nel recupero dei tag: {error}
ru: Ошибка загрузки тегов: {error}
tr: Etiket getirme hatası: {error}
zh: 获取标签失败: {error}
