Repository: kartalbas/flutter-gitui
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# cherryPickCommitInstructions
source: To cherry-pick a commit: 1. Navigate to the History tab 2. Right-click on the commit you want to cherry-pick 3. Select "Cherry-pick this commit" This will apply the changes from that commit to your current branch.
ar: سيطبق هذا التثبيت المحدد على الفرع الحالي
de: Um einen Commit zu cherry-picken: 1. Navigieren Sie zum Verlauf-Tab 2. Rechtsklick auf den Commit, den Sie cherry-picken möchten 3. Wählen Sie "Diesen Commit cherry-picken" Dies wendet die Änderungen dieses Commits auf Ihren aktuellen Branch an.
es: Seleccione un commit para aplicar sus cambios a la rama actual
fr: Pour faire un cherry-pick d'un commit: 1. Naviguez vers l'onglet Historique 2. Cliquez avec le bouton droit sur le commit que vous voulez cherry-pick 3. Sélectionnez "Cherry-pick ce commit" Cela appliquera les modifications de ce commit à votre branche actuelle.
it: To cherry-pick a commit:\n\n1. Navigate to the History tab\n2. Right-click on the commit you want to cherry-pick\n3. Select "Cherry-pick this commit"\n\nThis will apply the changes from that commit to your current branch.
ru: Чтобы выполнить cherry-pick коммита: 1. Перейдите на вкладку История 2. Щёлкните правой кнопкой мыши на коммите, который хотите применить 3. Выберите "Cherry-pick этот коммит" Это применит изменения из этого коммита к вашей текущей ветке.
tr: Bir commit'i cherry-pick etmek için: 1. Geçmiş sekmesine gidin 2. Cherry-pick etmek istediğiniz commit'e sağ tıklayın 3. "Bu commit'i cherry-pick et" seçeneğini seçin Bu, o commit'teki değişiklikleri mevcut dalınıza uygulayacaktır.
zh: 要拣选提交: 1. 导航到历史标签 2. 右键单击要拣选的提交 3. 选择 "拣选此提交" 这将把该提交的更改应用到当前分支。

# revertCommitDialog
source: Revert Commit
ar: التراجع عن تثبيت
de: Commit zurücksetzen
es: Revertir commit
fr: Annuler le commit
ru: Отменить коммит
tr: Commit'i Geri Al
zh: 还原提交

# revertCommitInstructions
source: To revert a commit: 1. Navigate to the History tab 2. Right-click on the commit you want to revert 3. Select "Revert this commit" This will create a new commit that undoes the changes from the selected commit.
ar: سينشئ هذا تثبيتًا جديدًا يتراجع عن التغييرات من التثبيت المحدد
de: Um einen Commit zurückzusetzen: 1. Navigieren Sie zum Verlauf-Tab 2. Rechtsklick auf den Commit 3. Wählen Sie "Diesen Commit zurücksetzen"
es: Crear un nuevo commit que deshace los cambios de un commit específico
fr: Pour annuler un commit: 1. Naviguez vers l'onglet Historique 2. Cliquez avec le bouton droit sur le commit que vous voulez annuler 3. Sélectionnez "Annuler ce commit" Cela créera un nouveau commit qui annule les modifications du commit sélectionné.
it: To revert a commit:\n\n1. Navigate to the History tab\n2. Right-click on the commit you want to revert\n3. Select "Revert this commit"\n\nThis will create a new commit that undoes the changes from the selected commit.
ru: Чтобы отменить коммит: 1. Перейдите на вкладку История 2. Щёлкните правой кнопкой мыши на коммите, который хотите отменить 3. Выберите "Отменить этот коммит" Это создаст новый коммит, который отменит изменения из выбранного коммита.
tr: Bu, commit değişikliklerini geri alan yeni bir commit oluşturacaktır
zh: 要还原提交: 1. 导航到历史标签 2. 右键单击要还原的提交 3. 选择 "还原此提交" 这将创建一个撤销更改的新提交。

# resetToCommitDialog
source: Reset to Commit
ar: إعادة التعيين إلى تثبيت
de: Auf Commit zurücksetzen
es: Reset a commit
fr: Réinitialiser à un commit
ru: Сбросить до коммита
tr: Commit'e Sıfırla
zh: 重置到提交

# resetToCommitInstructions
source: To reset your branch to a specific commit: 1. Navigate to the History tab 2. Right-click on the commit you want to reset to 3. Select "Reset current branch to here" 4. Choose reset mode (soft/mixed/hard) Warning: Hard reset will discard all changes!
ar: سيعيد هذا تعيين الفرع الحالي إلى التثبيت المحدد
de: Um Ihren Branch auf einen bestimmten Commit zurückzusetzen: 1. Navigieren Sie zum Verlauf-Tab 2. Rechtsklick auf den Commit 3. Wählen Sie "Auf diesen Commit zurücksetzen"
es: Seleccione un commit para restablecer la rama actual
fr: Pour réinitialiser à un commit: 1. Naviguez vers l'onglet Historique 2. Cliquez avec le bouton droit sur le commit vers lequel réinitialiser 3. Sélectionnez "Réinitialiser à ce commit" 4. Choisissez le mode de réinitialisation (soft, mixed ou hard)
it: To reset your branch to a specific commit:\n\n1. Navigate to the History tab\n2. Right-click on the commit you want to reset to\n3. Select "Reset current branch to here"\n4. Choose reset mode (soft/mixed/hard)\n\nWarning: Hard reset will discard all changes!
ru: Чтобы сбросить вашу ветку до определённого коммита: 1. Перейдите на вкладку История 2. Щёлкните правой кнопкой мыши на коммите, до которого хотите сбросить 3. Выберите "Сбросить текущую ветку сюда" 4. Выберите режим сброса (soft/mixed/hard) Внимание: Жёсткий сброс отменит все изменения!
tr: Bu, dal işaretçisini bu commit'e taşıyacaktır
zh: 要重置到提交: 1. 导航到历史标签 2. 右键单击要重置到的提交 3. 选择 "重置分支到此处" 警告: 这将丢弃所有后续提交。

# cleanWorkingDirectoryDialog
source: Clean Working Directory
ar: تنظيف دليل العمل
de: Arbeitsverzeichnis bereinigen
es: ¿Limpiar directorio de trabajo?
fr: Nettoyer le répertoire de travail
ru: Очистить рабочий каталог
tr: Çalışma Dizinini Temizle
zh: 清理工作目录

# cleanWorkingDirectoryConfirm
source: This will permanently remove all untracked files and directories from your working directory. Warning: This operation cannot be undone! Do you want to continue?
ar: هل تريد إزالة جميع الملفات غير المتتبعة؟
de: Dies entfernt dauerhaft alle unverfolgten Dateien und Verzeichnisse. Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Limpiar directorio de trabajo? Esto eliminará todos los archivos sin seguimiento. Esta acción no se puede deshacer.
fr: Cela supprimera définitivement tous les fichiers et répertoires non suivis de votre répertoire de travail. Attention: Cette opération ne peut pas être annulée! Voulez-vous continuer?
it: This will permanently remove all untracked files and directories from your working directory.\n\nWarning: This operation cannot be undone!\n\nDo you want to continue?
ru: Это безвозвратно удалит все неотслеживаемые файлы и каталоги из вашего рабочего каталога. Внимание: Эту операцию нельзя отменить! Вы хотите продолжить?
tr: Bu, çalışma dizininizdeki tüm izlenmeyen dosya ve dizinleri kalıcı olarak kaldıracaktır. Uyarı: Bu işlem geri alınamaz! Devam etmek istiyor musunuz?
zh: 这将永久删除工作目录中的所有未跟踪文件和目录。 警告: 此操作无法撤销! 是否继续?

# workingDirectoryCleanedSuccess
source: Working directory cleaned successfully
ar: تم تنظيف دليل العمل بنجاح
de: Arbeitsverzeichnis erfolgreich bereinigt
es: Directorio de trabajo limpiado correctamente
fr: Répertoire de travail nettoyé avec succès
ru: Рабочий каталог успешно очищен
tr: Çalışma dizini temizlendi
zh: 工作目录已成功清理

# failedToCleanWorkingDirectory
source: Failed to clean working directory: {error}
ar: فشل تنظيف دليل العمل
de: Fehler beim Bereinigen des Arbeitsverzeichnisses: {error}
es: Error al limpiar directorio de trabajo: {error}
fr: Échec du nettoyage du répertoire de travail: {error}
ru: Не удалось очистить рабочий каталог: {error}
tr: Çalışma dizini temizleme başarısız: {error}
zh: 清理工作目录失败: {error}

source: Navigated to Tags screen - delete your tag there
ar: تم الانتقال إلى شاشة الوسوم. احذف الوسم من هناك
de: Zum Tags-Bildschirm navigiert - löschen Sie Ihren Tag dort
es: Navegado a la pantalla de etiquetas. Elimine su etiqueta allí.
fr: Navigation vers l'écran Tags - Supprimez vos tags là-bas
ru: Выполнен переход на экран Теги - удалите ваш тег там
tr: Etiketler ekranına gidildi - etiketinizi orada silin
zh: 已导航到标签屏幕 - 在那里删除您的标签

source: Navigated to Tags screen - push your tags there
ar: تم الانتقال إلى شاشة الوسوم. ادفع الوسوم من هناك
de: Zum Tags-Bildschirm navigiert - pushen Sie Ihre Tags dort
es: Navegado a la pantalla de etiquetas. Envíe sus etiquetas allí.
fr: Navigation vers l'écran Tags - Poussez vos tags là-bas
ru: Выполнен переход на экран Теги - отправьте ваши теги там
tr: Etiketler ekranına gidildi - etiketlerinizi orada push edin
zh: 已导航到标签屏幕 - 在那里推送您的标签

source: Collapse
ar: طي
de: Einklappen
es: Contraer
fr: Réduire
ru: Свернуть
tr: Daralt
zh: 折叠

source: Expand
ar: توسيع
de: Erweitern
es: Expandir
fr: Développer
ru: Развернуть
tr: Genişlet
zh: 展开

# commandPaletteTooltip
source: Command Palette (Ctrl+K)
ar: لوحة الأوامر
de: Befehlspalette (Strg+K)
es: Paleta de comandos
fr: Palette de commandes (Ctrl+K)
ru: Палитра команд (Ctrl+K)
tr: Komut Paleti (Ctrl+K)
zh: 命令面板 (Ctrl+Shift+P)

# toggleCommandLogTooltip
source: Toggle Command Log (Ctrl+L)
ar: تبديل سجل الأوامر
de: Befehlsprotokoll umschalten (Strg+L)
es: Alternar registro de comandos
fr: Basculer le journal des commandes
ru: Переключить журнал команд (Ctrl+L)
tr: Komut Günlüğünü Değiştir
zh: 切换命令日志

source: Go to Settings
ar: الانتقال إلى الإعدادات
de: Zu Einstellungen gehen
es: Ir a configuración
fr: Aller aux paramètres
ru: Перейти к настройкам
tr: Ayarlara Git
zh: 转到设置

source: Reset to Defaults
ar: إعادة التعيين إلى الافتراضي
de: Auf Standardwerte zurücksetzen
es: Restablecer a predeterminados
fr: Réinitialiser aux valeurs par défaut
ru: Сбросить к значениям по умолчанию
tr: Varsayılanlara Sıfırla
zh: 重置为默认值

source: Select Git Executable
ar: اختر ملف Git التنفيذي
de: Git-Executable auswählen
es: Seleccionar ejecutable de Git
fr: Sélectionner l'exécutable Git
ru: Выберите исполняемый файл Git
tr: Git Çalıştırılabilir Seç
zh: 选择 Git 可执行文件

# gitVersionDetected
source: Git {version} detected successfully
ar: تم اكتشاف إصدار Git: {version}
de: Git {version} erfolgreich erkannt
es: Versión de Git detectada: {version}
fr: Version Git détectée: {version}
ru: Git {version} успешно обнаружен
tr: Git sürümü tespit edildi: {version}
zh: 检测到 Git 版本: {version}

source: Invalid Git Executable
ar: ملف Git تنفيذي غير صالح
de: Ungültige Git-Executable
es: Ejecutable de Git no válido
fr: Exécutable Git invalide
ru: Недействительный исполняемый файл Git
tr: Geçersiz Git Çalıştırılabilir
zh: 无效的 Git 可执行文件

# invalidGitExecutableMessage
source: The selected file is not a valid Git executable. Selected: {path} Output: {output}
ar: الملف المحدد ليس ملف Git تنفيذيًا صالحًا
de: Die ausgewählte Datei ist keine gültige Git-Executable. Ausgewählt: {path} Fehler: {error}
es: El ejecutable de Git seleccionado no es válido
fr: Le fichier sélectionné n'est pas un exécutable Git valide.
it: The selected file is not a valid Git executable.\n\nSelected: {path}\n\nOutput: {output}
ru: Выбранный файл не является действительным исполняемым файлом Git. Выбран: {path} Вывод: {output}
tr: Seçilen dosya geçerli bir Git çalıştırılabilir dosyası değil
zh: 选定的文件不是有效的 Git 可执行文件

source: Execution Failed
ar: فشل التنفيذ
de: Ausführung fehlgeschlagen
es: Ejecución fallida
fr: Échec de l'exécution
ru: Не удалось выполнить
tr: Yürütme Başarısız
zh: 执行失败

# executionFailedMessage
source: Failed to execute the selected file. Selected: {path} Error: {error}
ar: فشل تشغيل الملف التنفيذي. تحقق من الأذونات
de: Ausführung der ausgewählten Datei fehlgeschlagen. Ausgewählt: {path} Fehler: {error}
es: La ejecución del comando falló
fr: L'exécutable sélectionné n'a pas pu être exécuté.
it: Failed to execute the selected file.\n\nSelected: {path}\n\nError: {error}
ru: Не удалось выполнить выбранный файл. Выбран: {path} Ошибка: {error}
tr: Git çalıştırılamadı - yol doğru mu?
zh: 无法执行选定的文件

source: Validation Error
ar: خطأ في التحقق
de: Validierungsfehler
es: Error de validación
fr: Erreur de validation
ru: Ошибка проверки
tr: Doğrulama Hatası
zh: 验证错误

# validationErrorMessage
source: An error occurred while validating the selected file. Selected: {path} Error: {error}
ar: حدث خطأ أثناء التحقق من صحة الملف التنفيذي
de: Beim Validieren der ausgewählten Datei ist ein Fehler aufgetreten. Ausgewählt: {path} Fehler: {error}
es: Se produjo un error al validar el archivo seleccionado. Seleccionado: {path} Error: {error}
fr: Une erreur s'est produite lors de la validation du fichier sélectionné. Sélectionné: {path} Erreur: {error}
it: An error occurred while validating the selected file.\n\nSelected: {path}\n\nError: {error}
ru: Произошла ошибка при проверке выбранного файла. Выбран: {path} Ошибка: {error}
tr: Git sürümü doğrulanamadı
zh: 验证文件时发生错误。 已选择：{path} 错误：{error}

source: Select Text Editor
ar: اختر محرر نصوص
de: Texteditor auswählen
es: Seleccionar editor de texto
fr: Sélectionner l'éditeur de texte
it: Seleziona editor di testo
ru: Выберите текстовый редактор
tr: Metin Editörü Seç
zh: 选择文本编辑器

source: Select Diff Tool
ar: اختر أداة Diff
de: Diff-Werkzeug auswählen
es: Seleccionar herramienta de diff
fr: Sélectionner l'outil de diff
it: Seleziona strumento di diff
ru: Выберите инструмент сравнения
tr: Diff Aracı Seç
zh: 选择差异工具

source: Select Merge Tool
ar: اختر أداة Merge
de: Merge-Werkzeug auswählen
es: Seleccionar herramienta de merge
fr: Sélectionner l'outil de fusion
it: Seleziona strumento di merge
ru: Выберите инструмент слияния
tr: Merge Aracı Seç
zh: 选择合并工具

source: Selected file does not exist
ar: الملف المحدد غير موجود
de: Ausgewählte Datei existiert nicht
es: El archivo seleccionado no existe
fr: Le fichier sélectionné n'existe pas ou n'est pas exécutable
it: Il file selezionato non esiste
ru: Выбранный файл не существует
tr: Seçilen dosya mevcut değil
zh: 选定的文件不存在

source: Unknown Text Editor
ar: محرر نصوص غير معروف
de: Unbekannter Texteditor
es: Editor de texto desconocido
fr: Éditeur de texte inconnu
ru: Неизвестный текстовый редактор
tr: Bilinmeyen Metin Editörü
zh: 未知的文本编辑器

# unknownTextEditorMessage
source: The selected file "{fileName}" is not a recognized text editor. Known text editors: Visual Studio Code (code.exe) Notepad (notepad.exe) Notepad++ (notepad++.exe) Sublime Text (sublime_text.exe) Vim (vim.exe, gvim.exe, nvim.exe) Emacs (emacs.exe) Atom (atom.exe) etc. Do you want to use this file anyway?
ar: الملف المحدد ليس محرر نصوص معروفًا. هل تريد استخدامه على أي حال؟
de: Die ausgewählte Datei "{fileName}" ist kein erkannter Texteditor.
es: El editor de texto configurado no se reconoce
fr: L'éditeur sélectionné n'est pas reconnu comme un éditeur de texte valide.
it: The selected file "{fileName}" is not a recognized text editor.\n\nKnown text editors:\n• Visual Studio Code (code.exe)\n• Notepad (notepad.exe)\n• Notepad++ (notepad++.exe)\n• Sublime Text (sublime_text.exe)\n• Vim (vim.exe, gvim.exe, nvim.exe)\n• Emacs (emacs.exe)\n• Atom (atom.exe)\n• etc.\n\nDo you want to use this file anyway?
ru: Выбранный файл "{fileName}" не является распознанным текстовым редактором. Известные текстовые редакторы: • Visual Studio Code (code.exe) • Notepad (notepad.exe) • Notepad++ (notepad++.exe) • Sublime Text (sublime_text.exe) • Vim (vim.exe, gvim.exe, nvim.exe) • Emacs (emacs.exe) • Atom (atom.exe) • и т.д. Вы хотите использовать этот файл в любом случае?
tr: Bu editör tanınmıyor, yine de kullanmak istiyor musunuz?
zh: 无法确定选定的文本编辑器

source: Use Anyway
ar: استخدام على أي حال
de: Trotzdem verwenden
es: Usar de todas formas
fr: Utiliser quand même
ru: Использовать в любом случае
tr: Yine de Kullan
zh: 仍然使用

source: Text editor set successfully
ar: تم تعيين محرر النصوص بنجاح
de: Texteditor erfolgreich festgelegt
es: Editor de texto configurado correctamente
fr: Éditeur de texte défini avec succès
ru: Текстовый редактор успешно установлен
tr: Metin editörü başarıyla ayarlandı
zh: 文本编辑器设置成功

source: Default User Name
ar: اسم المستخدم الافتراضي
de: Standard-Benutzername
es: Nombre de usuario predeterminado
fr: Nom d'utilisateur par défaut
ru: Имя пользователя по умолчанию
tr: Varsayılan Kullanıcı Adı
zh: 默认用户名

source: User Name
ar: اسم المستخدم
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
it: Nome Utente
ru: Имя пользователя
tr: Kullanıcı Adı
zh: 用户名

# userNameHint
source: John Doe
ar: الاسم الكامل
de: Ihr Name
es: Su Nombre
fr: Jean Dupont
ru: Иван Иванов
tr: Adınız Soyadınız
zh: Your Name

source: Default User Email
ar: البريد الإلكتروني الافتراضي
de: Standard-Benutzer-E-Mail
es: Email de usuario predeterminado
fr: Email utilisateur par défaut
ru: Email пользователя по умолчанию
tr: Varsayılan Kullanıcı E-postası
zh: 默认用户邮箱

source: Email
ar: البريد الإلكتروني
tr: E-posta
zh: 邮箱

# emailHint
source: john@example.com
ar: user@example.com
de: hans@beispiel.de
es: usuario@ejemplo.com
fr: jean@exemple.com
tr: your.email@example.com
zh: your.email@example.com

source: Auto Fetch Interval
ar: فاصل الجلب التلقائي
de: Auto-Fetch-Intervall
es: Intervalo de obtención automática
fr: Intervalle de récupération automatique
it: Intervallo auto-fetch
ru: Интервал автоматической загрузки
tr: Otomatik Getirme Aralığı
zh: 自动获取间隔

source: Minutes
ar: دقائق
de: Minuten
es: Minutos
it: Minuti
ru: Минуты
tr: Dakika
zh: 分钟

source: Default Commit Limit
ar: حد التثبيت الافتراضي
de: Standard-Commit-Limit
es: Límite de commits predeterminado
fr: Limite de commits par défaut
ru: Лимит коммитов по умолчанию
tr: Varsayılan Commit Limiti
zh: 默认提交限制

source: Commits
ar: تثبيتات
it: Commit
ru: Коммиты
tr: Commit'ler
zh: 提交

source: Reset Settings
ar: إعادة تعيين الإعدادات
de: Einstellungen zurücksetzen
es: Restablecer configuración
fr: Réinitialiser les paramètres
it: Reimposta Impostazioni
ru: Сбросить настройки
tr: Ayarları Sıfırla
zh: 重置设置

# resetSettingsMessage
source: Reset all settings to defaults? This cannot be undone.
ar: هل أنت متأكد من رغبتك في إعادة تعيين جميع الإعدادات إلى القيم الافتراضية؟
de: Alle Einstellungen auf Standardwerte zurücksetzen? Dies kann nicht rückgängig gemacht werden.
es: ¿Restablecer toda la configuración a valores predeterminados?
fr: Cela réinitialisera tous les paramètres à leurs valeurs par défaut. Êtes-vous sûr?
it: Reset all settings to defaults?\n\nThis cannot be undone.
ru: Сбросить все настройки к значениям по умолчанию? Это действие нельзя отменить.
tr: Tüm ayarları varsayılan değerlere sıfırla?
zh: 这将重置所有设置为默认值。是否继续?

source: Settings reset to defaults
ar: تم إعادة تعيين الإعدادات إلى القيم الافتراضية
de: Einstellungen auf Standardwerte zurückgesetzt
es: Configuración restablecida a valores predeterminados
fr: Paramètres réinitialisés aux valeurs par défaut
ru: Настройки сброшены к значениям по умолчанию
tr: Ayarlar varsayılanlara sıfırlandı
zh: 设置已重置为默认值

source: Select Diff Tool Executable
ar: اختر ملف أداة Diff التنفيذي
de: Diff-Tool-Executable auswählen
es: Seleccionar ejecutable de herramienta de diff
fr: Sélectionner l'exécutable de l'outil de diff
ru: Выберите исполняемый файл инструмента сравнения
tr: Diff Aracı Çalıştırılabilir Seç
zh: 选择差异工具可执行文件

source: Unknown Diff Tool
ar: أداة diff غير معروفة
de: Unbekanntes Diff-Tool
es: Herramienta de diff desconocida
fr: Outil de diff inconnu
ru: Неизвестный инструмент сравнения
tr: Bilinmeyen Diff Aracı
zh: 未知的差异工具

# unknownDiffToolMessage
source: The selected file "{fileName}" is not a recognized diff/merge tool. Known diff tools: VS Code (Code.exe) Beyond Compare (BCompare.exe) KDiff3 (kdiff3.exe) WinMerge (WinMergeU.exe) P4Merge (p4merge.exe) Meld (meld.exe) TortoiseMerge (TortoiseGitMerge.exe) Araxis Merge (compare.exe) etc. Do you want to use this file anyway?
ar: الملف المحدد ليس أداة diff معروفة. هل تريد استخدامه على أي حال؟
de: Die ausgewählte Datei "{fileName}" ist kein erkanntes Diff-/Merge-Tool.
es: La herramienta de diff configurada no se reconoce
fr: L'outil sélectionné n'est pas reconnu comme un outil de diff valide.
it: The selected file "{fileName}" is not a recognized diff/merge tool.\n\nKnown diff tools:\n• VS Code (Code.exe)\n• Beyond Compare (BCompare.exe)\n• KDiff3 (kdiff3.exe)\n• WinMerge (WinMergeU.exe)\n• P4Merge (p4merge.exe)\n• Meld (meld.exe)\n• TortoiseMerge (TortoiseGitMerge.exe)\n• Araxis Merge (compare.exe)\n• etc.\n\nDo you want to use this file anyway?
ru: Выбранный файл "{fileName}" не является распознанным инструментом сравнения/слияния. Известные инструменты сравнения: • VS Code (Code.exe) • Beyond Compare (BCompare.exe) • KDiff3 (kdiff3.exe) • WinMerge (WinMergeU.exe) • P4Merge (p4merge.exe) • Meld (meld.exe) • TortoiseMerge (TortoiseGitMerge.exe) • Araxis Merge (compare.exe) • и т.д. Вы хотите использовать этот файл в любом случае?
tr: Bu diff aracı tanınmıyor, yine de kullanmak istiyor musunuz?
zh: 无法确定选定的差异工具

source: Diff tool set successfully
ar: تم تعيين أداة Diff بنجاح
de: Diff-Tool erfolgreich festgelegt
es: Herramienta de diff configurada correctamente
fr: Outil de diff défini avec succès
ru: Инструмент сравнения успешно установлен
tr: Diff aracı başarıyla ayarlandı
zh: 差异工具设置成功

source: Select Merge Tool Executable
ar: اختر ملف أداة Merge التنفيذي
de: Merge-Tool-Executable auswählen
es: Seleccionar ejecutable de herramienta de merge
fr: Sélectionner l'exécutable de l'outil de fusion
ru: Выберите исполняемый файл инструмента слияния
tr: Merge Aracı Çalıştırılabilir Seç
zh: 选择合并工具可执行文件

source: Unknown Merge Tool
ar: أداة merge غير معروفة
de: Unbekanntes Merge-Tool
es: Herramienta de merge desconocida
fr: Outil de fusion inconnu
ru: Неизвестный инструмент слияния
tr: Bilinmeyen Merge Aracı
zh: 未知的合并工具

# unknownMergeToolMessage
source: The selected file "{fileName}" is not a recognized diff/merge tool. Known merge tools: VS Code (Code.exe) Beyond Compare (BCompare.exe) KDiff3 (kdiff3.exe) WinMerge (WinMergeU.exe) P4Merge (p4merge.exe) Meld (meld.exe) TortoiseMerge (TortoiseGitMerge.exe) Araxis Merge (compare.exe) etc. Do you want to use this file anyway?
ar: الملف المحدد ليس أداة merge معروفة. هل تريد استخدامه على أي حال؟
de: Die ausgewählte Datei "{fileName}" ist kein erkanntes Diff-/Merge-Tool.
es: La herramienta de merge configurada no se reconoce
fr: L'outil sélectionné n'est pas reconnu comme un outil de fusion valide.
it: The selected file "{fileName}" is not a recognized diff/merge tool.\n\nKnown merge tools:\n• VS Code (Code.exe)\n• Beyond Compare (BCompare.exe)\n• KDiff3 (kdiff3.exe)\n• WinMerge (WinMergeU.exe)\n• P4Merge (p4merge.exe)\n• Meld (meld.exe)\n• TortoiseMerge (TortoiseGitMerge.exe)\n• Araxis Merge (compare.exe)\n• etc.\n\nDo you want to use this file anyway?
ru: Выбранный файл "{fileName}" не является распознанным инструментом сравнения/слияния. Известные инструменты слияния: • VS Code (Code.exe) • Beyond Compare (BCompare.exe) • KDiff3 (kdiff3.exe) • WinMerge (WinMergeU.exe) • P4Merge (p4merge.exe) • Meld (meld.exe) • TortoiseMerge (TortoiseGitMerge.exe) • Araxis Merge (compare.exe) • и т.д. Вы хотите использовать этот файл в любом случае?
tr: Bu merge aracı tanınmıyor, yine de kullanmak istiyor musunuz?
zh: 无法确定选定的合并工具

source: Merge tool set successfully
ar: تم تعيين أداة Merge بنجاح
de: Merge-Tool erfolgreich festgelegt
es: Herramienta de merge configurada correctamente
fr: Outil de fusion défini avec succès
ru: Инструмент слияния успешно установлен
tr: Merge aracı başarıyla ayarlandı
zh: 合并工具设置成功

# colorSchemeDeepPurple
source: Deep Purple
ar: بنفسجي غامق
de: Tiefviolett
es: Púrpura intenso
fr: Violet foncé
ru: Тёмно-фиолетовый
tr: Koyu Mor
zh: 深紫色

# colorSchemeIndigo
source: Indigo
ar: نيلي
es: Índigo
ru: Индиго
tr: Çivit Mavisi
zh: 靛蓝色

# colorSchemeBlue
source: Blue
ar: أزرق
de: Blau
es: Azul
fr: Bleu
ru: Синий
tr: Mavi
zh: 蓝色

# colorSchemeTeal
source: Teal
ar: أزرق مخضر
de: Blaugrün
es: Verde azulado
fr: Sarcelle
ru: Бирюзовый
tr: Deniz Mavisi
zh: 青色

# colorSchemeGreen
source: Green
ar: أخضر
de: Grün
es: Verde
fr: Vert
ru: Зелёный
tr: Yeşil
zh: 绿色

# colorSchemeRed
source: Red
ar: أحمر
de: Rot
es: Rojo
fr: Rouge
ru: Красный
tr: Kırmızı
zh: 红色

# colorSchemePink
source: Pink
ar: وردي
de: Rosa
es: Rosa
fr: Rose
ru: Розовый
tr: Pembe
zh: 粉色

# colorSchemePurple
source: Purple
ar: بنفسجي
de: Violett
es: Púrpura
fr: Violet
ru: Фиолетовый
tr: Mor
zh: 紫色

# colorSchemeDeepOrange
source: Deep Orange
ar: برتقالي غامق
de: Tieforange
es: Naranja intenso
fr: Orange foncé
ru: Тёмно-оранжевый
tr: Koyu Turuncu
zh: 深橙色

# colorSchemeBlueGrey
source: Blue Grey
ar: رمادي مزرق
de: Blaugrau
es: Azul grisáceo
fr: Bleu gris
ru: Сине-серый
tr: Mavi Gri
zh: 蓝灰色
