Repository: kartalbas/flutter-gitui
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# commandCategorySubmodules
source: Submodules
ar: الوحدات الفرعية
de: Submodule
es: Submódulos
fr: Sous-modules
ru: Подмодули
tr: Alt Modüller
zh: 子模块

# commandCategoryAdvanced
source: Advanced
ar: متقدم
de: Erweitert
es: Avanzado
fr: Avancé
ru: Расширенные
tr: Gelişmiş
zh: 高级

# commandCategorySettings
source: Settings
ar: الإعدادات
de: Einstellungen
es: Configuración
fr: Paramètres
ru: Настройки
tr: Ayarlar
zh: 设置

# commandCloneRepository
source: Clone Repository
ar: استنساخ مستودع
de: Repository klonen
es: Clonar repositorio
fr: Cloner un dépôt
ru: Клонировать репозиторий
tr: Depo Klonla
zh: 克隆仓库

# commandCloneRepositoryDesc
source: Clone a repository from a URL
ar: استنساخ مستودع من عنوان URL بعيد
de: Ein Repository von einer URL klonen
es: Clonar un repositorio desde URL remota
fr: Cloner un dépôt depuis une URL
ru: Клонировать репозиторий из URL
tr: Bir URL'den depo klonla
zh: 从远程 URL 克隆仓库

# commandOpenRepository
source: Open Repository
ar: فتح مستودع
de: Repository öffnen
es: Abrir repositorio
fr: Ouvrir un dépôt
ru: Открыть репозиторий
tr: Depo Aç
zh: 打开仓库

# commandOpenRepositoryDesc
source: Open an existing local repository
ar: فتح مستودع Git موجود
de: Ein existierendes lokales Repository öffnen
es: Abrir un repositorio Git existente
fr: Ouvrir un dépôt Git existant
ru: Открыть существующий локальный репозиторий
tr: Mevcut yerel bir depo aç
zh: 打开现有 Git 仓库

# commandInitializeRepository
source: Initialize Repository
ar: تهيئة مستودع
de: Repository initialisieren
es: Inicializar repositorio
fr: Initialiser un dépôt
ru: Инициализировать репозиторий
tr: Depo Başlat
zh: 初始化仓库

# commandInitializeRepositoryDesc
source: Create a new Git repository
ar: إنشاء مستودع Git جديد
de: Ein neues Git-Repository erstellen
es: Crear un nuevo repositorio Git
fr: Créer un nouveau dépôt Git
ru: Создать новый Git-репозиторий
tr: Yeni bir Git deposu oluştur
zh: 在目录中创建新的 Git 仓库

# commandCommitChanges
source: Commit Changes
ar: تثبيت التغييرات
de: Änderungen committen
es: Commit de cambios
fr: Valider les modifications
ru: Зафиксировать изменения
tr: Değişiklikleri Commit Et
zh: 提交更改

# commandCommitChangesDesc
source: Commit staged changes to the repository
ar: تثبيت التغييرات المحضرة
de: Gestagete Änderungen in das Repository committen
es: Guardar cambios preparados en el historial
fr: Valider les modifications indexées dans le dépôt
ru: Зафиксировать проиндексированные изменения в репозиторий
tr: Hazırlanmış değişiklikleri commit et
zh: 提交暂存的更改

# commandAmendLastCommit
source: Amend Last Commit
ar: تعديل آخر تثبيت
de: Letzten Commit ändern
es: Modificar último commit
fr: Modifier le dernier commit
ru: Исправить последний коммит
tr: Son Commit'i Düzenle
zh: 修正最后一次提交

# commandAmendLastCommitDesc
source: Amend the last commit with new changes
ar: تعديل آخر تثبيت
de: Den letzten Commit mit neuen Änderungen ändern
es: Actualizar el último commit con cambios actuales
fr: Modifier le dernier commit avec de nouvelles modifications
ru: Исправить последний коммит новыми изменениями
tr: Son commit'i yeni değişikliklerle düzenle
zh: 用新更改修正最后一次提交

# commandStageAllFiles
source: Stage All Files
ar: تحضير جميع الملفات
de: Alle Dateien stagen
es: Preparar todos los archivos
fr: Indexer tous les fichiers
ru: Проиндексировать все файлы
tr: Tüm Dosyaları Hazırla
zh: 暂存所有文件

# commandStageAllFilesDesc
source: Stage all modified files for commit
ar: تحضير جميع التغييرات
de: Alle geänderten Dateien für Commit stagen
es: Añadir todos los cambios al área de preparación
fr: Indexer tous les fichiers modifiés pour le commit
ru: Проиндексировать все изменённые файлы для коммита
tr: Tüm değiştirilmiş dosyaları commit için hazırla
zh: 暂存所有已修改的文件

# commandUnstageAllFiles
source: Unstage All Files
ar: إلغاء تحضير جميع الملفات
de: Alle Dateien unstagen
es: Quitar todos los archivos del área de preparación
fr: Désindexer tous les fichiers
ru: Убрать из индекса все файлы
tr: Tüm Dosyaları Hazırlıktan Çıkar
zh: 取消暂存所有文件

# commandUnstageAllFilesDesc
source: Unstage all staged files
ar: إلغاء تحضير جميع التغييرات
de: Alle gestageten Dateien unstagen
es: Quitar todos los archivos del área de preparación
fr: Désindexer tous les fichiers indexés
ru: Убрать из индекса все проиндексированные файлы
tr: Tüm hazırlanmış dosyaları hazırlıktan çıkar
zh: 取消暂存所有文件

# commandDiscardAllChanges
source: Discard All Changes
ar: تجاهل جميع التغييرات
de: Alle Änderungen verwerfen
es: Descartar todos los cambios
fr: Abandonner toutes les modifications
ru: Отменить все изменения
tr: Tüm Değişiklikleri At
zh: 丢弃所有更改

# commandDiscardAllChangesDesc
source: Discard all uncommitted changes
ar: تجاهل جميع التغييرات غير المثبتة
de: Alle nicht committeten Änderungen verwerfen
es: Descartar todos los cambios en el directorio de trabajo
fr: Abandonner toutes les modifications non validées
ru: Отменить все незафиксированные изменения
tr: Tüm commit edilmemiş değişiklikleri at
zh: 丢弃所有未提交的更改

# commandViewCommitHistory
source: View Commit History
ar: عرض سجل التثبيت
de: Commit-Verlauf anzeigen
es: Ver historial de commits
fr: Voir l'historique des commits
ru: Посмотреть историю коммитов
tr: Commit Geçmişini Görüntüle
zh: 查看提交历史

# commandViewCommitHistoryDesc
source: View the commit history graph
ar: عرض سجل التثبيت
de: Den Commit-Verlaufs-Graph anzeigen
es: Explorar historial de commits del repositorio
fr: Voir le graphe de l'historique des commits
ru: Просмотреть граф истории коммитов
tr: Commit geçmişi grafiğini görüntüle
zh: 显示仓库的完整提交历史

# commandViewFileHistory
source: View File History
ar: عرض سجل الملف
de: Dateiverlauf anzeigen
es: Ver historial de archivo
fr: Voir l'historique du fichier
ru: Посмотреть историю файла
tr: Dosya Geçmişini Görüntüle
zh: 查看文件历史

# commandViewFileHistoryDesc
source: View history for a specific file
ar: عرض سجل ملف محدد
de: Verlauf für eine bestimmte Datei anzeigen
es: Ver historial de commits de un archivo específico
fr: Afficher l'historique des commits d'un fichier
ru: Просмотреть историю определённого файла
tr: Belirli bir dosyanın geçmişini görüntüle
zh: 显示特定文件的历史

# commandCompareBranches
source: Compare Branches
ar: مقارنة الفروع
de: Branches vergleichen
es: Comparar ramas
fr: Comparer les branches
ru: Сравнить ветки
tr: Dalları Karşılaştır
zh: 比较分支

# commandCompareBranchesDesc
source: Compare two branches
ar: مقارنة فرعين
de: Zwei Branches vergleichen
es: Ver diferencias entre dos ramas
fr: Comparer deux branches
ru: Сравнить две ветки
tr: İki dalı karşılaştır
zh: 比较两个分支的差异

# commandCreateBranch
source: Create Branch
ar: إنشاء فرع
de: Branch erstellen
es: Crear rama
fr: Créer une branche
ru: Создать ветку
tr: Dal Oluştur
zh: 创建分支

# commandCreateBranchDesc
source: Create a new branch
ar: إنشاء فرع جديد
de: Einen neuen Branch erstellen
es: Crear una nueva rama
fr: Créer une nouvelle branche
ru: Создать новую ветку
tr: Yeni bir dal oluştur
zh: 创建新分支

# commandCheckoutBranch
source: Checkout Branch
ar: الانتقال إلى فرع
de: Branch auschecken
es: Checkout de rama
fr: Checkout de branche
ru: Переключить ветку
tr: Dalı Checkout Et
zh: 检出分支

# commandCheckoutBranchDesc
source: Switch to a different branch
ar: التبديل إلى فرع آخر
de: Zu einem anderen Branch wechseln
es: Cambiar a una rama diferente
fr: Basculer vers une branche différente
ru: Переключиться на другую ветку
tr: Farklı bir dala geç
zh: 切换到不同的分支

# commandRenameBranch
source: Rename Branch
ar: إعادة تسمية الفرع
de: Branch umbenennen
es: Renombrar rama
fr: Renommer une branche
ru: Переименовать ветку
tr: Dalı Yeniden Adlandır
zh: 重命名分支

# commandRenameBranchDesc
source: Rename the current branch
ar: إعادة تسمية الفرع الحالي
de: Den aktuellen Branch umbenennen
es: Cambiar el nombre de una rama
fr: Changer le nom d'une branche
ru: Переименовать текущую ветку
tr: Mevcut dalı yeniden adlandır
zh: 更改分支名称

# commandDeleteBranch
source: Delete Branch
ar: حذف فرع
de: Branch löschen
es: Eliminar rama
fr: Supprimer une branche
ru: Удалить ветку
tr: Dalı Sil
zh: 删除分支

# commandDeleteBranchDesc
source: Delete a local branch
ar: حذف فرع
de: Einen lokalen Branch löschen
es: Eliminar una rama local o remota
fr: Supprimer une branche locale
ru: Удалить локальную ветку
tr: Bir dalı sil
zh: 删除本地或远程分支

# commandMergeBranch
source: Merge Branch
ar: دمج فرع
de: Branch mergen
es: Fusionar rama
fr: Fusionner une branche
ru: Объединить ветку
tr: Dalı Birleştir
zh: 合并分支

# commandMergeBranchDesc
source: Merge another branch into current
ar: دمج فرع في الفرع الحالي
de: Einen anderen Branch in den aktuellen mergen
es: Fusionar otra rama en la rama actual
fr: Fusionner une branche dans la branche actuelle
ru: Объединить другую ветку с текущей
tr: Bir dalı mevcut dala birleştir
zh: 将另一个分支合并到当前分支

# commandRebaseBranch
source: Rebase Branch
ar: إعادة تأسيس فرع
de: Branch rebasen
es: Rebase de rama
fr: Rebaser une branche
ru: Перебазировать ветку
tr: Dalı Rebase Et
zh: 变基分支

# commandRebaseBranchDesc
source: Rebase current branch onto another
ar: إعادة تأسيس الفرع الحالي
de: Aktuellen Branch auf einen anderen rebasen
es: Rebasar la rama actual sobre otra rama
fr: Rebaser la branche actuelle sur une autre
ru: Перебазировать текущую ветку на другую
tr: Mevcut dalı rebase et
zh: 在另一个分支之上重放提交

# commandFetchFromRemote
source: Fetch from Remote
ar: الجلب من المستودع البعيد
de: Vom Remote abrufen
es: Fetch desde remoto
fr: Récupérer depuis un distant
ru: Загрузить из удалённого репозитория
tr: Uzaktan Getir
zh: 从远程获取

# commandFetchFromRemoteDesc
source: Fetch changes from remote repository
ar: جلب التغييرات من المستودع البعيد
de: Änderungen vom Remote-Repository abrufen
es: Obtener cambios del repositorio remoto
fr: Télécharger les modifications depuis un dépôt distant
ru: Загрузить изменения из удалённого репозитория
tr: Uzak depodan değişiklikleri getir
zh: 从远程仓库获取更改

# commandPullChanges
source: Pull Changes
ar: سحب التغييرات
de: Änderungen pullen
es: Pull de cambios
fr: Pull des modifications
ru: Получить изменения
tr: Değişiklikleri Pull Et
zh: 拉取更改

# commandPullChangesDesc
source: Pull changes from remote (fetch + merge)
ar: سحب التغييرات من المستودع البعيد
de: Änderungen vom Remote pullen (fetch + merge)
es: Obtener y fusionar cambios desde remoto
fr: Pull des modifications depuis le distant (fetch + merge)
ru: Получить изменения из удалённого репозитория (fetch + merge)
tr: Uzaktan değişiklikleri pull et (fetch + merge)
zh: 从远程拉取并合并更改

# commandPullWithRebase
source: Pull with Rebase
ar: السحب مع إعادة التأسيس
de: Pull mit Rebase
es: Pull con rebase
fr: Pull avec rebase
ru: Получить с перебазированием
tr: Rebase ile Pull Et
zh: 使用变基拉取

# commandPullWithRebaseDesc
source: Pull changes and rebase instead of merge
ar: سحب التغييرات مع إعادة التأسيس
de: Änderungen pullen und rebasen statt mergen
es: Obtener y hacer rebase de cambios desde remoto
fr: Pull des modifications et rebaser au lieu de fusionner
ru: Получить изменения и выполнить перебазирование вместо слияния
tr: Değişiklikleri pull et ve birleştirme yerine rebase yap
zh: 拉取并变基而不是合并

# commandPushChanges
source: Push Changes
ar: دفع التغييرات
de: Änderungen pushen
es: Push de cambios
fr: Push des modifications
ru: Отправить изменения
tr: Değişiklikleri Push Et
zh: 推送更改

# commandPushChangesDesc
source: Push commits to remote repository
ar: دفع التغييرات إلى المستودع البعيد
de: Commits zum Remote-Repository pushen
es: Enviar commits locales al repositorio remoto
fr: Push des commits vers le dépôt distant
ru: Отправить коммиты в удалённый репозиторий
tr: Commit'leri uzak depoya push et
zh: 将本地提交推送到远程

# commandManageRemotes
source: Manage Remotes
ar: إدارة المستودعات البعيدة
de: Remotes verwalten
es: Administrar remotos
fr: Gérer les distants
ru: Управление удалёнными репозиториями
tr: Uzakları Yönet
zh: 管理远程

# commandManageRemotesDesc
source: Add, remove, or edit remotes
ar: إدارة المستودعات البعيدة
de: Remotes hinzufügen, entfernen oder bearbeiten
es: Añadir, editar o eliminar repositorios remotos
fr: Ajouter, supprimer ou modifier des distants
ru: Добавить, удалить или изменить удалённые репозитории
tr: Uzak ekle, kaldır veya düzenle
zh: 添加、编辑或删除远程仓库

# commandStashChanges
source: Stash Changes
ar: حفظ التغييرات مؤقتًا
de: Änderungen stashen
es: Stash de cambios
fr: Stasher les modifications
ru: Отложить изменения
tr: Değişiklikleri Stash'le
zh: 储藏更改

# commandStashChangesDesc
source: Save changes for later without committing
ar: حفظ التغييرات الحالية مؤقتًا
de: Änderungen für später speichern ohne zu committen
es: Guardar cambios para aplicarlos más tarde
fr: Sauvegarder les modifications pour plus tard sans commiter
ru: Сохранить изменения на потом без коммита
tr: Commit etmeden değişiklikleri daha sonra için kaydet
zh: 保存更改以供日后使用

# commandPopStash
source: Pop Stash
ar: استعادة التغييرات المحفوظة
de: Stash poppen
es: Extraer stash
fr: Extraire un stash
ru: Извлечь Stash
tr: Stash Çıkar
zh: 弹出储藏

# commandPopStashDesc
source: Apply and remove the latest stash
ar: تطبيق وإزالة أحدث مخزون
de: Neuesten Stash anwenden und entfernen
es: Aplicar y eliminar el stash más reciente
fr: Appliquer et supprimer le stash le plus récent
ru: Применить и удалить последний stash
tr: En son stash'i uygula ve kaldır
zh: 应用储藏并删除

# commandApplyStash
source: Apply Stash
ar: تطبيق المخزون
de: Stash anwenden
es: Aplicar stash
fr: Appliquer un stash
ru: Применить Stash
tr: Stash Uygula
zh: 应用储藏

# commandApplyStashDesc
source: Apply stash without removing it
ar: تطبيق المخزون بدون إزالته
de: Stash anwenden ohne ihn zu entfernen
es: Aplicar cambios guardados en stash al directorio de trabajo
fr: Appliquer un stash sans le supprimer
ru: Применить stash без его удаления
tr: Stash'i kaldırmadan uygula
zh: 应用储藏但不删除

# commandViewAllStashes
source: View All Stashes
ar: عرض جميع التغييرات المحفوظة
de: Alle Stashes anzeigen
es: Ver todos los stashes
fr: Voir tous les stashes
ru: Посмотреть все Stash
tr: Tüm Stash'leri Görüntüle
zh: 查看所有储藏

# commandViewAllStashesDesc
source: View and manage all stashes
ar: عرض جميع التغييرات المحفوظة مؤقتًا
de: Alle Stashes anzeigen und verwalten
es: Mostrar lista de todos los stashes guardados
fr: Voir et gérer tous les stashes
ru: Просмотреть и управлять всеми stash
tr: Tüm stash'leri görüntüle ve yönet
zh: 列出所有储藏的更改

# commandCreateTag
source: Create Tag
ar: إنشاء وسم
de: Tag erstellen
es: Crear etiqueta
fr: Créer un tag
ru: Создать тег
tr: Etiket Oluştur
zh: 创建标签

# commandCreateTagDesc
source: Create a new tag
ar: إنشاء وسم جديد
de: Einen neuen Tag erstellen
es: Crear una nueva etiqueta en el HEAD actual
fr: Créer un nouveau tag
ru: Создать новый тег
tr: Mevcut HEAD'de yeni etiket oluştur
zh: 在提交处创建标签

# commandDeleteTag
source: Delete Tag
ar: حذف وسم
de: Tag löschen
es: Eliminar etiqueta
fr: Supprimer un tag
ru: Удалить тег
tr: Etiketi Sil
zh: 删除标签

# commandDeleteTagDesc
source: Delete an existing tag
ar: حذف وسم
de: Einen existierenden Tag löschen
es: Eliminar una etiqueta local o remota
fr: Supprimer un tag local ou distant
ru: Удалить существующий тег
tr: Mevcut bir etiketi sil
zh: 删除本地或远程标签

# commandPushTag
source: Push Tag
ar: دفع وسم
de: Tag pushen
es: Push de etiqueta
fr: Push un tag
ru: Отправить тег
tr: Etiketi Push Et
zh: 推送标签

# commandPushTagDesc
source: Push tag to remote
ar: دفع وسم إلى المستودع البعيد
de: Tag zum Remote pushen
es: Enviar etiqueta al repositorio remoto
fr: Push un tag vers le distant
ru: Отправить тег в удалённый репозиторий
tr: Etiketi uzağa push et
zh: 将标签推送到远程仓库

# commandStartBisect
source: Start Bisect
ar: بدء التقسيم الثنائي
de: Bisect starten
es: Iniciar bisect
fr: Démarrer Bisect
ru: Запустить Bisect
tr: Bisect Başlat
zh: 启动二分查找

# commandStartBisectDesc
source: Start binary search for bug-introducing commit
ar: بدء جلسة تقسيم ثنائي
de: Binäre Suche nach Bug-Einführungs-Commit starten
es: Iniciar búsqueda binaria para encontrar commit defectuoso
fr: Commencer une recherche binaire de bug
ru: Начать бинарный поиск коммита с ошибкой
tr: Hatayı getiren commit için ikili arama başlat
zh: 查找引入错误的提交

# commandViewReflog
source: View Reflog
ar: عرض سجل المراجع
de: Reflog anzeigen
es: Ver reflog
fr: Voir le reflog
ru: Посмотреть Reflog
tr: Reflog'u Görüntüle
zh: 查看引用日志

# commandViewReflogDesc
source: View reference logs
ar: عرض سجل المراجع
de: Referenzprotokolle anzeigen
es: Ver registro de referencias de Git
fr: Voir les journaux de référence
ru: Просмотреть журнал ссылок
tr: Git referans günlüğünü görüntüle
zh: 显示 Git 引用日志

# commandCherryPickCommit
source: Cherry-pick Commit
ar: انتقاء تثبيت
de: Commit Cherry-Picken
es: Cherry-pick de commit
fr: Cherry-pick de commit
ru: Cherry-pick коммита
tr: Commit Cherry-Pick Et
zh: 拣选提交

# commandCherryPickCommitDesc
source: Apply a commit from another branch
ar: تطبيق إيداع من فرع آخر
de: Einen Commit von einem anderen Branch anwenden
es: Aplicar cambios de un commit específico
fr: Appliquer un commit depuis une autre branche
ru: Применить коммит из другой ветки
tr: Bir commit'i mevcut dala uygula
zh: 应用来自另一个分支的提交

# commandRevertCommit
source: Revert Commit
ar: التراجع عن تثبيت
de: Commit zurücksetzen
es: Revertir commit
fr: Annuler un commit
ru: Отменить коммит
tr: Commit'i Geri Al
zh: 还原提交

# commandRevertCommitDesc
source: Create a new commit that undoes a previous commit
ar: التراجع عن تثبيت
de: Einen neuen Commit erstellen, der einen vorherigen Commit rückgängig macht
es: Crear un nuevo commit que deshace cambios
fr: Créer un nouveau commit qui annule les modifications
ru: Создать новый коммит, отменяющий предыдущий коммит
tr: Bir commit'in değişikliklerini geri al
zh: 通过创建新提交来撤销提交

# commandResetToCommit
source: Reset to Commit
ar: إعادة التعيين إلى تثبيت
de: Auf Commit zurücksetzen
es: Reset a commit
fr: Réinitialiser à un commit
ru: Сбросить до коммита
tr: Commit'e Sıfırla
zh: 重置到提交

# commandResetToCommitDesc
source: Reset current branch to a specific commit
ar: إعادة تعيين الفرع إلى تثبيت محدد
de: Aktuellen Branch auf einen bestimmten Commit zurücksetzen
es: Restablecer la rama actual a un commit específico
fr: Réinitialiser la branche à un commit spécifique
ru: Сбросить текущую ветку до определённого коммита
tr: Mevcut dalı belirli bir commit'e sıfırla
zh: 将当前分支重置到特定提交

# commandCleanWorkingDirectory
source: Clean Working Directory
ar: تنظيف دليل العمل
de: Arbeitsverzeichnis bereinigen
es: Limpiar directorio de trabajo
fr: Nettoyer le répertoire de travail
ru: Очистить рабочий каталог
tr: Çalışma Dizinini Temizle
zh: 清理工作目录

# commandCleanWorkingDirectoryDesc
source: Remove untracked files
ar: إزالة الملفات غير المتتبعة
de: Unverfolgte Dateien entfernen
es: Eliminar archivos sin seguimiento
fr: Supprimer les fichiers non suivis
ru: Удалить неотслеживаемые файлы
tr: İzlenmeyen dosyaları kaldır
zh: 删除未跟踪的文件

# commandOpenSettings
source: Open Settings
ar: فتح الإعدادات
de: Einstellungen öffnen
es: Abrir configuración
fr: Ouvrir les paramètres
ru: Открыть настройки
tr: Ayarları Aç
zh: 打开设置

# commandOpenSettingsDesc
source: Configure application settings
ar: فتح شاشة الإعدادات
de: Anwendungseinstellungen konfigurieren
es: Abrir configuración de la aplicación
fr: Configurer les paramètres de l'application
ru: Настроить параметры приложения
tr: Uygulama ayarlarını yapılandır
zh: 打开应用程序设置

# commandConfigureDiffTools
source: Configure Diff Tools
ar: تكوين أدوات Diff
de: Diff-Tools konfigurieren
es: Configurar herramientas de diff
fr: Configurer les outils de diff
ru: Настроить инструменты сравнения
tr: Diff Araçlarını Yapılandır
zh: 配置差异工具

# commandConfigureDiffToolsDesc
source: Set up external diff and merge tools
ar: تكوين أدوات diff وmerge
de: Externe Diff- und Merge-Tools einrichten
es: Configurar herramientas externas de diff y merge
fr: Configurer les outils externes de diff et fusion
ru: Настроить внешние инструменты сравнения и слияния
tr: Harici diff ve birleştirme araçlarını ayarla
zh: 设置外部差异和合并工具

# folderSelectionNotAvailableWeb
source: Folder selection is not available in web browsers
ar: تحديد المجلد غير متاح على الويب
de: Ordnerauswahl ist in Webbrowsern nicht verfügbar
es: La selección de carpeta no está disponible en web
fr: La sélection de dossier n'est pas disponible dans les navigateurs web
ru: Выбор папки недоступен в веб-браузерах
tr: Web'de klasör seçimi mevcut değil
zh: Web 浏览器中不支持文件夹选择

# openedRepository
source: Opened repository: {repositoryName}
ar: تم فتح المستودع
de: Repository geöffnet: {repositoryName}
es: Repositorio abierto
fr: Dépôt ouvert: {repositoryName}
ru: Открыт репозиторий: {repositoryName}
tr: Depo açıldı: {path}
zh: 已打开仓库: {path}

# notValidGitRepository
source: Not a valid Git repository
ar: ليس مستودع Git صالحًا
de: Kein gültiges Git-Repository
es: No es un repositorio Git válido
fr: Pas un dépôt Git valide
ru: Не является действительным Git-репозиторием
tr: {path} geçerli bir Git deposu değil
zh: 不是有效的 Git 仓库

source: Select Git Repository
ar: اختر مستودع Git
de: Git-Repository auswählen
es: Seleccionar repositorio Git
ru: Выберите Git-репозиторий
tr: Git Deposu Seç
zh: 选择 Git 仓库

# amendLastCommitDialog
source: Amend Last Commit
ar: تعديل آخر تثبيت
de: Letzten Commit ändern
es: ¿Modificar último commit?
fr: Modifier le dernier commit
ru: Исправить последний коммит
tr: Son Commit'i Düzenle
zh: 修正最后一次提交

# amendLastCommitConfirm
source: This will amend the last commit with currently staged changes. The commit message will remain the same. Continue?
ar: هل أنت متأكد من رغبتك في تعديل آخر تثبيت؟
de: Dies ändert den letzten Commit mit den aktuell gestageten Änderungen
es: ¿Modificar el último commit? Esto actualizará el último commit con sus cambios actuales.
fr: Cela modifiera le dernier commit avec les modifications actuellement indexées. Le message du commit restera le même. Continuer?
ru: Это исправит последний коммит текущими проиндексированными изменениями. Сообщение коммита останется прежним. Продолжить?
tr: Bu, son commit'i şu anda hazırlanmış değişikliklerle düzenleyecektir. Commit mesajı aynı kalacaktır. Devam edilsin mi?
zh: 这将使用当前暂存的更改修正最后一次提交。提交消息将保持不变。是否继续?

# lastCommitAmendedSuccess
source: Last commit amended successfully
ar: تم تعديل آخر تثبيت بنجاح
de: Letzter Commit erfolgreich geändert
es: Último commit modificado correctamente
fr: Dernier commit modifié avec succès
ru: Последний коммит успешно исправлен
tr: Son commit başarıyla düzenlendi
zh: 最后一次提交已成功修正

# failedToAmendCommit
source: Failed to amend commit: {error}
ar: فشل تعديل التثبيت
de: Fehler beim Ändern des Commits: {error}
es: Error al modificar commit: {error}
fr: Échec de la modification du commit: {error}
ru: Не удалось исправить коммит: {error}
tr: Commit düzenleme başarısız
zh: 修正提交失败: {error}

# discardAllChangesDialog
source: Discard All Changes?
ar: تجاهل جميع التغييرات
de: Alle Änderungen verwerfen?
es: ¿Descartar todos los cambios?
fr: Abandonner toutes les modifications?
ru: Отменить все изменения?
tr: Tüm Değişiklikler Atılsın mı?
zh: 丢弃所有更改

# discardAllChangesConfirm
source: Discard all unstaged changes? This cannot be undone.
ar: هل أنت متأكد من رغبتك في تجاهل جميع التغييرات؟
de: Alle ungestageten Änderungen verwerfen? Dies kann nicht rückgängig gemacht werden.
es: ¿Descartar todos los cambios? Esto eliminará todos los cambios no confirmados. Esta acción no se puede deshacer.
fr: Abandonner toutes les modifications non indexées? Cela ne peut pas être annulé.
it: Discard all unstaged changes?\n\nThis cannot be undone.
ru: Отменить все непроиндексированные изменения? Это действие нельзя отменить.
tr: Tüm değişiklikler atılsın mı? Bu işlem geri alınamaz.
zh: 丢弃所有未提交的更改? 此操作无法撤销。

# cherryPickCommitDialog
source: Cherry-pick Commit
ar: انتقاء تثبيت
de: Commit Cherry-Picken
es: Cherry-pick de commit
fr: Cherry-pick de commit
ru: Cherry-pick коммита
tr: Commit Cherry-Pick Et
zh: 拣选提交
