Repository: kartalbas/flutter-gitui
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# thisWillMergeSelectedBranch
source: This will merge the selected branch into your current branch.
ar: سيدمج هذا الفرع المحدد في الفرع الحالي
de: Dies merged den ausgewählten Branch in Ihren aktuellen Branch.
es: Esto fusionará la rama seleccionada en la rama actual
fr: Cela fusionnera la branche sélectionnée dans la branche actuelle
it: Questo unirà il branch selezionato nel branch corrente
ru: Это объединит выбранную ветку с вашей текущей веткой.
tr: Bu, seçili dalı mevcut dalınıza birleştirecektir
zh: 这将把选定的分支合并到当前分支

source: Merging branch...
ar: جارٍ دمج الفرع...
de: Branch wird gemergt...
es: Fusionando rama {branchName}...
fr: Fusion de la branche...
it: Unione del branch in corso...
ru: Объединение ветки...
tr: "{branchName}" dalı birleştiriliyor...
zh: 正在合并分支

# mergeHasConflicts
source: Merge has conflicts: {count} file(s) need resolution
ar: الدمج به تعارضات
de: Merge hat Konflikte: {count} Datei(en) benötigen Auflösung
es: El merge tiene conflictos que deben resolverse
fr: La fusion a des conflits: {count} fichier(s) nécessitent une résolution
it: L'unione ha conflitti
ru: Слияние содержит конфликты: требуется разрешение {count} файлов
tr: Birleştirmede çakışmalar var - lütfen çözün
zh: 合并有冲突

source: Resolve
ar: حل
de: Auflösen
es: Resolver
fr: Résoudre
it: Risolvi
ru: Разрешить
tr: Çöz
zh: 解决

# successfullyMergedBranch
source: Successfully merged {branchName} into {currentBranch}
ar: تم دمج الفرع بنجاح
de: {branchName} erfolgreich in {currentBranch} gemergt
es: Rama fusionada correctamente en la rama actual
fr: Branche fusionnée avec succès
it: Branch unito con successo
ru: Успешно объединена {branchName} в {currentBranch}
tr: "{branchName}" dalı başarıyla birleştirildi
zh: 已成功合并分支

# failedToMergeBranch
source: Failed to merge branch: {error}
ar: فشل دمج الفرع
de: Fehler beim Mergen des Branches: {error}
es: Error al fusionar rama: {error}
fr: Échec de la fusion de la branche: {error}
it: Impossibile unire il branch: {error}
ru: Не удалось объединить ветку: {error}
tr: Dal birleştirme başarısız
zh: 合并分支失败: {error}

source: Rebase Branch
ar: إعادة تأسيس الفرع
de: Branch rebasen
es: Rebase de rama
fr: Rebaser la branche
ru: Перебазировать ветку
tr: Dalı Rebase Et
zh: 变基分支

# rebaseWillReplayCommits
source: Rebase will replay your current branch's commits onto another branch.
ar: ستعيد إعادة التأسيس تشغيل التثبيتات على قمة الفرع المحدد
de: Rebase wird die Commits Ihres aktuellen Branches auf einen anderen Branch anwenden.
es: El rebase reproducirá sus commits sobre la rama de destino
fr: Le rebase rejouera vos commits au-dessus de la branche cible
it: Il rebase riprodurrà i commit del tuo branch corrente su un altro branch.
ru: Перебазирование воспроизведёт коммиты вашей текущей ветки поверх другой ветки.
tr: Rebase, commit'lerinizi başka bir dalın üzerine yeniden uygulayacaktır
zh: 变基将在另一个分支之上重放提交

source: Current Branch
ar: الفرع الحالي
de: Aktueller Branch
es: Rama actual
fr: Branche actuelle
it: Branch Corrente
ru: Текущая ветка
tr: Mevcut Dal
zh: 当前分支

source: Rebase onto Branch
ar: إعادة التأسيس على الفرع
de: Auf Branch rebasen
es: Rebase sobre rama
fr: Rebaser sur la branche
it: Rebase su branch
ru: Перебазировать на ветку
tr: Rebase hedef dalı
zh: 变基到分支

source: Interactive Rebase
ar: إعادة تأسيس تفاعلية
de: Interaktiver Rebase
es: Rebase interactivo
fr: Rebase interactif
it: Rebase interattivo
ru: Интерактивное перебазирование
tr: Etkileşimli Rebase
zh: 交互式变基

# editCommitsDuringRebase
source: Edit commits during rebase (advanced)
ar: تعديل التثبيتات أثناء إعادة التأسيس
de: Commits während Rebase bearbeiten (erweitert)
es: Editar commits durante rebase
fr: Modifier les commits pendant le rebase (avancé)
it: Modifica commit durante il rebase
ru: Изменить коммиты во время перебазирования (расширенное)
tr: Rebase sırasında commit'leri düzenle
zh: 在变基期间编辑提交

# rebaseWarning
source: Warning: Rebasing rewrites commit history. Only rebase commits that haven't been pushed to a shared repository.
ar: تحذير: ستغير إعادة التأسيس سجل التثبيت. لا تعد تأسيس التثبيتات التي تم دفعها
de: Warnung: Rebasen schreibt Commit-Verlauf um. Rebasen Sie nur Commits, die noch nicht gepusht wurden.
es: Advertencia de rebase
fr: Attention: Le rebase réécrit l'historique. Évitez de rebaser des commits déjà push és.
it: Attenzione: Il rebase riscrive la cronologia dei commit
ru: Внимание: Перебазирование перезаписывает историю коммитов. Перебазируйте только коммиты, которые не были отправлены в общий репозиторий.
tr: Uyarı: Rebase, commit geçmişini yeniden yazar
zh: 变基会重写历史 - 仅在您是分支的唯一开发者时使用

source: Rebase Conflicts
ar: إعادة التأسيس بها تعارضات
de: Rebase-Konflikte
es: Conflictos de rebase
fr: Conflits de rebase
it: Conflitti di Rebase
ru: Конфликты перебазирования
tr: Rebase Çakışmaları
zh: 变基冲突

source: Rebase In Progress
ar: إعادة التأسيس قيد التنفيذ
de: Rebase läuft
es: Rebase en progreso
fr: Rebase en cours
it: Rebase in corso
ru: Выполняется перебазирование
tr: Rebase Devam Ediyor
zh: 变基进行中

# step
source: Step {progressText}
ar: الخطوة
de: Schritt {progressText}
es: Paso {current} de {total}
fr: Étape
it: Passo
ru: Шаг {progressText}
tr: Adım
zh: 步骤

source: Rebasing onto
ar: إعادة التأسيس على
de: Rebasen auf
es: Haciendo rebase sobre {branch}...
fr: Rebase sur {branchName}
it: Rebase su
ru: Перебазирование на
tr: Rebase hedefi
zh: 正在变基到 {target}

source: Current Commit
ar: التثبيت الحالي
de: Aktueller Commit
es: Commit actual
fr: Commit actuel
it: Commit corrente
ru: Текущий коммит
tr: Mevcut Commit
zh: 当前提交

source: Conflicts Detected
ar: تم اكتشاف تعارضات
de: Konflikte erkannt
es: Conflictos detectados
fr: Conflits détectés
it: Conflitti rilevati
ru: Обнаружены конфликты
tr: Çakışmalar tespit edildi
zh: 检测到冲突

# resolveConflictsInChangesScreen
source: Resolve conflicts in the Changes screen, then click Continue to proceed with the rebase.
ar: حل التعارضات في شاشة التغييرات
de: Lösen Sie Konflikte im Änderungen-Bildschirm, dann klicken Sie auf Fortsetzen
es: Resuelva los conflictos en la pantalla de cambios
fr: Résolvez les conflits dans l'écran Modifications, puis continuez le rebase
it: Risolvi i conflitti nella schermata modifiche
ru: Разрешите конфликты на экране Изменения, затем нажмите Продолжить для продолжения перебазирования.
tr: Çakışmaları Değişiklikler ekranında çözün
zh: 在变更屏幕中解决冲突

source: Go to Changes
ar: الانتقال إلى التغييرات
de: Zu Änderungen gehen
es: Ir a cambios
fr: Aller aux modifications
it: Vai alle Modifiche
ru: Перейти к изменениям
tr: Değişikliklere Git
zh: 转到变更

# rebaseIsInProgress
source: Rebase is in progress. You can:
ar: إعادة التأسيس قيد التنفيذ
de: Rebase läuft. Sie können:
es: Hay un rebase en progreso
fr: Un rebase est en cours
it: È in corso un rebase
ru: Выполняется перебазирование. Вы можете:
tr: Rebase devam ediyor
zh: 变基正在进行中

source: Abort to cancel and return to original state
ar: قم بالإلغاء للإلغاء والعودة إلى الحالة الأصلية
de: Abbrechen, um den Vorgang abzubrechen und zum ursprünglichen Zustand zurückzukehren
es: Abortar para cancelar y volver al estado original
fr: Abandonner pour annuler et revenir à l'état d'origine
it: Interrompi per annullare e tornare allo stato originale
ru: Прервать, чтобы отменить и вернуться к исходному состоянию
tr: İptal ederek orijinal duruma geri dön
zh: 中止以取消并返回到原始状态

source: Wait for rebase to complete automatically
ar: انتظر حتى تكتمل إعادة التأسيس تلقائيًا
de: Warten Sie, bis der Rebase automatisch abgeschlossen ist
es: Espere a que el rebase se complete automáticamente o resuélvalo manualmente
fr: Attendez que le rebase se termine automatiquement
it: Attendi il completamento automatico del rebase
ru: Дождитесь автоматического завершения перебазирования
tr: Rebase'in otomatik olarak tamamlanmasını bekleyin
zh: 等待变基自动完成

source: Start Rebase
ar: بدء إعادة التأسيس
de: Rebase starten
es: Iniciar rebase
fr: Démarrer le rebase
it: Avvia Rebase
ru: Начать перебазирование
tr: Rebase Başlat
zh: 开始变基

source: Start Bisect
ar: بدء التقسيم الثنائي
de: Bisect starten
es: Iniciar bisect
fr: Démarrer Bisect
it: Avvia Bisect
ru: Запустить Bisect
tr: Bisect Başlat
zh: 开始二分查找

source: Abort
ar: إيقاف
de: Abbrechen
es: Abortar
fr: Abandonner
it: Interrompi
ru: Прервать
tr: İptal Et
zh: 中止

source: Skip
ar: تخطي
de: Überspringen
es: Omitir
fr: Ignorer
it: Salta
ru: Пропустить
tr: Atla
zh: 跳过

# continueOperation
source: Continue
ar: متابعة
de: Vorgang fortsetzen
es: Continuar operación
fr: Continuer
it: Continua Operazione
ru: Продолжить
tr: İşleme Devam Et
zh: 继续操作

source: Rebase started successfully
ar: بدأت إعادة التأسيس بنجاح
de: Rebase erfolgreich gestartet
es: Rebase iniciado correctamente
fr: Rebase démarré avec succès
it: Rebase avviato con successo
ru: Перебазирование успешно начато
tr: Rebase başarıyla başlatıldı
zh: 变基已成功开始

# rebaseStartedConflictNeedsResolution
source: Rebase started - conflicts need resolution
ar: بدأت إعادة التأسيس ولكنها تحتوي على تعارضات تحتاج إلى حل
de: Rebase gestartet - Konflikte müssen gelöst werden
es: Rebase iniciado: Los conflictos necesitan resolución
fr: Rebase démarré avec des conflits - résolution nécessaire
it: Rebase avviato, i conflitti richiedono risoluzione
ru: Перебазирование начато - необходимо разрешить конфликты
tr: Rebase başlatıldı ancak çakışmalar çözülmeli
zh: 变基已开始但遇到冲突需要解决

# failedToStartRebase
source: Failed to start rebase: {error}
ar: فشل بدء إعادة التأسيس
de: Fehler beim Starten des Rebase: {error}
es: Error al iniciar rebase: {error}
fr: Échec du démarrage du rebase: {error}
it: Impossibile avviare il rebase: {error}
ru: Не удалось начать перебазирование: {error}
tr: Rebase başlatma başarısız: {error}
zh: 启动变基失败: {error}

source: Rebase continued
ar: استمرت إعادة التأسيس
de: Rebase fortgesetzt
es: Rebase continuado
fr: Rebase continué
it: Rebase continuato
ru: Перебазирование продолжено
tr: Rebase devam etti
zh: 变基已继续

# failedToContinueRebase
source: Failed to continue rebase: {error}
ar: فشل استمرار إعادة التأسيس
de: Fehler beim Fortsetzen des Rebase: {error}
es: Error al continuar rebase: {error}
fr: Échec de la continuation du rebase: {error}
it: Impossibile continuare il rebase: {error}
ru: Не удалось продолжить перебазирование: {error}
tr: Rebase'e devam etme başarısız: {error}
zh: 继续变基失败: {error}

source: Commit skipped
ar: تم تخطي التثبيت
de: Commit übersprungen
es: Commit omitido
fr: Commit ignoré
it: Commit saltato
ru: Коммит пропущен
tr: Commit atlandı
zh: 提交已跳过

# failedToSkip
source: Failed to skip: {error}
ar: فشل التخطي
de: Fehler beim Überspringen: {error}
es: Error al omitir commit: {error}
fr: Échec de l'omission: {error}
it: Impossibile saltare: {error}
ru: Не удалось пропустить: {error}
tr: Atlama başarısız: {error}
zh: 跳过失败: {error}

source: Rebase aborted
ar: تم إلغاء إعادة التأسيس
de: Rebase abgebrochen
es: Rebase abortado
fr: Rebase abandonné
it: Rebase interrotto
ru: Перебазирование прервано
tr: Rebase iptal edildi
zh: 变基已中止

# failedToAbortRebase
source: Failed to abort rebase: {error}
ar: فشل إلغاء إعادة التأسيس
de: Fehler beim Abbrechen des Rebase: {error}
es: Error al abortar rebase: {error}
fr: Échec de l'abandon du rebase: {error}
it: Impossibile interrompere il rebase: {error}
ru: Не удалось прервать перебазирование: {error}
tr: Rebase iptal etme başarısız: {error}
zh: 中止变基失败: {error}

# noNodesAvailable
source: No other branches available
ar: لا توجد عقد متاحة
de: Keine anderen Branches verfügbar
es: No hay nodos disponibles
fr: Aucune autre branche disponible
it: Nessun nodo disponibile
ru: Нет других доступных веток
tr: Mevcut node yok
zh: 无可用节点

source: Git Bisect
ar: التقسيم الثنائي
zh: Git 二分查找

# bisectHelpsFindCommitThatIntroducedBug
source: Bisect helps find which commit introduced a bug by doing a binary search.
ar: يساعد التقسيم الثنائي في العثور على التثبيت الذي قدم خللًا
de: Bisect hilft dabei, den Commit zu finden, der einen Bug eingeführt hat, indem eine binäre Suche durchgeführt wird
es: Bisect ayuda a encontrar el commit que introdujo un error
fr: Bisect aide à trouver quel commit a introduit un bug en effectuant une recherche binaire.
it: Bisect aiuta a trovare il commit che ha introdotto un bug usando la ricerca binaria
ru: Bisect помогает найти коммит, который внёс ошибку, выполняя бинарный поиск.
tr: Bisect, ikili arama yaparak hatayı hangi commit'in getirdiğini bulmanıza yardımcı olur.
zh: 二分查找通过二分搜索帮助找到引入错误的提交。

source: Good Commit (where bug was NOT present)
ar: تثبيت جيد (حيث لم يكن الخلل موجودًا)
de: Guter Commit (Bug war NICHT vorhanden)
es: Commit bueno (donde el error no estaba presente)
fr: Commit sain (où le bug N'ÉTAIT PAS présent)
it: Commit buono (dove il bug non era presente)
ru: Хороший коммит (где ошибки НЕ было)
tr: İyi Commit (hata YOK)
zh: 好提交 (不存在错误)

source: Select a good commit...
ar: اختر تثبيتًا جيدًا
de: Wählen Sie einen guten Commit...
es: Seleccione un commit bueno
fr: Sélectionner un commit sain
it: Seleziona un commit buono
ru: Выберите хороший коммит...
tr: İyi bir commit seç
zh: 选择一个好提交

source: Bad Commit (where bug IS present)
ar: تثبيت سيئ (حيث الخلل موجود)
de: Fehlerhafter Commit (Bug IST vorhanden)
es: Commit malo (donde el error está presente)
fr: Commit défectueux (où le bug EST présent)
it: Commit cattivo (dove il bug è presente)
ru: Плохой коммит (где ошибка ПРИСУТСТВУЕТ)
tr: Hatalı Commit (hata MEVCUT)
zh: 坏提交 (存在错误)

source: Select a bad commit (defaults to HEAD)...
ar: اختر تثبيتًا سيئًا (افتراضيًا إلى HEAD)
de: Wählen Sie einen fehlerhaften Commit (Standard ist HEAD)...
es: Seleccione un commit malo (predeterminado: HEAD)
fr: Sélectionner un commit défectueux (par défaut: HEAD)
it: Seleziona un commit cattivo (predefinito: HEAD)
ru: Выберите плохой коммит (по умолчанию HEAD)...
tr: Hatalı bir commit seç (varsayılan: HEAD)
zh: 选择一个坏提交 (默认为 HEAD)

source: No commits available
ar: لا توجد تثبيتات متاحة
de: Keine Commits verfügbar
es: No hay commits disponibles
fr: Aucun commit disponible
it: Nessun commit disponibile
ru: Нет доступных коммитов
tr: Mevcut commit yok
zh: 无可用提交

source: Bisect In Progress
ar: التقسيم الثنائي قيد التنفيذ
de: Bisect läuft
es: Bisect en progreso
fr: Bisect en cours
it: Bisect in corso
ru: Bisect выполняется
tr: Bisect Devam Ediyor
zh: 二分查找进行中

# approximatelyStepsRemaining
source: Approximately {stepsRemaining} steps remaining
ar: تبقى {steps} خطوة تقريبًا
de: Ungefähr {stepsRemaining} Schritte verbleibend
es: Aproximadamente {steps} pasos restantes
fr: Environ {stepsRemaining} étapes restantes
it: Approssimativamente {steps} passi rimasti
ru: Примерно {stepsRemaining} шагов осталось
tr: Yaklaşık {stepsRemaining} adım kaldı
zh: 大约还需 {stepsRemaining} 步

# testThisCommitAndMark
source: Test this commit and mark it:
ar: اختبر هذا التثبيت وضع علامة عليه
de: Diesen Commit testen und markieren:
es: Pruebe este commit y márquelo como bueno o malo
fr: Testez ce commit et marquez-le comme bon ou mauvais
it: Testa questo commit e contrassegnalo:
ru: Протестируйте этот коммит и отметьте его:
tr: Bu commit'i test edin ve iyi veya hatalı olarak işaretleyin
zh: 测试此提交并标记为:

source: Good
ar: جيد
de: Gut
es: Bueno
fr: Bon
it: Buono
ru: Хороший
tr: İyi
zh: 好

source: Bad
ar: سيئ
de: Fehlerhaft
es: Malo
fr: Mauvais
it: Cattivo
ru: Плохой
tr: Hatalı
zh: 坏

source: Bisect History
ar: سجل التقسيم الثنائي
de: Bisect-Verlauf
es: Historial de bisect
fr: Historique Bisect
it: Cronologia Bisect
ru: История Bisect
tr: Bisect Geçmişi
zh: 二分查找历史

# goodCommits
source: Good commits: {count}
ar: تثبيتات جيدة
de: Gute Commits: {count}
es: Commits buenos: {count}
fr: Commits sains: {count}
it: Commit Buoni
ru: Хороших коммитов: {count}
tr: İyi commit'ler: {count}
zh: 好提交: {count}

# badCommits
source: Bad commits: {count}
ar: تثبيتات سيئة
de: Fehlerhafte Commits: {count}
es: Commits malos: {count}
fr: Commits défectueux: {count}
it: Commit Cattivi
ru: Плохих коммитов: {count}
tr: Hatalı commit'ler: {count}
zh: 坏提交: {count}

source: Bisect Complete!
ar: اكتمل التقسيم الثنائي
de: Bisect abgeschlossen!
es: Bisect completado
fr: Bisect terminé!
it: Bisect Completato
ru: Bisect завершён!
tr: Bisect Tamamlandı!
zh: 二分查找完成!

source: Found first bad commit:
ar: تم العثور على أول تثبيت سيئ
de: Ersten fehlerhaften Commit gefunden:
es: Se encontró el primer commit malo
fr: Premier commit défectueux trouvé:
it: Trovato il primo commit cattivo
ru: Найден первый плохой коммит:
tr: İlk hatalı commit bulundu
zh: 找到第一个坏提交!

# bisectStarted
source: Bisect started - test the current commit
ar: بدأ التقسيم الثنائي
de: Bisect gestartet - testen Sie den aktuellen Commit
es: Bisect iniciado
fr: Bisect démarré - testez le commit actuel
it: Bisect avviato
ru: Bisect запущен - протестируйте текущий коммит
tr: Bisect başlatıldı - mevcut commit'i test edin
zh: 二分查找已开始 - 测试当前提交

# failedToStartBisect
source: Failed to start bisect: {error}
ar: فشل بدء التقسيم الثنائي
de: Fehler beim Starten von Bisect: {error}
es: Error al iniciar bisect: {error}
fr: Échec du démarrage de bisect: {error}
it: Impossibile avviare bisect: {error}
ru: Не удалось запустить bisect: {error}
tr: Bisect başlatma başarısız: {error}
zh: 启动二分查找失败: {error}

# markedAs
source: Marked as {status}
ar: تم وضع علامة كـ {status}
de: Markiert als {status}
es: Marcado como {status}
fr: Marqué comme {status}
it: Contrassegnato come {status}
ru: Отмечено как {status}
tr: {type} olarak işaretlendi
zh: 已标记为

# failedToMarkCommit
source: Failed to mark commit: {error}
ar: فشل وضع علامة على التثبيت
de: Fehler beim Markieren des Commits: {error}
es: Error al marcar commit como {status}: {error}
fr: Échec du marquage du commit: {error}
it: Impossibile contrassegnare il commit: {error}
ru: Не удалось отметить коммит: {error}
tr: Commit işaretleme başarısız: {error}
zh: 标记提交失败: {error}

source: Bisect reset
ar: تمت إعادة تعيين التقسيم الثنائي
de: Bisect zurückgesetzt
es: Bisect reiniciado
fr: Bisect réinitialisé
it: Bisect ripristinato
ru: Bisect сброшен
tr: Bisect sıfırlandı
zh: 二分查找已重置

# failedToResetBisect
source: Failed to reset bisect: {error}
ar: فشلت إعادة تعيين التقسيم الثنائي
de: Fehler beim Zurücksetzen von Bisect: {error}
es: Error al reiniciar bisect: {error}
fr: Échec de la réinitialisation de bisect: {error}
it: Impossibile ripristinare bisect: {error}
ru: Не удалось сбросить bisect: {error}
tr: Bisect sıfırlama başarısız: {error}
zh: 重置二分查找失败: {error}

source: Reset
ar: إعادة تعيين
de: Zurücksetzen
fr: Réinitialiser
it: Ripristina
ru: Сбросить
tr: Sıfırla
zh: 重置

source: Configure Diff/Merge Tools
ar: تكوين أدوات Diff وMerge
de: Diff-/Merge-Tools konfigurieren
es: Configurar herramientas de diff/merge
fr: Configurer les outils de diff/fusion
it: Configura Strumenti Diff/Merge
ru: Настроить инструменты сравнения/слияния
tr: Diff/Merge Araçlarını Yapılandır
zh: 配置差异/合并工具

source: No Diff Tools Found
ar: لم يتم العثور على أدوات diff
de: Keine Diff-Tools gefunden
es: No se encontraron herramientas de diff
fr: Aucun outil de diff trouvé
it: Nessuno Strumento Diff Trovato
ru: Инструменты сравнения не найдены
tr: Diff Aracı Bulunamadı
zh: 未找到差异工具

# noExternalDiffMergeToolsDetected
source: No external diff/merge tools were detected on your system.
ar: لم يتم اكتشاف أدوات diff أو merge خارجية
de: Keine externen Diff-/Merge-Tools auf Ihrem System erkannt.
es: No se detectaron herramientas externas de diff/merge
fr: Aucun outil externe de diff/fusion n'a été détecté sur votre système.
it: Nessuno strumento diff/merge esterno è stato rilevato nel tuo sistema.
ru: Внешние инструменты сравнения/слияния не обнаружены в вашей системе.
tr: Harici diff/merge aracı tespit edilmedi
zh: 未检测到外部差异/合并工具

# installToolsSuchAs
source: Install tools like VS Code, Beyond Compare, KDiff3, or Meld.
ar: قم بتثبيت أدوات مثل KDiff3 أو Meld أو Beyond Compare
de: Installieren Sie Tools wie VS Code, Beyond Compare, KDiff3 oder Meld.
es: Instale herramientas como
fr: Installez des outils comme VS Code, Beyond Compare, KDiff3 ou Meld.
it: Installa strumenti come VS Code, Beyond Compare, KDiff3 o Meld.
ru: Установите инструменты, такие как VS Code, Beyond Compare, KDiff3 или Meld.
tr: Şu gibi araçlar yükleyin
zh: 安装工具如:

source: Error Detecting Tools
ar: خطأ في اكتشاف الأدوات
de: Fehler beim Erkennen der Tools
es: Error al detectar herramientas
fr: Erreur lors de la détection des outils
it: Errore nel Rilevamento degli Strumenti
ru: Ошибка обнаружения инструментов
tr: Araçlar tespit edilirken hata
zh: 检测工具时出错

# configureYourPreferredTools
source: Configure your preferred tools for comparing and merging files. {toolCount} tools detected.
ar: قم بتكوين أدواتك المفضلة لمقارنة الملفات وحل التعارضات
de: Konfigurieren Sie Ihre bevorzugten Tools zum Vergleichen und Mergen von Dateien
es: Configure sus herramientas preferidas
fr: Configurez vos outils préférés pour comparer et fusionner des fichiers. {toolCount} outils détectés.
it: Configura i tuoi strumenti preferiti per confrontare e unire i file
ru: Настройте предпочитаемые инструменты для сравнения и слияния файлов. Обнаружено инструментов: {toolCount}.
tr: Tercih ettiğiniz araçları yapılandırın
zh: 配置您首选的工具

source: Diff Tool
ar: أداة Diff
es: Herramienta de diff
fr: Outil de différence
it: Strumento Diff
ru: Инструмент сравнения
tr: Diff Aracı
zh: 差异工具

source: Used for comparing file changes
ar: تستخدم لمقارنة تغييرات الملفات
de: Wird zum Vergleichen von Dateiänderungen verwendet
es: Se usa para comparar cambios de archivos
fr: Utilisé pour comparer les modifications de fichiers
it: Usato per confrontare le modifiche ai file
ru: Используется для сравнения изменений в файлах
tr: Dosya değişikliklerini karşılaştırmak için kullanılır
zh: 用于比较文件更改

source: Merge Tool
ar: أداة Merge
es: Herramienta de merge
fr: Outil de fusion
it: Strumento Merge
ru: Инструмент слияния
tr: Birleştirme Aracı
zh: 合并工具

source: Used for resolving merge conflicts
ar: تستخدم لحل تعارضات الدمج
de: Wird zum Auflösen von Merge-Konflikten verwendet
es: Se usa para resolver conflictos de merge
fr: Utilisé pour résoudre les conflits de fusion
it: Usato per risolvere i conflitti di merge
ru: Используется для разрешения конфликтов слияния
tr: Birleştirme çakışmalarını çözmek için kullanılır
zh: 用于解决合并冲突

source: Available
ar: متاح
de: Verfügbar
es: Disponible
fr: Disponible
it: Disponibile
ru: Доступно
tr: Mevcut
zh: 可用

source: Diff/merge tool settings saved
ar: تم حفظ إعدادات أدوات Diff وMerge
de: Diff-/Merge-Tool-Einstellungen gespeichert
es: Configuración de herramientas guardada
fr: Paramètres des outils de diff/fusion sauvegardés
it: Impostazioni strumenti diff/merge salvate
ru: Настройки инструментов сравнения/слияния сохранены
tr: Diff/Merge araç ayarları kaydedildi
zh: 差异/合并工具设置已保存

source: Amend
ar: تعديل
de: Ändern
es: Modificar
fr: Modifier
ru: Исправить
tr: Düzenle
zh: 修正

source: Discard All
ar: تجاهل الكل
de: Alle verwerfen
es: Descartar todo
fr: Tout abandonner
it: Scarta Tutti
ru: Отменить всё
tr: Tümünü At
zh: 全部丢弃

source: Clean
ar: تنظيف
de: Bereinigen
es: Limpiar
fr: Nettoyer
ru: Очистить
tr: Temizle
zh: 清理

# commandCategoryRepository
source: Repository
ar: المستودع
es: Repositorio
fr: Dépôt
ru: Репозиторий
tr: Depo
zh: 仓库

# commandCategoryChanges
source: Changes & Commits
ar: التغييرات
de: Änderungen & Commits
es: Cambios
fr: Modifications & Commits
ru: Изменения и коммиты
tr: Değişiklikler ve Commit'ler
zh: 更改和提交

# commandCategoryHistory
source: History & Diffs
ar: السجل
de: Verlauf & Diffs
es: Historial
fr: Historique & Différences
ru: История и различия
tr: Geçmiş
zh: 历史和差异

# commandCategoryBranches
source: Branches
ar: الفروع
es: Ramas
ru: Ветки
tr: Dallar
zh: 分支

# commandCategoryRemotes
source: Remotes
ar: البعيدة
es: Remotos
fr: Distants
ru: Удалённые
tr: Uzaklar
zh: 远程

# commandCategoryStashes
source: Stashes
ar: المخزون
ru: Stash
tr: Stash'ler
zh: 储藏

# commandCategoryTags
source: Tags
ar: الوسوم
es: Etiquetas
ru: Теги
tr: Etiketler
zh: 标签
