Repository: kartalbas/flutter-gitui
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# fontSizeSmall
source: Small
ar: صغير
de: Klein
es: Pequeño
fr: Petite
ru: Маленький
tr: Küçük
zh: 小

# fontSizeMedium
source: Medium
ar: متوسط
de: Mittel
es: Mediano
fr: Moyenne
ru: Средний
tr: Orta
zh: 中

# fontSizeLarge
source: Large
ar: كبير
de: Groß
es: Grande
fr: Grande
ru: Большой
tr: Büyük
zh: 大

source: Git Configuration
ar: تكوين Git
de: Git-Konfiguration
es: Configuración de Git
fr: Configuration Git
ru: Конфигурация Git
tr: Git Yapılandırması
zh: Git 配置

source: Git Executable Path
ar: مسار ملف Git التنفيذي
de: Git-Executable-Pfad
es: Ruta del ejecutable de Git
fr: Chemin de l'exécutable Git
ru: Путь к исполняемому файлу Git
tr: Git Çalıştırılabilir Yolu
zh: Git 可执行文件路径

# gitExecutableNotSet
source: Not set - Please select git.exe manually
ar: لم يتم تعيين ملف Git التنفيذي
de: Nicht festgelegt - Bitte git.exe manuell auswählen
es: Ejecutable de Git no configurado
fr: Non défini - Utilisation de 'git' dans PATH
ru: Не задан - Пожалуйста, выберите git.exe вручную
tr: Ayarlanmamış (sistem yolunu kullan)
zh: Git 可执行文件未设置

# gitVersion
source: Git version: {version}
ar: إصدار Git
de: Git-Version
es: Versión de Git
fr: Version Git
it: Versione Git
ru: Версия Git: {version}
tr: Git Sürümü
zh: Git 版本

source: Git executable cleared
ar: تم مسح ملف Git التنفيذي
de: Git-Executable gelöscht
es: Ejecutable de Git limpiado
fr: Exécutable Git effacé
ru: Исполняемый файл Git очищен
tr: Git çalıştırılabilir temizlendi
zh: Git 可执行文件已清除

source: Preferred Text Editor
ar: محرر النصوص المفضل
de: Bevorzugter Texteditor
es: Editor de texto preferido
fr: Éditeur de texte préféré
ru: Предпочитаемый текстовый редактор
tr: Tercih Edilen Metin Editörü
zh: 首选文本编辑器

# textEditorNotSet
source: Not set - Please select text editor manually
ar: لم يتم تعيين محرر النصوص
de: Nicht festgelegt - Bitte Texteditor manuell auswählen
es: Editor de texto no configurado
fr: Non défini - Aucun éditeur configuré
ru: Не задан - Пожалуйста, выберите текстовый редактор вручную
tr: Ayarlanmamış
zh: 文本编辑器未设置

# version
source: Version: {version}
ar: الإصدار
de: Version
es: Versión
fr: Version
it: Versione
ru: Версия: {version}
tr: Sürüm
zh: 版本

source: Text editor cleared
ar: تم مسح محرر النصوص
de: Texteditor gelöscht
es: Editor de texto limpiado
fr: Éditeur de texte effacé
ru: Текстовый редактор очищен
tr: Metin editörü temizlendi
zh: 文本编辑器已清除

source: Search Tools (Auto-detect)
ar: أدوات البحث (الكشف التلقائي)
de: Suchwerkzeuge (Automatische Erkennung)
es: Herramientas de búsqueda (Detección automática)
fr: Outils de recherche (Détection automatique)
it: Strumenti di ricerca (Rilevamento automatico)
ru: Инструменты поиска (Автоопределение)
tr: Arama Araçları (Otomatik Algılama)
zh: 搜索工具（自动检测）

# diffToolTitle
source: Diff Tool
ar: أداة المقارنة
de: Diff-Werkzeug
es: Herramienta de diferencias
fr: Outil de différences
it: Strumento di confronto
ru: Инструмент сравнения
tr: Karşılaştırma Aracı
zh: 差异工具

# diffToolNotSet
source: Not set - Please select diff tool manually
ar: لم يتم تعيين أداة Diff
de: Nicht festgelegt - Bitte Diff-Tool manuell auswählen
es: Herramienta de diff no configurada
fr: Non défini - Veuillez sélectionner un outil de diff manuellement
ru: Не задан
tr: Ayarlanmamış
zh: 差异工具未设置

source: Diff tool cleared
ar: تم مسح أداة Diff
de: Diff-Tool gelöscht
es: Herramienta de diff limpiada
fr: Outil de diff effacé
ru: Инструмент сравнения очищен
tr: Diff aracı temizlendi
zh: 差异工具已清除

# mergeToolTitle
source: Merge Tool
ar: أداة الدمج
de: Merge-Werkzeug
es: Herramienta de fusión
fr: Outil de fusion
it: Strumento di unione
ru: Инструмент слияния
tr: Birleştirme Aracı
zh: 合并工具

# mergeToolNotSet
source: Not set - Please select merge tool manually
ar: لم يتم تعيين أداة Merge
de: Nicht festgelegt - Bitte Merge-Tool manuell auswählen
es: Herramienta de merge no configurada
fr: Non défini - Veuillez sélectionner un outil de fusion manuellement
ru: Не задан
tr: Ayarlanmamış
zh: 合并工具未设置

source: Merge tool cleared
ar: تم مسح أداة Merge
de: Merge-Tool gelöscht
es: Herramienta de merge limpiada
fr: Outil de fusion effacé
ru: Инструмент слияния очищен
tr: Merge aracı temizlendi
zh: 合并工具已清除

source: Configure
ar: تكوين
de: Konfigurieren
es: Configurar
fr: Configurer
it: Configura
ru: Настроить
tr: Yapılandır
zh: 配置

source: Edit
ar: تعديل
de: Bearbeiten
es: Editar
fr: Modifier
it: Modifica
ru: Редактировать
tr: Düzenle
zh: 编辑

# userNameNotSet
source: Not set - Please enter your name
ar: لم يتم تعيين اسم المستخدم
de: Nicht festgelegt - Bitte geben Sie Ihren Namen ein
es: Nombre de usuario no configurado
fr: Non défini - Aucun nom par défaut
ru: Не задано - Пожалуйста, введите ваше имя
tr: Ayarlanmamış
zh: 用户名未设置

# userEmailNotSet
source: Not set - Please enter your email
ar: لم يتم تعيين البريد الإلكتروني
de: Nicht festgelegt - Bitte geben Sie Ihre E-Mail ein
es: Email de usuario no configurado
fr: Non défini - Aucun email par défaut
ru: Не задан - Пожалуйста, введите ваш email
tr: Ayarlanmamış
zh: 用户邮箱未设置

source: Appearance
ar: المظهر
de: Erscheinungsbild
es: Apariencia
fr: Apparence
it: Aspetto
ru: Внешний вид
tr: Görünüm
zh: 外观

source: Color Scheme
ar: نظام الألوان
de: Farbschema
es: Esquema de colores
fr: Schéma de couleurs
it: Schema Colori
ru: Цветовая схема
tr: Renk Şeması
zh: 配色方案

# fontFamily
source: App Font
ar: عائلة الخط
de: Schriftfamilie
es: Familia de fuente
fr: Famille de police
it: Famiglia Font
ru: Семейство шрифтов
tr: Font Ailesi
zh: 字体系列

source: Color scheme updated
ar: تم تحديث نظام الألوان
de: Farbschema aktualisiert
es: Esquema de colores actualizado
fr: Schéma de couleurs mis à jour
ru: Цветовая схема обновлена
tr: Renk şeması güncellendi
zh: 配色方案已更新

# fontChangedTo
source: Font changed to {fontName}
ar: تم تغيير الخط إلى {fontFamily}
de: Schriftart geändert zu {fontName}
es: Fuente cambiada a {font}
fr: Police changée en {fontFamily}
ru: Шрифт изменён на {fontName}
tr: Font {fontFamily} olarak değiştirildi
zh: 字体已更改为 {fontFamily}

source: Font Size
ar: حجم الخط
de: Schriftgröße
es: Tamaño de fuente
fr: Taille de police
it: Dimensione Font
ru: Размер шрифта
tr: Font Boyutu
zh: 字体大小

source: Font size updated
ar: تم تحديث حجم الخط
de: Schriftgröße aktualisiert
es: Tamaño de fuente actualizado
fr: Taille de police mise à jour
ru: Размер шрифта обновлён
tr: Font boyutu {size} olarak güncellendi
zh: 字体大小已更新

# diffAndMergeTools
source: Diff & Merge Tools
ar: أدوات Diff وMerge
es: Herramientas de diff y merge
fr: Outils de diff et fusion
ru: Инструменты сравнения и слияния
tr: Diff ve Merge Araçları
zh: 差异和合并工具

source: Preferred Diff Tool
ar: أداة Diff المفضلة
de: Bevorzugtes Diff-Tool
es: Herramienta de diff preferida
fr: Outil de diff préféré
ru: Предпочитаемый инструмент сравнения
tr: Tercih Edilen Diff Aracı
zh: 首选差异工具

source: Browse for diff tool
ar: تصفح لأداة Diff
de: Nach Diff-Tool suchen
es: Buscar herramienta de diff
fr: Parcourir pour l'outil de différence
ru: Выбрать инструмент сравнения
tr: Diff aracı için göz at
zh: 浏览差异工具

source: Preferred Merge Tool
ar: أداة Merge المفضلة
de: Bevorzugtes Merge-Tool
es: Herramienta de merge preferida
fr: Outil de fusion préféré
ru: Предпочитаемый инструмент слияния
tr: Tercih Edilen Merge Aracı
zh: 首选合并工具

source: Browse for merge tool
ar: تصفح لأداة Merge
de: Nach Merge-Tool suchen
es: Buscar herramienta de merge
fr: Parcourir pour l'outil de fusion
ru: Выбрать инструмент слияния
tr: Birleştirme aracı için göz at
zh: 浏览合并工具

source: Loading available tools...
ar: جارٍ تحميل الأدوات المتاحة...
de: Verfügbare Tools werden geladen...
es: Cargando herramientas disponibles
fr: Chargement des outils disponibles...
ru: Загрузка доступных инструментов...
tr: Mevcut araçlar yükleniyor...
zh: 正在加载可用工具...

source: Failed to load tools
ar: فشل تحميل الأدوات
de: Fehler beim Laden der Tools
es: Error al cargar herramientas
fr: Échec du chargement des outils: {error}
ru: Не удалось загрузить инструменты
tr: Araçlar yüklenemedi: {error}
zh: 加载工具失败

source: Behavior
ar: السلوك
de: Verhalten
es: Comportamiento
fr: Comportement
ru: Поведение
tr: Davranış
zh: 行为

source: Auto Fetch
ar: الجلب التلقائي
de: Automatischer Fetch
es: Obtención automática
fr: Récupération automatique
ru: Автоматическая загрузка
tr: Otomatik Getirme
zh: 自动获取

# autoFetchDescription
source: Automatically fetch from remote periodically
ar: جلب التغييرات من المستودعات البعيدة تلقائيًا
de: Automatisch regelmäßig vom Remote abrufen
es: Obtener automáticamente cambios de remotos
fr: Récupérer automatiquement depuis le distant périodiquement
ru: Автоматически загружать из удалённого репозитория периодически
tr: Periyodik olarak uzaktan otomatik getirme yap
zh: 定期自动从远程获取

# autoFetchIntervalMinutes
source: {minutes} minutes
ar: {minutes} دقيقة
de: {minutes} Minuten
es: {minutes} minutos
ru: {minutes} минут
tr: {minutes} dakika
zh: {minutes} 分钟

source: Confirm Push
ar: تأكيد الدفع
de: Push bestätigen
es: ¿Confirmar push?
fr: Confirmer le push
ru: Подтвердить отправку
tr: Push'u Onayla
zh: 推送前确认

# confirmPushDescription
source: Show confirmation before pushing
ar: طلب التأكيد قبل دفع التغييرات
de: Bestätigung vor dem Pushen anzeigen
es: Esto enviará sus commits locales al remoto
fr: Afficher une confirmation avant le push
ru: Показывать подтверждение перед отправкой
tr: Push yapmadan önce onay iste
zh: 推送更改到远程前显示确认对话框

source: Confirm Force Push
ar: تأكيد فرض الدفع
de: Force Push bestätigen
es: ¿Confirmar force push?
fr: Confirmer le push forcé
ru: Подтвердить принудительную отправку
tr: Zorla push'u onayla
zh: 强制推送前确认

# confirmForcePushDescription
source: Show confirmation before force pushing
ar: طلب التأكيد قبل فرض دفع التغييرات
de: Bestätigung vor dem Force Push anzeigen
es: El force push sobrescribirá el historial remoto
fr: Afficher une confirmation avant le push forcé
ru: Показывать подтверждение перед принудительной отправкой
tr: Zorla push yapmadan önce onay iste
zh: 强制推送前显示警告对话框

source: Confirm Delete
ar: تأكيد الحذف
de: Löschen bestätigen
es: ¿Confirmar eliminación?
fr: Confirmer la suppression
ru: Подтвердить удаление
tr: Silmeyi Onayla
zh: 确认删除

# confirmDeleteDescription
source: Show confirmation before deleting branches
ar: طلب التأكيد قبل حذف الفروع أو الوسوم
de: Bestätigung vor dem Löschen von Branches anzeigen
es: Esta acción no se puede deshacer
fr: Afficher une confirmation avant de supprimer des branches
ru: Показывать подтверждение перед удалением веток
tr: Dalları veya etiketleri silmeden önce onay iste
zh: 删除前确认

# defaultCommitLimitDescription
source: Load {count} commits by default
ar: تحميل {count} تثبيتات بشكل افتراضي
de: Standardmäßig {count} Commits laden
es: Cargar {count} commits por defecto
fr: Charger {count} commits par défaut
ru: Загружать {count} коммитов по умолчанию
tr: Varsayılan olarak {count} commit yükle
zh: 默认加载 {count} 个提交

source: Show Commit Graph
ar: إظهار رسم التثبيت
de: Commit-Graph anzeigen
es: Mostrar gráfico de commits
fr: Afficher le graphe des commits
ru: Показывать граф коммитов
tr: Commit Grafiğini Göster
zh: 显示提交图

# showCommitGraphDescription
source: Display visual branch graph in history
ar: إظهار رسم بياني مرئي لسجل التثبيت
de: Visuellen Branch-Graph im Verlauf anzeigen
es: Visualizar gráfico de commits en historial
fr: Afficher une représentation visuelle de l'historique des commits
ru: Отображать визуальный граф веток в истории
tr: Geçmiş ekranında görsel commit grafiği göster
zh: 在历史中显示可视化提交图

source: Show password
ar: إظهار كلمة المرور
de: Passwort anzeigen
es: Mostrar contraseña
fr: Afficher le mot de passe
ru: Показать пароль
tr: Parolayı Göster
zh: 显示密码

source: Hide password
ar: إخفاء كلمة المرور
de: Passwort verbergen
es: Ocultar contraseña
fr: Masquer le mot de passe
ru: Скрыть пароль
tr: Parolayı Gizle
zh: 隐藏密码

source: Clear log
ar: مسح السجل
de: Log löschen
es: Limpiar registro
fr: Effacer le journal
ru: Очистить журнал
tr: Günlüğü temizle
zh: 清除日志

source: Command copied to clipboard
ar: تم نسخ الأمر إلى الحافظة
de: Befehl in Zwischenablage kopiert
es: Comando copiado al portapapeles
fr: Commande copiée dans le presse-papier
ru: Команда скопирована в буфер обмена
tr: Komut panoya kopyalandı
zh: 命令已复制到剪贴板

source: Confirm
ar: تأكيد
de: Bestätigen
es: Confirmar
fr: Confirmer
ru: Подтвердить
tr: Onayla
zh: 确认

source: Operation completed successfully
ar: اكتملت العملية بنجاح
de: Operation erfolgreich abgeschlossen
es: Operación completada correctamente
fr: Opération terminée avec succès
ru: Операция успешно завершена
tr: İşlem başarıyla tamamlandı
zh: 操作成功完成

source: Text Editor
ar: محرر النصوص
es: Editor de texto
fr: Éditeur de texte
ru: Текстовый редактор
tr: Metin Editörü
zh: 文本编辑器

source: User Email
ar: البريد الإلكتروني للمستخدم
de: Benutzer-E-Mail
es: Email de usuario
fr: Email utilisateur
it: Email Utente
ru: Email пользователя
tr: Kullanıcı E-postası
zh: 用户邮箱

# windowsReservedNameError
source: The file "{filePath}" contains a Windows reserved name "{reservedName}". Windows does not allow files named: {reservedNames}. This file was likely created on Linux/Unix and cannot be staged on Windows. Solutions: Use WSL or Linux to remove/rename the file Use git from Git Bash with: git rm "{filePath}" Skip this file and stage others individually
ar: اسم محجوز في Windows
de: Die Datei "{filePath}" enthält einen für Windows reservierten Namen "{reservedName}"
es: Nombre reservado de Windows
fr: Nom réservé Windows
it: The file "{filePath}" contains a Windows reserved name "{reservedName}".\n\nWindows does not allow files named: {reservedNames}.\n\nThis file was likely created on Linux/Unix and cannot be staged on Windows.\n\nSolutions:\n• Use WSL or Linux to remove/rename the file\n• Use git from Git Bash with: git rm "{filePath}"\n• Skip this file and stage others individually
ru: Файл "{filePath}" содержит зарезервированное имя Windows "{reservedName}". Windows не разрешает файлы с именами: {reservedNames}. Этот файл, вероятно, был создан в Linux/Unix и не может быть проиндексирован в Windows. Решения: • Используйте WSL или Linux для удаления/переименования файла • Используйте git из Git Bash с командой: git rm "{filePath}" • Пропустите этот файл и проиндексируйте другие по отдельности
tr: Windows ayrılmış adı (CON, PRN, AUX, NUL, COM1-9, LPT1-9)
zh: 文件 "{filePath}" 包含 Windows 保留名称 "{reservedName}"。 Windows 不允许使用以下文件名: {reservedNames}。 此文件可能是在 Linux/Unix 上创建的,无法在 Windows 上暂存。 解决方案: • 使用 WSL 或 Linux 删除/重命名文件 • 使用 Git Bash 中的 git: git rm "{filePath}" • 跳过此文件并单独暂存其他文件

# invalidWindowsFilename
source: Invalid Windows filename: {filePath}
ar: اسم ملف Windows غير صالح
de: Ungültiger Windows-Dateiname: {filePath}
es: Nombre de archivo de Windows no válido
fr: Nom de fichier Windows invalide
ru: Недопустимое имя файла Windows: {filePath}
tr: Geçersiz Windows dosya adı
zh: 无效的 Windows 文件名: {filePath}

# secondsAgo
source: {count, plural, =1{1 second ago} other{{count} seconds ago}}
ar: {count, plural, =1{منذ ثانية واحدة} other{منذ {count} ثانية}}
de: {count, plural, =1{vor 1 Sekunde} other{vor {count} Sekunden}}
es: {count, plural, =1{hace 1 segundo} other{hace {count} segundos}}
fr: {count, plural, =1{il y a 1 seconde} other{il y a {count} secondes}}
it: {count, plural, =1{1 secondo fa} other{{count} secondi fa}}
ru: {count, plural, =1{1 секунду назад} few{{count} секунды назад} other{{count} секунд назад}}
tr: {count, plural, =1{1 saniye önce} other{{count} saniye önce}}
zh: {count, plural, =1{1 秒前} other{{count} 秒前}}

# minuteAgo
source: 1 minute ago
ar: منذ دقيقة واحدة
de: vor 1 Minute
es: hace 1 minuto
fr: il y a 1 minute
it: 1 minuto fa
ru: 1 минуту назад
tr: 1 dakika önce
zh: 1 分钟前

# minutesAgo
source: {count} minutes ago
ar: منذ {count} دقيقة
de: vor {count} Minuten
es: hace {count} minutos
fr: il y a {count} minutes
it: {count} minuti fa
ru: {count} минут назад
tr: {count} dakika önce
zh: {count} 分钟前

# hourAgo
source: 1 hour ago
ar: منذ ساعة واحدة
de: vor 1 Stunde
es: hace 1 hora
fr: il y a 1 heure
it: 1 ora fa
ru: 1 час назад
tr: 1 saat önce
zh: 1 小时前

# hoursAgo
source: {count} hours ago
ar: منذ {count} ساعة
de: vor {count} Stunden
es: hace {count} horas
fr: il y a {count} heures
it: {count} ore fa
ru: {count} часов назад
tr: {count} saat önce
zh: {count} 小时前

# dayAgo
source: 1 day ago
ar: منذ يوم واحد
de: vor 1 Tag
es: hace 1 día
fr: il y a 1 jour
it: 1 giorno fa
ru: 1 день назад
tr: 1 gün önce
zh: 1 天前

# daysAgo
source: {count} days ago
ar: منذ {count} يوم
de: vor {count} Tagen
es: hace {count} días
fr: il y a {count} jours
it: {count} giorni fa
ru: {count} дней назад
tr: {count} gün önce
zh: {count} 天前

# monthJan
source: Jan
ar: يناير
es: Ene
it: Gen
ru: Янв
tr: Oca
zh: 1月

# monthFeb
source: Feb
ar: فبراير
fr: Fév
ru: Фев
tr: Şub
zh: 2月

# monthMar
source: Mar
ar: مارس
de: Mär
ru: Мар
zh: 3月

# monthApr
source: Apr
ar: أبريل
es: Abr
fr: Avr
ru: Апр
tr: Nis
zh: 4月

# monthMay
source: May
ar: مايو
de: Mai
fr: Mai
it: Mag
ru: Май
zh: 5月

# monthJun
source: Jun
ar: يونيو
fr: Juin
it: Giu
ru: Июн
tr: Haz
zh: 6月

# monthJul
source: Jul
ar: يوليو
fr: Juil
it: Lug
ru: Июл
tr: Tem
zh: 7月

# monthAug
source: Aug
ar: أغسطس
es: Ago
fr: Aoû
it: Ago
ru: Авг
tr: Ağu
zh: 8月

# monthSep
source: Sep
ar: سبتمبر
it: Set
ru: Сен
tr: Eyl
zh: 9月

# monthOct
source: Oct
ar: أكتوبر
de: Okt
it: Ott
ru: Окт
tr: Eki
zh: 10月

# monthNov
source: Nov
ar: نوفمبر
ru: Ноя
tr: Kas
zh: 11月

# monthDec
source: Dec
ar: ديسمبر
de: Dez
es: Dic
fr: Déc
it: Dic
ru: Дек
tr: Ara
zh: 12月

source: AM
ar: ص
tr: ÖÖ
zh: 上午

source: PM
ar: م
tr: ÖS
zh: 下午

source: System Default
ar: افتراضي النظام
de: Systemstandard
es: Por defecto del sistema
fr: Système par défaut
it: Predefinito di Sistema
ru: Системный по умолчанию
tr: Sistem Varsayılanı
zh: 系统默认

source: English
ar: الإنجليزية
de: Englisch
es: Inglés
fr: Anglais
it: Inglese
ru: Английский
tr: İngilizce
zh: 英语

source: Arabic
ar: العربية
de: Arabisch
es: Árabe
fr: Arabe
it: Arabo
ru: Арабский
tr: Arapça
zh: 阿拉伯语

source: German
ar: الألمانية
de: Deutsch
es: Alemán
fr: Allemand
it: Tedesco
ru: Немецкий
tr: Almanca
zh: 德语

source: Spanish
ar: الإسبانية
de: Spanisch
es: Español
fr: Espagnol
it: Spagnolo
ru: Испанский
tr: İspanyolca
zh: 西班牙语

source: French
ar: الفرنسية
de: Französisch
es: Francés
fr: Français
it: Francese
ru: Французский
tr: Fransızca
zh: 法语

source: Italian
ar: الإيطالية
de: Italienisch
es: Italiano
fr: Italien
it: Italiano
ru: Итальянский
tr: İtalyanca
zh: 意大利语

source: Russian
ar: الروسية
de: Russisch
es: Ruso
fr: Russe
it: Russo
ru: Русский
tr: Rusça
zh: 俄语

source: Turkish
ar: التركية
de: Türkisch
es: Turco
fr: Turc
it: Turco
ru: Турецкий
tr: Türkçe
zh: 土耳其语

# chinese
source: Chinese (Simplified)
ar: الصينية (المبسطة)
de: Chinesisch (vereinfacht)
es: Chino (Simplificado)
fr: Chinois (Simplifié)
it: Cinese (Semplificato)
ru: Китайский (Упрощенный)
tr: Çince (Basitleştirilmiş)
zh: 中文（简体）

source: Language updated
ar: تم تحديث اللغة
de: Sprache aktualisiert
es: Idioma actualizado
fr: Langue mise à jour
it: Lingua aggiornata
ru: Язык обновлён
tr: Dil güncellendi
zh: 语言已更新

# tooltipLanguage
source: Language
ar: اللغة
de: Sprache
es: Idioma
fr: Langue
it: Lingua
ru: Язык
tr: Dil
zh: 语言

# tooltipQuickSettings
source: Quick Settings
ar: الإعدادات السريعة
de: Schnelleinstellungen
es: Configuración Rápida
fr: Paramètres Rapides
it: Impostazioni Rapide
ru: Быстрые настройки
tr: Hızlı Ayarlar
zh: 快速设置

# tooltipCopyCommand
source: Copy command
ar: نسخ الأمر
de: Befehl kopieren
es: Copiar comando
fr: Copier la commande
it: Copia comando
ru: Скопировать команду
tr: Komutu kopyala
zh: 复制命令

# tooltipCopyToClipboard
source: Copy to clipboard
ar: نسخ إلى الحافظة
de: In Zwischenablage kopieren
es: Copiar al portapapeles
fr: Copier dans le presse-papiers
it: Copia negli appunti
ru: Скопировать в буфер обмена
tr: Panoya kopyala
zh: 复制到剪贴板

# tooltipNewWorkspace
source: New Workspace
ar: مساحة عمل جديدة
de: Neuer Arbeitsbereich
es: Nuevo Espacio de Trabajo
fr: Nouvel Espace de Travail
it: Nuova Area di Lavoro
ru: Новая рабочая область
tr: Yeni Çalışma Alanı
zh: 新建工作区

# tooltipBlameStatistics
source: Blame Statistics
ar: إحصائيات المسؤولية
de: Blame-Statistiken
es: Estadísticas de Blame
fr: Statistiques Blame
it: Statistiche Blame
ru: Статистика авторства
tr: Blame İstatistikleri
zh: 追溯统计

# tooltipOpenEnhancedViewer
source: Open in Enhanced Viewer
ar: فتح في العارض المحسّن
de: Im erweiterten Viewer öffnen
es: Abrir en Visor Mejorado
fr: Ouvrir dans le Visualiseur Amélioré
it: Apri nel Visualizzatore Avanzato
ru: Открыть в расширенном просмотрщике
tr: Gelişmiş Görüntüleyicide Aç
zh: 在增强查看器中打开

# tooltipPreviousPage
source: Previous page
ar: الصفحة السابقة
de: Vorherige Seite
es: Página anterior
fr: Page précédente
it: Pagina precedente
ru: Предыдущая страница
tr: Önceki sayfa
zh: 上一页

# tooltipNextPage
source: Next page
ar: الصفحة التالية
de: Nächste Seite
es: Página siguiente
fr: Page suivante
it: Pagina successiva
ru: Следующая страница
tr: Sonraki sayfa
zh: 下一页

# tooltipDiscardAllChanges
source: Discard All Changes
ar: تجاهل جميع التغييرات
de: Alle Änderungen verwerfen
es: Descartar Todos los Cambios
fr: Abandonner Toutes les Modifications
it: Scarta Tutte le Modifiche
ru: Отменить все изменения
tr: Tüm Değişiklikleri At
zh: 丢弃所有更改

# tooltipViewDiff
source: View Diff
ar: عرض الفروقات
de: Unterschiede anzeigen
es: Ver Diferencias
fr: Voir les Différences
it: Visualizza Differenze
ru: Показать различия
tr: Farkı Görüntüle
zh: 查看差异

# tooltipUnstage
source: Unstage
ar: إزالة من التجهيز
de: Unstagen
es: Quitar del Área de Preparación
fr: Retirer de l'Index
it: Rimuovi dalla Staging
ru: Убрать из индекса
tr: Hazırlıktan Çıkar
zh: 取消暂存

# tooltipStage
source: Stage
ar: إضافة للتجهيز
de: Stagen
es: Agregar al Área de Preparación
fr: Ajouter à l'Index
it: Aggiungi alla Staging
ru: Добавить в индекс
tr: Hazırla
zh: 暂存

# tooltipDiscardChanges
source: Discard Changes
ar: تجاهل التغييرات
de: Änderungen verwerfen
es: Descartar Cambios
fr: Abandonner les Modifications
it: Scarta Modifiche
ru: Отменить изменения
tr: Değişiklikleri At
zh: 丢弃更改

# tooltipFileActions
source: File actions
ar: إجراءات الملف
de: Dateiaktionen
es: Acciones de archivo
fr: Actions de fichier
it: Azioni File
ru: Действия с файлом
tr: Dosya işlemleri
zh: 文件操作

# tooltipAbortMerge
source: Abort Merge
ar: إلغاء الدمج
de: Zusammenführung abbrechen
es: Cancelar Fusión
fr: Annuler la Fusion
it: Interrompi Unione
ru: Прервать слияние
tr: Birleştirmeyi İptal Et
zh: 中止合并

# tooltipCopy
source: Copy
ar: نسخ
de: Kopieren
es: Copiar
fr: Copier
it: Copia
ru: Копировать
tr: Kopyala
zh: 复制

# tooltipAddRepository
source: Add Repository
ar: إضافة مستودع
de: Repository hinzufügen
es: Agregar Repositorio
fr: Ajouter un Dépôt
it: Aggiungi Repository
ru: Добавить репозиторий
tr: Depo Ekle
zh: 添加仓库

# tooltipMoreActions
source: More Actions
ar: المزيد من الإجراءات
de: Weitere Aktionen
es: Más Acciones
fr: Plus d'Actions
it: Altre Azioni
ru: Дополнительные действия
tr: Daha Fazla İşlem
zh: 更多操作

# tooltipRemoveFromWorkspace
source: Remove from workspace
ar: إزالة من مساحة العمل
de: Aus Arbeitsbereich entfernen
es: Eliminar del espacio de trabajo
fr: Retirer de l'espace de travail
it: Rimuovi dall'area di lavoro
ru: Удалить из рабочей области
tr: Çalışma alanından kaldır
zh: 从工作区移除

# tooltipRemoveFromFavorites
source: Remove from favorites
ar: إزالة من المفضلة
de: Aus Favoriten entfernen
es: Eliminar de favoritos
fr: Retirer des favoris
it: Rimuovi dai preferiti
ru: Удалить из избранного
tr: Favorilerden kaldır
zh: 从收藏夹移除

# tooltipAddToFavorites
source: Add to favorites
ar: إضافة إلى المفضلة
de: Zu Favoriten hinzufügen
es: Agregar a favoritos
fr: Ajouter aux favoris
it: Aggiungi ai preferiti
ru: Добавить в избранное
tr: Favorilere ekle
zh: 添加到收藏夹
