Repository: kartalbas/flutter-gitui
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# dialogContentStageAllAndCommit
source: You have {count} unstaged file{plural}. All unstaged changes will be staged before creating the commit. Do you want to continue?
ar: لديك {count} ملف غير مُجهز{plural}. سيتم تجهيز جميع التغييرات غير المُجهزة قبل إنشاء الالتزام. هل تريد المتابعة؟
de: Sie haben {count} nicht bereitgestellte Datei{plural}. Alle nicht bereitgestellten Änderungen werden vor dem Erstellen des Commits bereitgestellt. Möchten Sie fortfahren?
es: Tiene {count} archivo{plural} sin preparar. Todos los cambios sin preparar serán preparados antes de crear el commit. ¿Desea continuar?
fr: Vous avez {count} fichier{plural} non préparé{plural}. Toutes les modifications non préparées seront préparées avant de créer le commit. Voulez-vous continuer ?
it: Hai {count} file{plural} non preparato{plural}. Tutte le modifiche non preparate verranno preparate prima di creare il commit. Vuoi continuare?
ru: У вас {count} не подготовленный файл{plural}. Все не подготовленные изменения будут подготовлены перед созданием коммита. Вы хотите продолжить?
tr: {count} hazırlanmamış dosyanız{plural} var. Kayıt oluşturulmadan önce tüm hazırlanmamış değişiklikler hazırlanacaktır. Devam etmek istiyor musunuz?
zh: 您有 {count} 个未暂存文件{plural}。 所有未暂存的更改将在创建提交之前被暂存。 您要继续吗？

# dialogContentDiscardChangesFile
source: Discard changes in {filePath}? This cannot be undone.
ar: تجاهل التغييرات في {filePath}؟ لا يمكن التراجع عن هذا.
de: Änderungen in {filePath} verwerfen? Dies kann nicht rückgängig gemacht werden.
es: ¿Descartar cambios en {filePath}? Esto no se puede deshacer.
fr: Annuler les modifications dans {filePath} ? Cela ne peut pas être annulé.
it: Scartare le modifiche in {filePath}? Questa azione non può essere annullata.
ru: Отменить изменения в {filePath}? Это нельзя отменить.
tr: {filePath} içindeki değişiklikler iptal edilsin mi? Bu geri alınamaz.
zh: 放弃 {filePath} 中的更改？ 这无法撤消。

# dialogTitleWindowsReservedFilename
source: Windows Reserved Filename
ar: اسم ملف محجوز في Windows
de: Windows-reservierter Dateiname
es: Nombre de archivo reservado de Windows
fr: Nom de fichier réservé Windows
it: Nome file riservato Windows
ru: Зарезервированное имя файла Windows
tr: Windows Ayrılmış Dosya Adı
zh: Windows 保留文件名

# dialogContentStageAllFiles
source: Stage all {count} unstaged file{plural}?
ar: تجهيز جميع {count} ملف غير مُجهز{plural}؟
de: Alle {count} nicht bereitgestellte Datei{plural} bereitstellen?
es: ¿Preparar todos los {count} archivo{plural} sin preparar?
fr: Préparer tous les {count} fichier{plural} non préparé{plural} ?
it: Preparare tutti i {count} file{plural} non preparato{plural}?
ru: Подготовить все {count} не подготовленный файл{plural}?
tr: Tüm {count} hazırlanmamış dosya{plural} hazırlansın mı?
zh: 暂存所有 {count} 个未暂存文件{plural}？

# menuItemCreateBranch
source: Create Branch
ar: إنشاء فرع
de: Branch erstellen
es: Crear rama
fr: Créer une branche
it: Crea ramo
ru: Создать ветку
tr: Dal oluştur
zh: 创建分支

# menuItemViewDiff
source: View Diff
ar: عرض الفروق
de: Diff anzeigen
es: Ver diferencias
fr: Voir les différences
it: Visualizza differenze
ru: Просмотреть различия
tr: Farkları görüntüle
zh: 查看差异

source: Git Command Successful
ar: نجح أمر Git
de: Git-Befehl erfolgreich
es: Comando Git exitoso
fr: Commande Git réussie
it: Comando Git riuscito
ru: Команда Git выполнена успешно
tr: Git Komutu Başarılı
zh: Git 命令成功

source: Git Command Failed
ar: فشل أمر Git
de: Git-Befehl fehlgeschlagen
es: Comando Git fallido
fr: Commande Git échouée
it: Comando Git fallito
ru: Команда Git не выполнена
tr: Git Komutu Başarısız
zh: Git 命令失败

source: Closing in {seconds}
ar: إغلاق خلال {seconds}
de: Schließt in {seconds}
es: Cerrando en {seconds}
fr: Fermeture dans {seconds}
it: Chiusura tra {seconds}
ru: Закрытие через {seconds}
tr: {seconds} saniye içinde kapatılıyor
zh: {seconds} 秒后关闭

# checkboxKeepDialogOpen
source: Keep this dialog open
ar: إبقاء مربع الحوار مفتوحًا
de: Diesen Dialog offen halten
es: Mantener este diálogo abierto
fr: Garder ce dialogue ouvert
it: Mantieni aperto questo dialogo
ru: Держать этот диалог открытым
tr: Bu diyalogu açık tut
zh: 保持此对话框打开

# checkboxAmendLastCommit
source: Amend last commit
ar: تعديل آخر التزام
de: Letzten Commit ändern
es: Enmendar último commit
fr: Modifier le dernier commit
it: Modifica ultimo commit
ru: Изменить последний коммит
tr: Son kaydı düzelt
zh: 修改最后一次提交

# checkboxAmendLastCommitSubtitle
source: Replace the last commit with this one
ar: استبدال آخر التزام بهذا
de: Letzten Commit durch diesen ersetzen
es: Reemplazar el último commit con este
fr: Remplacer le dernier commit par celui-ci
it: Sostituisci l'ultimo commit con questo
ru: Заменить последний коммит этим
tr: Son kaydı bununla değiştir
zh: 用此替换最后一次提交

# labelCopyPath
source: Copy Path
ar: نسخ المسار
de: Pfad kopieren
es: Copiar ruta
fr: Copier le chemin
it: Copia percorso
ru: Копировать путь
tr: Yolu Kopyala
zh: 复制路径

# labelRevealInExplorer
source: Reveal in Explorer
ar: إظهار في المستكشف
de: Im Explorer anzeigen
es: Mostrar en el Explorador
fr: Afficher dans l'Explorateur
it: Mostra in Esplora risorse
ru: Показать в проводнике
tr: Gezgin'de Göster
zh: 在资源管理器中显示

# labelChangedFiles
source: Changed Files
ar: الملفات المتغيرة
de: Geänderte Dateien
es: Archivos modificados
fr: Fichiers modifiés
it: File modificati
ru: Измененные файлы
tr: Değiştirilen Dosyalar
zh: 已更改的文件

# labelBinaryFile
source: Binary File
ar: ملف ثنائي
de: Binärdatei
es: Archivo binario
fr: Fichier binaire
it: File binario
ru: Двоичный файл
tr: İkili Dosya
zh: 二进制文件

# labelCannotPreviewFile
source: Cannot Preview File
ar: لا يمكن معاينة الملف
de: Dateivorschau nicht möglich
es: No se puede previsualizar el archivo
fr: Impossible de prévisualiser le fichier
it: Impossibile visualizzare l'anteprima del file
ru: Невозможно просмотреть файл
tr: Dosya Önizlenemiyor
zh: 无法预览文件

# labelThisFileCannotBePreviewed
source: This file cannot be previewed
ar: لا يمكن معاينة هذا الملف
de: Diese Datei kann nicht in der Vorschau angezeigt werden
es: Este archivo no se puede previsualizar
fr: Ce fichier ne peut pas être prévisualisé
it: Questo file non può essere visualizzato in anteprima
ru: Этот файл нельзя просмотреть
tr: Bu dosya önizlenemiyor
zh: 此文件无法预览

# labelDownloadFile
source: Download file
ar: تنزيل الملف
de: Datei herunterladen
es: Descargar archivo
fr: Télécharger le fichier
it: Scarica file
ru: Скачать файл
tr: Dosyayı indir
zh: 下载文件

# labelDownloadAndOpenFolder
source: Download & open folder
ar: تنزيل وفتح المجلد
de: Herunterladen & Ordner öffnen
es: Descargar y abrir carpeta
fr: Télécharger et ouvrir le dossier
it: Scarica e apri cartella
ru: Скачать и открыть папку
tr: İndir ve klasörü aç
zh: 下载并打开文件夹

# labelDiffViewer
source: Diff Viewer
ar: عارض الفروقات
es: Visor de diferencias
fr: Visualiseur de diff
it: Visualizzatore diff
ru: Просмотр различий
tr: Fark Görüntüleyici
zh: 差异查看器

# labelStaged
source: Staged
ar: مُجهز
de: Bereitgestellt
es: Preparado
fr: Indexé
it: In staging
ru: Проиндексировано
tr: Hazırlandı
zh: 已暂存

# labelCopyAll
source: Copy All
ar: نسخ الكل
de: Alles kopieren
es: Copiar todo
fr: Tout copier
it: Copia tutto
ru: Копировать всё
tr: Tümünü Kopyala
zh: 全部复制

# labelOpenInExternalTool
source: Open in External Tool
ar: فتح في أداة خارجية
de: In externem Tool öffnen
es: Abrir en herramienta externa
fr: Ouvrir dans un outil externe
it: Apri in strumento esterno
ru: Открыть во внешнем инструменте
tr: Harici Araçta Aç
zh: 在外部工具中打开

# labelCommitMessage
source: Commit Message
ar: رسالة الالتزام
de: Commit-Nachricht
es: Mensaje de commit
fr: Message de commit
it: Messaggio di commit
ru: Сообщение коммита
tr: Kayıt Mesajı
zh: 提交消息

# labelAmendCommit
source: Amend Commit
ar: تعديل الالتزام
de: Commit ändern
es: Enmendar commit
fr: Modifier le commit
it: Modifica commit
ru: Изменить коммит
tr: Kaydı Düzelt
zh: 修改提交

# labelLines
source: lines
ar: سطور
de: Zeilen
es: líneas
fr: lignes
it: righe
ru: строк
tr: satır
zh: 行

# labelFile
source: file
ar: ملف
de: Datei
es: archivo
fr: fichier
ru: файл
tr: dosya
zh: 文件

# labelFiles
source: files
ar: ملفات
de: Dateien
es: archivos
fr: fichiers
it: file
ru: файлов
tr: dosya
zh: 文件

# messageFileNotFound
source: File not found
ar: الملف غير موجود
de: Datei nicht gefunden
es: Archivo no encontrado
fr: Fichier introuvable
it: File non trovato
ru: Файл не найден
tr: Dosya bulunamadı
zh: 文件未找到

# messageSourceFileNotFound
source: Source file not found
ar: الملف المصدر غير موجود
de: Quelldatei nicht gefunden
es: Archivo de origen no encontrado
fr: Fichier source introuvable
it: File sorgente non trovato
ru: Исходный файл не найден
tr: Kaynak dosya bulunamadı
zh: 源文件未找到

# messageErrorLoadingDiff
source: Error loading diff: {error}
ar: خطأ في تحميل الفروقات: {error}
de: Fehler beim Laden des Diffs: {error}
es: Error al cargar diferencias: {error}
fr: Erreur lors du chargement du diff : {error}
it: Errore nel caricamento del diff: {error}
ru: Ошибка загрузки различий: {error}
tr: Fark yüklenirken hata: {error}
zh: 加载差异时出错：{error}

# messageLineCopiedToClipboard
source: Line copied to clipboard
ar: تم نسخ السطر إلى الحافظة
de: Zeile in Zwischenablage kopiert
es: Línea copiada al portapapeles
fr: Ligne copiée dans le presse-papiers
it: Riga copiata negli appunti
ru: Строка скопирована в буфер обмена
tr: Satır panoya kopyalandı
zh: 行已复制到剪贴板

# messageCommitMessageRequired
source: Commit message is required
ar: رسالة الالتزام مطلوبة
de: Commit-Nachricht erforderlich
es: Se requiere mensaje de commit
fr: Message de commit requis
it: Messaggio di commit richiesto
ru: Требуется сообщение коммита
tr: Kayıt mesajı gerekli
zh: 需要提交消息

# messageErrorLoadingHistory
source: Error Loading History
ar: خطأ في تحميل السجل
de: Fehler beim Laden des Verlaufs
es: Error al cargar historial
fr: Erreur lors du chargement de l'historique
it: Errore nel caricamento della cronologia
ru: Ошибка загрузки истории
tr: Geçmiş Yüklenirken Hata
zh: 加载历史记录时出错

# messageNoFilesChanged
source: No files changed
ar: لا توجد ملفات متغيرة
de: Keine Dateien geändert
es: No hay archivos modificados
fr: Aucun fichier modifié
it: Nessun file modificato
ru: Нет измененных файлов
tr: Değiştirilen dosya yok
zh: 没有文件被更改

# messageFileTooLargeToPreview
source: File too large to preview ({size})
ar: الملف كبير جداً للمعاينة ({size})
de: Datei zu groß für Vorschau ({size})
es: Archivo demasiado grande para previsualizar ({size})
fr: Fichier trop volumineux pour la prévisualisation ({size})
it: File troppo grande per l'anteprima ({size})
ru: Файл слишком большой для предпросмотра ({size})
tr: Dosya önizleme için çok büyük ({size})
zh: 文件太大无法预览 ({size})

# messageFailedToDownloadFile
source: Failed to download file: {error}
ar: فشل تنزيل الملف: {error}
de: Fehler beim Herunterladen der Datei: {error}
es: Error al descargar archivo: {error}
fr: Échec du téléchargement du fichier : {error}
it: Impossibile scaricare il file: {error}
ru: Не удалось скачать файл: {error}
tr: Dosya indirilemedi: {error}
zh: 下载文件失败：{error}

# messageFailedToOpenEditor
source: Failed to open editor: {error}
ar: فشل فتح المحرر: {error}
de: Fehler beim Öffnen des Editors: {error}
es: Error al abrir editor: {error}
fr: Échec de l'ouverture de l'éditeur : {error}
it: Impossibile aprire l'editor: {error}
ru: Не удалось открыть редактор: {error}
tr: Düzenleyici açılamadı: {error}
zh: 打开编辑器失败：{error}

# messageFailedToOpenFileInEditor
source: Failed to open file in editor: {error}
ar: فشل فتح الملف في المحرر: {error}
de: Fehler beim Öffnen der Datei im Editor: {error}
es: Error al abrir archivo en editor: {error}
fr: Échec de l'ouverture du fichier dans l'éditeur : {error}
it: Impossibile aprire il file nell'editor: {error}
ru: Не удалось открыть файл в редакторе: {error}
tr: Dosya düzenleyicide açılamadı: {error}
zh: 在编辑器中打开文件失败：{error}

# messageRepositoryPathNotAvailable
source: Repository path not available
ar: مسار المستودع غير متاح
de: Repository-Pfad nicht verfügbar
es: Ruta del repositorio no disponible
fr: Chemin du dépôt non disponible
it: Percorso del repository non disponibile
ru: Путь к репозиторию недоступен
tr: Depo yolu mevcut değil
zh: 仓库路径不可用

# messageFileDownloadedAndFolderOpened
source: File downloaded to repository and folder opened
ar: تم تنزيل الملف إلى المستودع وفتح المجلد
de: Datei heruntergeladen und Ordner geöffnet
es: Archivo descargado al repositorio y carpeta abierta
fr: Fichier téléchargé dans le dépôt et dossier ouvert
it: File scaricato nel repository e cartella aperta
ru: Файл загружен в репозиторий и папка открыта
tr: Dosya depoya indirildi ve klasör açıldı
zh: 文件已下载到仓库并打开文件夹

# messageFailedToDownloadAndOpenFolder
source: Failed to download and open folder: {error}
ar: فشل التنزيل وفتح المجلد: {error}
de: Fehler beim Herunterladen und Öffnen des Ordners: {error}
es: Error al descargar y abrir carpeta: {error}
fr: Échec du téléchargement et de l'ouverture du dossier : {error}
it: Impossibile scaricare e aprire la cartella: {error}
ru: Не удалось скачать и открыть папку: {error}
tr: İndirme ve klasör açma başarısız: {error}
zh: 下载并打开文件夹失败：{error}

# messageFileSavedTo
source: File saved to {path}
ar: تم حفظ الملف في {path}
de: Datei gespeichert in {path}
es: Archivo guardado en {path}
fr: Fichier enregistré dans {path}
it: File salvato in {path}
ru: Файл сохранен в {path}
tr: Dosya kaydedildi: {path}
zh: 文件已保存到 {path}

# messageViewDiffForCommit
source: View diff for {hash} (coming soon)
ar: عرض الفروقات لـ {hash} (قريباً)
de: Diff für {hash} anzeigen (demnächst)
es: Ver diferencias para {hash} (próximamente)
fr: Voir le diff pour {hash} (bientôt disponible)
it: Visualizza diff per {hash} (prossimamente)
ru: Просмотр различий для {hash} (скоро)
tr: {hash} için farkı görüntüle (yakında)
zh: 查看 {hash} 的差异（即将推出）

# messageFilesStaged
source: {count} file{plural} staged
ar: {count} {plural} مُجهز
de: {count} {plural} bereitgestellt
es: {count} {plural} preparado{plural}
fr: {count} {plural} indexé{plural}
it: {count} {plural} in staging
ru: {count} {plural} проиндексировано
tr: {count} {plural} hazırlandı
zh: {count} 个{plural}已暂存

# messageFileInfo
source: {lineCount} lines {fileSize}
ar: {lineCount} سطور • {fileSize}
de: {lineCount} Zeilen • {fileSize}
es: {lineCount} líneas • {fileSize}
fr: {lineCount} lignes • {fileSize}
it: {lineCount} righe • {fileSize}
ru: {lineCount} строк • {fileSize}
tr: {lineCount} satır • {fileSize}
zh: {lineCount} 行 • {fileSize}

# tipCommitMessage
source: Tip: Use present tense ("Add feature" not "Added feature")
ar: نصيحة: استخدم زمن المضارع ("إضافة ميزة" وليس "أضيفت ميزة")
de: Tipp: Verwenden Sie Präsens ("Funktion hinzufügen" nicht "Funktion hinzugefügt")
es: Consejo: Use tiempo presente ("Agregar función" no "Agregó función")
fr: Astuce : Utilisez le présent ("Ajouter une fonctionnalité" et non "Ajouté une fonctionnalité")
it: Suggerimento: Usa il presente ("Aggiungi funzionalità" non "Aggiunta funzionalità")
ru: Совет: Используйте настоящее время ("Добавить функцию", а не "Добавлена функция")
tr: İpucu: Şimdiki zaman kullanın ("Özellik ekle" değil "Özellik eklendi")
zh: 提示：使用现在时（"添加功能"而不是"已添加功能"）

source: Edit URL
ar: تحرير URL
de: URL bearbeiten
es: Editar URL
fr: Modifier l'URL
it: Modifica URL
ru: Изменить URL
tr: URL'yi düzenle
zh: 编辑 URL

source: Fetch URL
ar: جلب URL
de: Abruf-URL
es: URL de obtención
fr: URL de récupération
it: URL di recupero
ru: URL получения
tr: Getirme URL'si
zh: 获取 URL

source: Push URL
ar: دفع URL
es: URL de envío
fr: URL de poussée
it: URL di invio
ru: URL отправки
tr: Gönderme URL'si
zh: 推送 URL

source: Merge into current
ar: دمج في الحالي
de: In aktuellen zusammenführen
es: Fusionar en actual
fr: Fusionner dans l'actuel
it: Unisci nell'attuale
ru: Слить в текущую
tr: Mevcut ile birleştir
zh: 合并到当前

source: More actions
ar: المزيد من الإجراءات
de: Weitere Aktionen
es: Más acciones
fr: Plus d'actions
it: Altre azioni
ru: Дополнительные действия
tr: Daha fazla eylem
zh: 更多操作

source: Create Pull Request
ar: إنشاء طلب سحب
de: Pull Request erstellen
es: Crear solicitud de extracción
fr: Créer une demande de fusion
it: Crea richiesta di pull
ru: Создать запрос на слияние
tr: Çekme isteği oluştur
zh: 创建拉取请求

source: Remove from Workspace
ar: إزالة من مساحة العمل
de: Aus Workspace entfernen
es: Eliminar del espacio de trabajo
fr: Supprimer de l'espace de travail
it: Rimuovi dall'area di lavoro
ru: Удалить из рабочего пространства
tr: Çalışma alanından kaldır
zh: 从工作区删除

# repositoriesCount
source: {count} repositories
ar: {count} مستودعات
es: {count} repositorios
fr: {count} dépôts
it: {count} repository
ru: {count} репозиториев
tr: {count} depo
zh: {count} 个仓库

source: Unassigned Repositories
ar: مستودعات غير معينة
de: Nicht zugewiesene Repositories
es: Repositorios no asignados
fr: Dépôts non attribués
it: Repository non assegnati
ru: Неназначенные репозитории
tr: Atanmamış depolar
zh: 未分配的仓库

source: Delete Project
ar: حذف المشروع
de: Projekt löschen
es: Eliminar proyecto
fr: Supprimer le projet
it: Elimina progetto
ru: Удалить проект
tr: Projeyi sil
zh: 删除项目

# couldNotLoadBlame
source: Could not load blame information
ar: تعذر تحميل معلومات اللوم
de: Blame-Informationen konnten nicht geladen werden
es: No se pudo cargar información de blame
fr: Impossible de charger les informations de blâme
it: Impossibile caricare le informazioni di blame
ru: Не удалось загрузить информацию о blame
tr: Blame bilgisi yüklenemedi
zh: 无法加载追溯信息

source: Empty File
ar: ملف فارغ
de: Leere Datei
es: Archivo vacío
fr: Fichier vide
it: File vuoto
ru: Пустой файл
tr: Boş dosya
zh: 空文件

# noContent
source: This file has no content
ar: هذا الملف لا يحتوي على محتوى
de: Diese Datei hat keinen Inhalt
es: Este archivo no tiene contenido
fr: Ce fichier n'a pas de contenu
it: Questo file non ha contenuto
ru: Этот файл не имеет содержимого
tr: Bu dosyanın içeriği yok
zh: 此文件没有内容

source: Error Loading Blame
ar: خطأ في تحميل اللوم
de: Fehler beim Laden von Blame
es: Error al cargar blame
fr: Erreur lors du chargement du blâme
it: Errore nel caricamento di blame
ru: Ошибка загрузки blame
tr: Blame yüklenirken hata
zh: 加载追溯时出错

# commitShortHash
source: Commit {hash}
ar: الالتزام {hash}
ru: Коммит {hash}
zh: 提交 {hash}

# linesCount
source: {count} lines
ar: {count} أسطر
de: {count} Zeilen
es: {count} líneas
fr: {count} lignes
it: {count} righe
ru: {count} строк
tr: {count} satır
zh: {count} 行

source: Output copied to clipboard
ar: تم نسخ المخرجات إلى الحافظة
de: Ausgabe in Zwischenablage kopiert
es: Salida copiada al portapapeles
fr: Sortie copiée dans le presse-papiers
it: Output copiato negli appunti
ru: Вывод скопирован в буфер обмена
tr: Çıktı panoya kopyalandı
zh: 输出已复制到剪贴板

source: Copy Output
ar: نسخ المخرجات
de: Ausgabe kopieren
es: Copiar salida
fr: Copier la sortie
it: Copia output
ru: Копировать вывод
tr: Çıktıyı kopyala
zh: 复制输出

source: Exit Code
ar: رمز الخروج
es: Código de salida
fr: Code de sortie
it: Codice di uscita
ru: Код выхода
tr: Çıkış kodu
zh: 退出代码

source: Time
ar: الوقت
de: Zeit
es: Tiempo
fr: Temps
it: Tempo
ru: Время
tr: Süre
zh: 时间

source: No output
ar: لا يوجد مخرجات
de: Keine Ausgabe
es: Sin salida
fr: Aucune sortie
it: Nessun output
ru: Нет вывода
tr: Çıktı yok
zh: 无输出

source: Commit Diff
ar: فرق الالتزام
es: Diferencias de commit
fr: Différence de commit
it: Diff del commit
ru: Разница коммита
tr: Commit farkı
zh: 提交差异

source: Error loading diff:
ar: خطأ في تحميل الاختلافات:
de: Fehler beim Laden der Unterschiede:
es: Error al cargar las diferencias:
fr: Erreur de chargement des différences:
it: Errore nel caricamento delle differenze:
ru: Ошибка загрузки различий:
tr: Farklar yüklenirken hata:
zh: 加载差异时出错：

source: Line copied to clipboard
ar: تم نسخ السطر إلى الحافظة
de: Zeile in Zwischenablage kopiert
es: Línea copiada al portapapeles
fr: Ligne copiée dans le presse-papiers
it: Riga copiata negli appunti
ru: Строка скопирована в буфер обмена
tr: Satır panoya kopyalandı
zh: 行已复制到剪贴板

source: Copy All
ar: نسخ الكل
de: Alle kopieren
es: Copiar todo
fr: Tout copier
it: Copia tutto
ru: Копировать все
tr: Tümünü kopyala
zh: 全部复制

source: LOCAL
ar: محلي
de: LOKAL
it: LOCALE
ru: ЛОКАЛЬНЫЙ
tr: YEREL
zh: 本地

source: Annotated ({count})
ar: مُعلّق ({count})
de: Annotiert ({count})
es: Anotado ({count})
fr: Annoté ({count})
it: Annotato ({count})
ru: Аннотированных ({count})
tr: Açıklamalı ({count})
zh: 注释标签 ({count})

source: Lightweight ({count})
ar: خفيف ({count})
es: Ligero ({count})
fr: Léger ({count})
it: Leggero ({count})
ru: Легких ({count})
tr: Hafif ({count})
zh: 轻量级标签 ({count})

source: All ({count})
ar: الكل ({count})
de: Alle ({count})
es: Todos ({count})
fr: Tous ({count})
it: Tutti ({count})
ru: Всего ({count})
tr: Tümü ({count})
zh: 全部 ({count})

# dropFoldersHere
source: Drop folders here to add repositories
ar: أسقط المجلدات هنا لإضافة المستودعات
de: Ordner hier ablegen, um Repositories hinzuzufügen
es: Suelta carpetas aquí para agregar repositorios
fr: Déposez des dossiers ici pour ajouter des dépôts
it: Trascina le cartelle qui per aggiungere repository
ru: Перетащите папки сюда, чтобы добавить репозитории
tr: Depo eklemek için klasörleri buraya bırakın
zh: 将文件夹拖到此处以添加仓库

source: Validate All
ar: التحقق من صحة الكل
de: Alle validieren
es: Validar todo
fr: Tout valider
it: Valida tutto
ru: Проверить все
tr: Tümünü doğrula
zh: 验证全部

# onBranchAt
source: on {branch} {timestamp}
ar: على {branch} • {timestamp}
de: auf {branch} • {timestamp}
es: en {branch} • {timestamp}
fr: sur {branch} • {timestamp}
it: su {branch} • {timestamp}
ru: на {branch} • {timestamp}
tr: {branch} üzerinde • {timestamp}
zh: 在 {branch} • {timestamp}

source: Quick filters:
ar: الفلاتر السريعة:
de: Schnellfilter:
es: Filtros rápidos:
fr: Filtres rapides:
it: Filtri rapidi:
ru: Быстрые фильтры:
tr: Hızlı filtreler:
zh: 快速过滤器：

# commitsCount
source: {count} commits
it: {count} commit
ru: {count} коммитов
tr: {count} commit
zh: {count} 次提交

source: Accessed:
ar: تم الوصول:
de: Zugegriffen:
es: Accedido:
fr: Accédé:
it: Accesso:
ru: Доступ:
tr: Erişildi:
zh: 访问时间：

source: Pull from remote
ar: السحب من البعيد
de: Von Remote abrufen
es: Obtener del remoto
fr: Tirer du distant
it: Scarica dal remoto
ru: Получить с удалённого
tr: Uzak sunucudan çek
zh: 从远程拉取

# pullFromRemoteWithCount
source: Pull from remote ({count} commits behind)
ar: السحب من البعيد ({count} commits متأخرة)
de: Von Remote abrufen ({count} Commits zurück)
es: Obtener del remoto ({count} commits atrás)
fr: Tirer du distant ({count} commits en retard)
it: Scarica dal remoto ({count} commit indietro)
ru: Получить с удалённого ({count} коммитов позади)
tr: Uzak sunucudan çek ({count} commit geride)
zh: 从远程拉取（落后 {count} 次提交）

source: Push to remote
ar: الدفع إلى البعيد
de: Zu Remote hochladen
es: Enviar al remoto
fr: Pousser vers le distant
it: Carica sul remoto
ru: Отправить на удалённый
tr: Uzak sunucuya gönder
zh: 推送到远程

# pushToRemoteWithCount
source: Push to remote ({count} commits ahead)
ar: الدفع إلى البعيد ({count} commits متقدمة)
de: Zu Remote hochladen ({count} Commits voraus)
es: Enviar al remoto ({count} commits adelante)
fr: Pousser vers le distant ({count} commits en avance)
it: Carica sul remoto ({count} commit avanti)
ru: Отправить на удалённый ({count} коммитов впереди)
tr: Uzak sunucuya gönder ({count} commit önde)
zh: 推送到远程（领先 {count} 次提交）

source: Cherry-pick
ar: اختيار انتقائي
zh: 挑选提交

source: Revert
ar: التراجع
de: Rückgängig machen
es: Revertir
fr: Annuler
it: Ripristina
ru: Отменить
tr: Geri al
zh: 撤销

source: Reset to here
ar: إعادة التعيين هنا
de: Hier zurücksetzen
es: Restablecer aquí
fr: Réinitialiser ici
it: Reimposta qui
ru: Сбросить до этого места
tr: Buraya sıfırla
zh: 重置到此处
