Repository: kartalbas/flutter-gitui
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# tooltipSwitchBranch
source: Switch Branch (Ctrl+B)
ar: تبديل الفرع (Ctrl+B)
de: Branch wechseln (Strg+B)
es: Cambiar Rama (Ctrl+B)
fr: Changer de Branche (Ctrl+B)
it: Cambia Branch (Ctrl+B)
ru: Переключить ветку (Ctrl+B)
tr: Dal Değiştir (Ctrl+B)
zh: 切换分支 (Ctrl+B)

# tooltipSwitchRepository
source: Switch Repository (Ctrl+R)
ar: تبديل المستودع (Ctrl+R)
de: Repository wechseln (Strg+R)
es: Cambiar Repositorio (Ctrl+R)
fr: Changer de Dépôt (Ctrl+R)
it: Cambia Repository (Ctrl+R)
ru: Переключить репозиторий (Ctrl+R)
tr: Depo Değiştir (Ctrl+R)
zh: 切换仓库 (Ctrl+R)

# tooltipSwitchWorkspace
source: Switch Workspace
ar: تبديل مساحة العمل
de: Arbeitsbereich wechseln
es: Cambiar Espacio de Trabajo
fr: Changer d'Espace de Travail
it: Cambia Area di Lavoro
ru: Переключить рабочую область
tr: Çalışma Alanı Değiştir
zh: 切换工作区

source: Current
ar: الحالي
de: Aktuell
es: Actual
fr: Actuel
it: Corrente
ru: Текущий
tr: Geçerli
zh: 当前

source: Open in Editor
ar: فتح في المحرر
de: Im Editor öffnen
es: Abrir en Editor
fr: Ouvrir dans l'éditeur
it: Apri nell'editor
ru: Открыть в редакторе
tr: Editörde Aç
zh: 在编辑器中打开

source: Copy File
ar: نسخ الملف
de: Datei kopieren
es: Copiar Archivo
fr: Copier le fichier
it: Copia file
ru: Копировать файл
tr: Dosyayı Kopyala
zh: 复制文件

source: Paste
ar: لصق
de: Einfügen
es: Pegar
fr: Coller
it: Incolla
ru: Вставить
tr: Yapıştır
zh: 粘贴

source: Keep Both
ar: الاحتفاظ بكليهما
de: Beide behalten
es: Mantener Ambos
fr: Garder les deux
it: Mantieni entrambi
ru: Сохранить оба
tr: İkisini de Tut
zh: 保留两者

source: Replace
ar: استبدال
de: Ersetzen
es: Reemplazar
fr: Remplacer
it: Sostituisci
ru: Заменить
tr: Değiştir
zh: 替换

source: Delete File
ar: حذف الملف
de: Datei löschen
es: Eliminar Archivo
fr: Supprimer le fichier
it: Elimina file
ru: Удалить файл
tr: Dosyayı Sil
zh: 删除文件

source: Rename File
ar: إعادة تسمية الملف
de: Datei umbenennen
es: Renombrar Archivo
fr: Renommer le fichier
it: Rinomina file
ru: Переименовать файл
tr: Dosyayı Yeniden Adlandır
zh: 重命名文件

# stageAllAndCommit
source: Stage All & Commit
ar: تجهيز الكل والإيداع
de: Alle stagen & committen
es: Preparar Todo y Confirmar
fr: Tout indexer et valider
it: Prepara tutto e commit
ru: Подготовить все и зафиксировать
tr: Tümünü Hazırla ve Commit Et
zh: 暂存全部并提交

# discardChangesQuestion
source: Discard Changes
ar: تجاهل التغييرات؟
de: Änderungen verwerfen?
es: ¿Descartar Cambios?
fr: Abandonner les modifications ?
it: Scartare le modifiche?
ru: Отменить изменения?
tr: Değişiklikleri At?
zh: 放弃更改？

# discardAllChangesQuestion
source: Discard All Changes?
ar: تجاهل جميع التغييرات؟
de: Alle Änderungen verwerfen?
es: ¿Descartar Todos los Cambios?
fr: Abandonner toutes les modifications ?
it: Scartare tutte le modifiche?
ru: Отменить все изменения?
tr: Tüm Değişiklikleri At?
zh: 放弃所有更改？

# stageAllChangesQuestion
source: Stage All Changes?
ar: تجهيز جميع التغييرات؟
de: Alle Änderungen stagen?
es: ¿Preparar Todos los Cambios?
fr: Indexer toutes les modifications ?
it: Preparare tutte le modifiche?
ru: Подготовить все изменения?
tr: Tüm Değişiklikleri Hazırla?
zh: 暂存所有更改？

# unstageAllChangesQuestion
source: Unstage All Changes?
ar: إلغاء تجهيز جميع التغييرات؟
de: Alle Änderungen unstagen?
es: ¿Despreparar Todos los Cambios?
fr: Désindexer toutes les modifications ?
it: Rimuovere tutte le modifiche preparate?
ru: Отменить подготовку всех изменений?
tr: Tüm Hazırlanmış Değişiklikleri Kaldır?
zh: 取消暂存所有更改？

source: Web Browser Limitation
ar: قيود متصفح الويب
de: Webbrowser-Einschränkung
es: Limitación del navegador web
fr: Limitation du navigateur Web
it: Limitazione del browser web
ru: Ограничение веб-браузера
tr: Web tarayıcı kısıtlaması
zh: 网页浏览器限制

source: Windows Reserved Filename
ar: اسم ملف محجوز من Windows
de: Reservierter Windows-Dateiname
es: Nombre de Archivo Reservado de Windows
fr: Nom de fichier réservé Windows
it: Nome file riservato Windows
ru: Зарезервированное имя файла Windows
tr: Windows Ayrılmış Dosya Adı
zh: Windows 保留文件名

source: Merge Conflicts
ar: تعارضات الدمج
de: Merge-Konflikte
es: Conflictos de Fusión
fr: Conflits de fusion
it: Conflitti di merge
ru: Конфликты слияния
tr: Birleştirme Çakışmaları
zh: 合并冲突

# selectConflictToResolve
source: Select a conflict to resolve
ar: حدد تعارضاً لحله
de: Konflikt zum Auflösen auswählen
es: Seleccionar conflicto para resolver
fr: Sélectionner un conflit à résoudre
it: Seleziona conflitto da risolvere
ru: Выберите конфликт для разрешения
tr: Çözülecek çakışmayı seç
zh: 选择要解决的冲突

source: Resolved
ar: تم الحل
de: Aufgelöst
es: Resuelto
fr: Résolu
it: Risolto
ru: Разрешено
tr: Çözüldü
zh: 已解决

source: Continue Merge
ar: متابعة الدمج
de: Merge fortsetzen
es: Continuar Fusión
fr: Continuer la fusion
it: Continua merge
ru: Продолжить слияние
tr: Birleştirmeye Devam Et
zh: 继续合并

source: Abort Merge
ar: إحباط الدمج
de: Merge abbrechen
es: Abortar Fusión
fr: Abandonner la fusion
it: Annulla merge
ru: Прервать слияние
tr: Birleştirmeyi İptal Et
zh: 中止合并

source: Commit Changes
ar: إيداع التغييرات
de: Änderungen committen
es: Confirmar Cambios
fr: Valider les modifications
it: Esegui commit delle modifiche
ru: Зафиксировать изменения
tr: Değişiklikleri Commit Et
zh: 提交更改

source: Amend last commit
ar: تعديل آخر إيداع
de: Letzten Commit ändern
es: Modificar último commit
fr: Modifier le dernier commit
it: Modifica ultimo commit
ru: Изменить последний коммит
tr: Son commit'i değiştir
zh: 修改最后一次提交

source: View files
ar: عرض الملفات
de: Dateien anzeigen
es: Ver archivos
fr: Voir les fichiers
it: Visualizza file
ru: Просмотреть файлы
tr: Dosyaları görüntüle
zh: 查看文件

source: Clean only
ar: نظيف فقط
de: Nur sauber
es: Solo limpio
fr: Propre uniquement
it: Solo pulito
ru: Только чистые
tr: Yalnızca temiz
zh: 仅干净

source: With remote
ar: مع البعيد
de: Mit Remote
es: Con remoto
fr: Avec distant
it: Con remoto
ru: С удаленным
tr: Uzak ile
zh: 带远程

source: Remove Repository
ar: إزالة المستودع
de: Repository entfernen
es: Eliminar Repositorio
fr: Supprimer le dépôt
it: Rimuovi repository
ru: Удалить репозиторий
tr: Depoyu Kaldır
zh: 移除仓库

# clearAllRepositories
source: Remove All from Workspace
ar: مسح جميع المستودعات
de: Alle Repositories löschen
es: Limpiar Todos los Repositorios
fr: Effacer tous les dépôts
it: Cancella tutti i repository
ru: Очистить все репозитории
tr: Tüm Depoları Temizle
zh: 清除所有仓库

source: Edit Project
ar: تحرير المشروع
de: Projekt bearbeiten
es: Editar proyecto
fr: Modifier le projet
it: Modifica progetto
ru: Редактировать проект
tr: Projeyi düzenle
zh: 编辑项目

source: Delete Workspace
ar: حذف مساحة العمل
de: Arbeitsbereich löschen
es: Eliminar Espacio de Trabajo
fr: Supprimer l'espace de travail
it: Elimina area di lavoro
ru: Удалить рабочую область
tr: Çalışma Alanını Sil
zh: 删除工作区

source: Blame Statistics
ar: إحصائيات اللوم
de: Blame-Statistiken
es: Estadísticas de Blame
fr: Statistiques de blame
it: Statistiche blame
ru: Статистика blame
tr: Blame İstatistikleri
zh: 归因统计

source: File History
ar: سجل الملف
de: Dateiverlauf
es: Historial de Archivo
fr: Historique du fichier
it: Cronologia file
ru: История файла
tr: Dosya Geçmişi
zh: 文件历史

source: File Preview
ar: معاينة الملف
de: Dateivorschau
es: Vista Previa de Archivo
fr: Aperçu du fichier
it: Anteprima file
ru: Предпросмотр файла
tr: Dosya Önizlemesi
zh: 文件预览

source: Total Lines
ar: إجمالي الأسطر
de: Zeilen gesamt
es: Líneas Totales
fr: Lignes totales
it: Righe totali
ru: Всего строк
tr: Toplam Satır
zh: 总行数

source: Authors
ar: المؤلفون
de: Autoren
es: Autores
fr: Auteurs
it: Autori
ru: Авторы
tr: Yazarlar
zh: 作者

# commitsLabel
source: Commits
ar: الإيداعات
it: Commit
ru: Коммиты
tr: Commit'ler
zh: 提交

source: Contributors:
ar: المساهمون:
de: Mitwirkende:
es: Colaboradores:
fr: Contributeurs :
it: Contributori:
ru: Участники:
tr: Katkıda Bulunanlar:
zh: 贡献者：

source: Empty CSV file
ar: ملف CSV فارغ
de: Leere CSV-Datei
es: Archivo CSV vacío
fr: Fichier CSV vide
it: File CSV vuoto
ru: Пустой CSV-файл
tr: Boş CSV dosyası
zh: 空 CSV 文件

source: Stage All
ar: تجهيز الكل
de: Alle stagen
es: Preparar Todo
fr: Tout indexer
it: Prepara tutto
ru: Подготовить все
tr: Tümünü Hazırla
zh: 暂存全部

source: Unstage All
ar: إلغاء تجهيز الكل
de: Alle unstagen
es: Despreparar Todo
fr: Tout désindexer
it: Rimuovi tutto
ru: Отменить подготовку всех
tr: Tümünü Kaldır
zh: 取消暂存全部

source: Accept Ours
ar: قبول لدينا
de: Unsere akzeptieren
es: Aceptar Nuestro
fr: Accepter le nôtre
it: Accetta nostro
ru: Принять наш
tr: Bizimkini Kabul Et
zh: 接受我们的

source: Accept Theirs
ar: قبول لديهم
de: Ihre akzeptieren
es: Aceptar El Suyo
fr: Accepter le leur
it: Accetta loro
ru: Принять их
tr: Onlarınkini Kabul Et
zh: 接受他们的

source: Accept Both
ar: قبول كليهما
de: Beide akzeptieren
es: Aceptar Ambos
fr: Accepter les deux
it: Accetta entrambi
ru: Принять оба
tr: İkisini de Kabul Et
zh: 接受两者

source: Manual Resolution
ar: حل يدوي
de: Manuelle Auflösung
es: Resolución Manual
fr: Résolution manuelle
it: Risoluzione manuale
ru: Ручное разрешение
tr: Manuel Çözüm
zh: 手动解决

source: Resolving conflict...
ar: جاري حل التعارض...
de: Konflikt wird aufgelöst...
es: Resolviendo conflicto...
fr: Résolution du conflit...
it: Risoluzione conflitto...
ru: Разрешение конфликта...
tr: Çakışma çözülüyor...
zh: 正在解决冲突...

source: All conflicts resolved!
ar: تم حل جميع التعارضات!
de: Alle Konflikte aufgelöst!
es: ¡Todos los conflictos resueltos!
fr: Tous les conflits résolus !
it: Tutti i conflitti risolti!
ru: Все конфликты разрешены!
tr: Tüm çakışmalar çözüldü!
zh: 所有冲突已解决！

source: Ready to continue merge
ar: جاهز لمتابعة الدمج
de: Bereit zum Fortsetzen des Merges
es: Listo para continuar fusión
fr: Prêt à continuer la fusion
it: Pronto per continuare il merge
ru: Готово к продолжению слияния
tr: Birleştirmeye devam etmeye hazır
zh: 准备继续合并

# conflictsToResolve
source: {count} conflicts to resolve
ar: {count} تعارض للحل
de: {count} Konflikte zu lösen
es: {count} conflictos para resolver
fr: {count} conflits à résoudre
it: {count} conflitti da risolvere
ru: {count} конфликтов для разрешения
tr: Çözülecek {count} çakışma
zh: 有 {count} 个冲突需要解决

# useVersionFromCurrentBranch
source: Use the version from the current branch
ar: استخدام الإصدار من الفرع الحالي
de: Version vom aktuellen Branch verwenden
es: Usar la versión de la rama actual
fr: Utiliser la version de la branche actuelle
it: Usa la versione dal branch corrente
ru: Использовать версию из текущей ветки
tr: Geçerli dal'dan versiyonu kullan
zh: 使用当前分支的版本

# useVersionFromMergingBranch
source: Use the version from the merging branch
ar: استخدام الإصدار من الفرع المدمج
de: Version vom zusammenzuführenden Branch verwenden
es: Usar la versión de la rama que se fusiona
fr: Utiliser la version de la branche fusionnée
it: Usa la versione dal branch in merge
ru: Использовать версию из сливаемой ветки
tr: Birleştirilen dal'dan versiyonu kullan
zh: 使用合并分支的版本

source: Keep both versions (concatenated)
ar: الاحتفاظ بكلا الإصدارين (متسلسل)
de: Beide Versionen behalten (verkettet)
es: Mantener ambas versiones (concatenadas)
fr: Garder les deux versions (concaténées)
it: Mantieni entrambe le versioni (concatenate)
ru: Сохранить обе версии (объединенные)
tr: Her iki versiyonu da tut (birleştirilmiş)
zh: 保留两个版本（串联）

source: No merge in progress
ar: لا يوجد دمج قيد التنفيذ
de: Kein Merge läuft
es: No hay fusión en progreso
fr: Aucune fusion en cours
it: Nessun merge in corso
ru: Нет слияния в процессе
tr: Devam eden birleştirme yok
zh: 没有正在进行的合并

# allMergeConflictsResolved
source: All merge conflicts have been resolved.
ar: تم حل جميع تعارضات الدمج.
de: Alle Merge-Konflikte wurden aufgelöst.
es: Todos los conflictos de fusión se han resuelto.
fr: Tous les conflits de fusion ont été résolus.
it: Tutti i conflitti di merge sono stati risolti.
ru: Все конфликты слияния разрешены.
tr: Tüm birleştirme çakışmaları çözüldü.
zh: 所有合并冲突已解决。

source: Merge completed successfully
ar: اكتمل الدمج بنجاح
de: Merge erfolgreich abgeschlossen
es: Fusión completada exitosamente
fr: Fusion terminée avec succès
it: Merge completato con successo
ru: Слияние успешно завершено
tr: Birleştirme başarıyla tamamlandı
zh: 合并成功完成

source: Merge aborted
ar: تم إحباط الدمج
de: Merge abgebrochen
es: Fusión abortada
fr: Fusion abandonnée
it: Merge annullato
ru: Слияние прервано
tr: Birleştirme iptal edildi
zh: 合并已中止

# resolvedUsing
source: Resolved {fileName} using {choice}
ar: تم حل {fileName} باستخدام {choice}
de: {fileName} mit {choice} aufgelöst
es: Resuelto {fileName} usando {choice}
fr: Résolu {fileName} en utilisant {choice}
it: Risolto {fileName} usando {choice}
ru: Разрешено {fileName} используя {choice}
tr: {fileName} {choice} kullanılarak çözüldü
zh: 已使用 {choice} 解决 {fileName}

source: This may take a while.
ar: قد يستغرق هذا بعض الوقت.
de: Dies kann eine Weile dauern.
es: Esto puede tomar un tiempo.
fr: Cela peut prendre un moment.
it: Questo potrebbe richiedere del tempo.
ru: Это может занять некоторое время.
tr: Bu biraz zaman alabilir.
zh: 这可能需要一些时间。

source: No Unstaged Changes
ar: لا توجد تغييرات غير مجهزة
de: Keine ungestagten Änderungen
es: No hay Cambios sin Preparar
fr: Aucune modification non indexée
it: Nessuna modifica non preparata
ru: Нет неподготовленных изменений
tr: Hazırlanmamış Değişiklik Yok
zh: 无未暂存的更改

source: No Staged Changes
ar: لا توجد تغييرات مجهزة
de: Keine gestagten Änderungen
es: No hay Cambios Preparados
fr: Aucune modification indexée
it: Nessuna modifica preparata
ru: Нет подготовленных изменений
tr: Hazırlanmış Değişiklik Yok
zh: 无已暂存的更改

# stageFilesFromUnstagedTab
source: Stage files from the Unstaged tab
ar: تجهيز الملفات من علامة التبويب غير المجهزة
de: Dateien vom Tab "Ungestagt" stagen
es: Preparar archivos desde la pestaña Sin Preparar
fr: Indexer les fichiers depuis l'onglet non indexé
it: Prepara i file dalla scheda non preparato
ru: Подготовить файлы с вкладки неподготовленных
tr: Hazırlanmamış sekmesinden dosyaları hazırla
zh: 从未暂存选项卡暂存文件

source: Changes committed successfully
ar: تم إيداع التغييرات بنجاح
de: Änderungen erfolgreich committet
es: Cambios confirmados exitosamente
fr: Modifications validées avec succès
it: Modifiche committate con successo
ru: Изменения успешно зафиксированы
tr: Değişiklikler başarıyla commit edildi
zh: 更改已成功提交

# commitFailed
source: Commit failed: {error}
ar: فشل الإيداع: {error}
de: Commit fehlgeschlagen: {error}
es: Commit falló: {error}
fr: Échec du commit : {error}
it: Commit fallito: {error}
ru: Сбой коммита: {error}
tr: Commit başarısız: {error}
zh: 提交失败：{error}

# defaultLabel
source: Default
ar: الافتراضي
de: Standard
es: Predeterminado
fr: Par défaut
it: Predefinito
ru: По умолчанию
tr: Varsayılan
zh: 默认

# emptyStateNoHistory
source: No History
ar: لا يوجد سجل
de: Kein Verlauf
es: Sin historial
fr: Aucun historique
it: Nessuna cronologia
ru: Нет истории
tr: Geçmiş Yok
zh: 无历史记录

# emptyStateNoHistoryMessage
source: This file has no commit history
ar: هذا الملف ليس له سجل إيداع
de: Diese Datei hat keinen Commit-Verlauf
es: Este archivo no tiene historial de commits
fr: Ce fichier n'a pas d'historique de commits
it: Questo file non ha cronologia di commit
ru: У этого файла нет истории коммитов
tr: Bu dosyanın commit geçmişi yok
zh: 此文件没有提交历史

# emptyStateNoCommits
source: No Commits
ar: لا توجد إيداعات
de: Keine Commits
es: Sin commits
fr: Aucun commit
it: Nessun commit
ru: Нет коммитов
tr: Commit Yok
zh: 无提交

# emptyStateNoCommitsMessage
source: This repository has no commit history
ar: هذا المستودع ليس له سجل إيداع
de: Dieses Repository hat keinen Commit-Verlauf
es: Este repositorio no tiene historial de commits
fr: Ce dépôt n'a pas d'historique de commits
it: Questo repository non ha cronologia di commit
ru: У этого репозитория нет истории коммитов
tr: Bu depo commit geçmişine sahip değil
zh: 此仓库没有提交历史

# emptyStateNoCommitSelected
source: No Commit Selected
ar: لم يتم تحديد إيداع
de: Kein Commit ausgewählt
es: Ningún commit seleccionado
fr: Aucun commit sélectionné
it: Nessun commit selezionato
ru: Коммит не выбран
tr: Commit Seçilmedi
zh: 未选择提交

# emptyStateNoCommitSelectedMessage
source: Select a commit to view details
ar: حدد إيداعًا لعرض التفاصيل
de: Wählen Sie einen Commit aus, um Details anzuzeigen
es: Selecciona un commit para ver los detalles
fr: Sélectionnez un commit pour voir les détails
it: Seleziona un commit per vedere i dettagli
ru: Выберите коммит для просмотра деталей
tr: Ayrıntıları görüntülemek için bir commit seçin
zh: 选择一个提交以查看详情

# emptyStateNoFilesChanged
source: No files changed
ar: لا توجد ملفات متغيرة
de: Keine Dateien geändert
es: No hay archivos modificados
fr: Aucun fichier modifié
it: Nessun file modificato
ru: Нет измененных файлов
tr: Değiştirilen dosya yok
zh: 无文件更改

# emptyStateNoCommandsYet
source: No Commands Yet
ar: لا توجد أوامر بعد
de: Noch keine Befehle
es: Aún no hay comandos
fr: Aucune commande pour le moment
it: Nessun comando ancora
ru: Пока нет команд
tr: Henüz Komut Yok
zh: 暂无命令

# emptyStateNoCommandsYetMessage
source: Git commands will appear here
ar: ستظهر أوامر Git هنا
de: Git-Befehle werden hier angezeigt
es: Los comandos de Git aparecerán aquí
fr: Les commandes Git apparaîtront ici
it: I comandi Git appariranno qui
ru: Команды Git будут отображаться здесь
tr: Git komutları burada görünecek
zh: Git命令将显示在这里

# emptyStateNoData
source: No Data
ar: لا توجد بيانات
de: Keine Daten
es: Sin datos
fr: Aucune donnée
it: Nessun dato
ru: Нет данных
tr: Veri Yok
zh: 无数据

# emptyStateNoItemsFound
source: No items found
ar: لم يتم العثور على عناصر
de: Keine Elemente gefunden
es: No se encontraron elementos
fr: Aucun élément trouvé
it: Nessun elemento trovato
ru: Элементы не найдены
tr: Öğe bulunamadı
zh: 未找到项目

# emptyStateNoResultsFound
source: No Results Found
ar: لم يتم العثور على نتائج
de: Keine Ergebnisse gefunden
es: No se encontraron resultados
fr: Aucun résultat trouvé
it: Nessun risultato trovato
ru: Результаты не найдены
tr: Sonuç Bulunamadı
zh: 未找到结果

# emptyStateTryAdjustingSearchCriteria
source: Try adjusting your search criteria
ar: حاول ضبط معايير البحث
de: Versuchen Sie, Ihre Suchkriterien anzupassen
es: Intenta ajustar tus criterios de búsqueda
fr: Essayez d'ajuster vos critères de recherche
it: Prova ad aggiustare i criteri di ricerca
ru: Попробуйте изменить критерии поиска
tr: Arama kriterlerinizi ayarlamayı deneyin
zh: 尝试调整搜索条件

# emptyStateNoRepository
source: No Repository
ar: لا يوجد مستودع
de: Kein Repository
es: Sin repositorio
fr: Aucun dépôt
it: Nessun repository
ru: Нет репозитория
tr: Depo Yok
zh: 无仓库

# emptyStateNoSearchResults
source: No {itemType} match "{query}"
ar: لا يوجد {itemType} يطابق "{query}"
de: Keine {itemType} entsprechen "{query}"
es: Ningún {itemType} coincide con "{query}"
fr: Aucun {itemType} ne correspond à "{query}"
it: Nessun {itemType} corrisponde a "{query}"
ru: Нет {itemType}, соответствующих "{query}"
tr: "{query}" ile eşleşen {itemType} yok
zh: 没有{itemType}匹配"{query}"

# emptyStateNoValidRepositories
source: No valid Git repositories found
ar: لم يتم العثور على مستودعات Git صالحة
de: Keine gültigen Git-Repositories gefunden
es: No se encontraron repositorios Git válidos
fr: Aucun dépôt Git valide trouvé
it: Nessun repository Git valido trovato
ru: Действительные репозитории Git не найдены
tr: Geçerli Git deposu bulunamadı
zh: 未找到有效的Git仓库

# messageNoFileCopied
source: No file copied
ar: لم يتم نسخ أي ملف
de: Keine Datei kopiert
es: Ningún archivo copiado
fr: Aucun fichier copié
it: Nessun file copiato
ru: Файл не скопирован
tr: Kopyalanan dosya yok
zh: 未复制文件

# messageNoRepositoryOpen
source: No repository open
ar: لا يوجد مستودع مفتوح
de: Kein Repository geöffnet
es: No hay repositorio abierto
fr: Aucun dépôt ouvert
it: Nessun repository aperto
ru: Репозиторий не открыт
tr: Açık depo yok
zh: 未打开仓库

# messageNoRemotesConfigured
source: No remotes configured
ar: لم يتم تكوين أي ريموت
de: Keine Remotes konfiguriert
es: No hay remotos configurados
fr: Aucun remote configuré
it: Nessun remote configurato
ru: Удаленные репозитории не настроены
tr: Yapılandırılmış uzak depo yok
zh: 未配置远程仓库

# messageGitServiceNotAvailable
source: Git service not available
ar: خدمة Git غير متاحة
de: Git-Dienst nicht verfügbar
es: Servicio Git no disponible
fr: Service Git non disponible
it: Servizio Git non disponibile
ru: Служба Git недоступна
tr: Git hizmeti kullanılamıyor
zh: Git服务不可用

# messageCommitNotFound
source: Commit not found
ar: لم يتم العثور على الإيداع
de: Commit nicht gefunden
es: Commit no encontrado
fr: Commit non trouvé
it: Commit non trovato
ru: Коммит не найден
tr: Commit bulunamadı
zh: 未找到提交

# messageNoTextEditorConfigured
source: No text editor configured. Please set one in Settings.
ar: لم يتم تكوين محرر نصوص. يرجى تعيين واحد في الإعدادات.
de: Kein Texteditor konfiguriert. Bitte einen in den Einstellungen festlegen.
es: No hay editor de texto configurado. Por favor, configure uno en Ajustes.
fr: Aucun éditeur de texte configuré. Veuillez en définir un dans les paramètres.
it: Nessun editor di testo configurato. Impostarne uno nelle Impostazioni.
ru: Текстовый редактор не настроен. Установите его в настройках.
tr: Metin düzenleyici yapılandırılmamış. Lütfen Ayarlar'da bir tane ayarlayın.
zh: 未配置文本编辑器。请在设置中设置一个。

# messageNoMergeInProgress
source: No merge in progress
ar: لا يوجد دمج قيد التقدم
de: Kein Merge läuft
es: No hay fusión en progreso
fr: Aucune fusion en cours
it: Nessun merge in corso
ru: Слияние не выполняется
tr: Devam eden birleştirme yok
zh: 无正在进行的合并

# messageCopiedToClipboard
source: Copied to clipboard
ar: تم النسخ إلى الحافظة
de: In Zwischenablage kopiert
es: Copiado al portapapeles
fr: Copié dans le presse-papiers
it: Copiato negli appunti
ru: Скопировано в буфер обмена
tr: Panoya kopyalandı
zh: 已复制到剪贴板

# messageNoRemoteConfigured
source: No remote configured
ar: لم يتم تكوين ريموت
de: Kein Remote konfiguriert
es: No hay remoto configurado
fr: Aucun remote configuré
it: Nessun remote configurato
ru: Удаленный репозиторий не настроен
tr: Uzak depo yapılandırılmamış
zh: 未配置远程仓库

# messageNoDateGroup
source: No Date
ar: لا يوجد تاريخ
de: Kein Datum
es: Sin fecha
fr: Aucune date
it: Nessuna data
ru: Нет даты
tr: Tarih Yok
zh: 无日期

# snackbarFetchedFrom
source: Fetched from "{remoteName}"
ar: تم الجلب من "{remoteName}"
de: Von "{remoteName}" abgerufen
es: Obtenido de "{remoteName}"
fr: Récupéré depuis "{remoteName}"
it: Recuperato da "{remoteName}"
ru: Получено из "{remoteName}"
tr: "{remoteName}" adresinden alındı
zh: 已从"{remoteName}"获取

# snackbarFailedToFetch
source: Failed to fetch: {error}
ar: فشل الجلب: {error}
de: Abrufen fehlgeschlagen: {error}
es: Error al obtener: {error}
fr: Échec de la récupération : {error}
it: Recupero fallito: {error}
ru: Ошибка получения: {error}
tr: Alma başarısız: {error}
zh: 获取失败：{error}

# snackbarPulledFrom
source: Pulled from "{remoteName}"
ar: تم السحب من "{remoteName}"
de: Von "{remoteName}" gezogen
es: Extraído de "{remoteName}"
fr: Tiré depuis "{remoteName}"
it: Estratto da "{remoteName}"
ru: Извлечено из "{remoteName}"
tr: "{remoteName}" adresinden çekildi
zh: 已从"{remoteName}"拉取

# snackbarFailedToPull
source: Failed to pull: {error}
ar: فشل السحب: {error}
de: Ziehen fehlgeschlagen: {error}
es: Error al extraer: {error}
fr: Échec du pull : {error}
it: Pull fallito: {error}
ru: Ошибка извлечения: {error}
tr: Çekme başarısız: {error}
zh: 拉取失败：{error}

# snackbarPushedTo
source: Pushed to "{remoteName}"
ar: تم الدفع إلى "{remoteName}"
de: Zu "{remoteName}" gepusht
es: Enviado a "{remoteName}"
fr: Poussé vers "{remoteName}"
it: Inviato a "{remoteName}"
ru: Отправлено в "{remoteName}"
tr: "{remoteName}" adresine gönderildi
zh: 已推送到"{remoteName}"

# snackbarFailedToPush
source: Failed to push: {error}
ar: فشل الدفع: {error}
de: Pushen fehlgeschlagen: {error}
es: Error al enviar: {error}
fr: Échec du push : {error}
it: Push fallito: {error}
ru: Ошибка отправки: {error}
tr: Gönderme başarısız: {error}
zh: 推送失败：{error}
