Repository: kartalbas/flutter-gitui
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# hintTextSearchCommits
source: Search commits (try: author:john, hash:abc123, date:today)
ar: البحث في الالتزامات (جرب: author:john, hash:abc123, date:today)
de: Commits durchsuchen (versuchen Sie: author:john, hash:abc123, date:today)
es: Buscar commits (prueba: author:john, hash:abc123, date:today)
fr: Rechercher des commits (essayez : author:john, hash:abc123, date:today)
it: Cerca commit (prova: author:john, hash:abc123, date:today)
ru: Поиск коммитов (попробуйте: author:john, hash:abc123, date:today)
tr: Commit ara (deneyin: author:john, hash:abc123, date:today)
zh: 搜索提交（尝试：author:john, hash:abc123, date:today）

# hintTextSearchStashes
source: Search stashes...
ar: البحث في المخبوءات...
de: Stashes durchsuchen...
es: Buscar stashes...
fr: Rechercher des stashes...
it: Cerca stash...
ru: Поиск сохранений...
tr: Saklama ara...
zh: 搜索储藏...

# dialogTitleNoMergeInProgress
source: No merge in progress
ar: لا يوجد دمج قيد التقدم
de: Kein Merge läuft
es: No hay fusión en progreso
fr: Aucune fusion en cours
it: Nessuna fusione in corso
ru: Нет активного слияния
tr: Devam eden birleştirme yok
zh: 没有正在进行的合并

# dialogTitleResolveConflicts
source: Resolve Conflicts: {branchName}
ar: حل التعارضات: {branchName}
de: Konflikte lösen: {branchName}
es: Resolver conflictos: {branchName}
fr: Résoudre les conflits : {branchName}
it: Risolvi conflitti: {branchName}
ru: Разрешить конфликты: {branchName}
tr: Çakışmaları çöz: {branchName}
zh: 解决冲突：{branchName}

# dialogContentSelectConflict
source: Select a conflict to resolve
ar: حدد تعارضًا للحل
de: Wählen Sie einen Konflikt zum Lösen
es: Seleccione un conflicto para resolver
fr: Sélectionnez un conflit à résoudre
it: Seleziona un conflitto da risolvere
ru: Выберите конфликт для разрешения
tr: Çözmek için bir çakışma seçin
zh: 选择要解决的冲突

# dialogContentChooseResolutionStrategy
source: Choose resolution strategy:
ar: اختر استراتيجية الحل:
de: Wählen Sie eine Lösungsstrategie:
es: Elija una estrategia de resolución:
fr: Choisissez une stratégie de résolution :
it: Scegli una strategia di risoluzione:
ru: Выберите стратегию разрешения:
tr: Bir çözüm stratejisi seçin:
zh: 选择解决策略：

# dialogContentManualResolutionInfo
source: You can also edit the file manually in your preferred editor to resolve conflicts, then stage the file using the Changes screen.
ar: يمكنك أيضًا تحرير الملف يدويًا في المحرر المفضل لديك لحل التعارضات، ثم تجهيز الملف باستخدام شاشة التغييرات.
de: Sie können die Datei auch manuell in Ihrem bevorzugten Editor bearbeiten, um Konflikte zu lösen, und dann die Datei über den Änderungsbildschirm bereitstellen.
es: También puede editar el archivo manualmente en su editor preferido para resolver conflictos, luego prepare el archivo usando la pantalla de Cambios.
fr: Vous pouvez également modifier le fichier manuellement dans votre éditeur préféré pour résoudre les conflits, puis mettre en attente le fichier à l'aide de l'écran Modifications.
it: Puoi anche modificare il file manualmente nel tuo editor preferito per risolvere i conflitti, quindi preparare il file utilizzando la schermata Modifiche.
ru: Вы также можете вручную отредактировать файл в предпочитаемом редакторе для разрешения конфликтов, затем подготовить файл, используя экран Изменения.
tr: Çakışmaları çözmek için dosyayı tercih ettiğiniz editörde manuel olarak da düzenleyebilir, ardından Değişiklikler ekranını kullanarak dosyayı hazırlayabilirsiniz.
zh: 您也可以在首选编辑器中手动编辑文件来解决冲突，然后使用更改屏幕暂存文件。

# dialogContentAllMergeConflictsResolved
source: All merge conflicts have been resolved.
ar: تم حل جميع تعارضات الدمج.
de: Alle Merge-Konflikte wurden gelöst.
es: Todos los conflictos de fusión han sido resueltos.
fr: Tous les conflits de fusion ont été résolus.
it: Tutti i conflitti di fusione sono stati risolti.
ru: Все конфликты слияния были разрешены.
tr: Tüm birleştirme çakışmaları çözüldü.
zh: 所有合并冲突已解决。

# dialogContentFailedToResolveConflict
source: Failed to resolve conflict: {error}
ar: فشل حل التعارض: {error}
de: Konflikt konnte nicht gelöst werden: {error}
es: Fallo al resolver conflicto: {error}
fr: Échec de la résolution du conflit : {error}
it: Risoluzione del conflitto fallita: {error}
ru: Не удалось разрешить конфликт: {error}
tr: Çakışma çözülemedi: {error}
zh: 解决冲突失败：{error}

# dialogContentFailedToContinueMerge
source: Failed to continue merge: {error}
ar: فشل متابعة الدمج: {error}
de: Merge konnte nicht fortgesetzt werden: {error}
es: Fallo al continuar la fusión: {error}
fr: Échec de la poursuite de la fusion : {error}
it: Continuazione della fusione fallita: {error}
ru: Не удалось продолжить слияние: {error}
tr: Birleştirme devam ettirilemedi: {error}
zh: 继续合并失败：{error}

# dialogContentFailedToAbortMerge
source: Failed to abort merge: {error}
ar: فشل إلغاء الدمج: {error}
de: Merge konnte nicht abgebrochen werden: {error}
es: Fallo al abortar la fusión: {error}
fr: Échec de l'annulation de la fusion : {error}
it: Annullamento della fusione fallito: {error}
ru: Не удалось прервать слияние: {error}
tr: Birleştirme iptal edilemedi: {error}
zh: 中止合并失败：{error}

# dialogTitleContinueMerge
source: Continue Merge
ar: متابعة الدمج
de: Merge fortsetzen
es: Continuar fusión
fr: Continuer la fusion
it: Continua fusione
ru: Продолжить слияние
tr: Birleştirmeye devam et
zh: 继续合并

# dialogContentContinueMerge
source: This will complete the merge and create a merge commit. Continue?
ar: سيؤدي هذا إلى إكمال الدمج وإنشاء التزام دمج. متابعة؟
de: Dies wird den Merge abschließen und einen Merge-Commit erstellen. Fortfahren?
es: Esto completará la fusión y creará un commit de fusión. ¿Continuar?
fr: Cela va compléter la fusion et créer un commit de fusion. Continuer ?
it: Questo completerà la fusione e creerà un commit di fusione. Continuare?
ru: Это завершит слияние и создаст коммит слияния. Продолжить?
tr: Bu, birleştirmeyi tamamlayacak ve bir birleştirme kaydı oluşturacak. Devam edilsin mi?
zh: 这将完成合并并创建合并提交。继续？

# dialogActionContinue
source: Continue
ar: متابعة
de: Fortsetzen
es: Continuar
fr: Continuer
it: Continua
ru: Продолжить
tr: Devam et
zh: 继续

# dialogTitleAbortMerge
source: Abort Merge
ar: إلغاء الدمج
de: Merge abbrechen
es: Abortar fusión
fr: Annuler la fusion
it: Annulla fusione
ru: Прервать слияние
tr: Birleştirmeyi iptal et
zh: 中止合并

# dialogContentAbortMerge
source: This will abort the merge and return to the state before merging. All conflict resolutions will be lost. Continue?
ar: سيؤدي هذا إلى إلغاء الدمج والعودة إلى الحالة قبل الدمج. سيتم فقدان جميع حلول التعارضات. متابعة؟
de: Dies wird den Merge abbrechen und zum Zustand vor dem Merge zurückkehren. Alle Konfliktlösungen gehen verloren. Fortfahren?
es: Esto abortará la fusión y volverá al estado antes de fusionar. Todas las resoluciones de conflictos se perderán. ¿Continuar?
fr: Cela va annuler la fusion et revenir à l'état avant la fusion. Toutes les résolutions de conflits seront perdues. Continuer ?
it: Questo annullerà la fusione e tornerà allo stato prima della fusione. Tutte le risoluzioni dei conflitti saranno perse. Continuare?
ru: Это прервёт слияние и вернёт состояние до слияния. Все разрешения конфликтов будут потеряны. Продолжить?
tr: Bu, birleştirmeyi iptal edecek ve birleştirme öncesi duruma geri dönecektir. Tüm çakışma çözümleri kaybolacaktır. Devam edilsin mi?
zh: 这将中止合并并返回到合并前的状态。所有冲突解决将丢失。继续？

# dialogContentResolvedConflict
source: Resolved {fileName} using {choice}
ar: تم حل {fileName} باستخدام {choice}
de: {fileName} mit {choice} gelöst
es: Resuelto {fileName} usando {choice}
fr: Résolu {fileName} en utilisant {choice}
it: Risolto {fileName} usando {choice}
ru: Разрешён {fileName} используя {choice}
tr: {fileName} {choice} kullanılarak çözüldü
zh: 使用 {choice} 解决了 {fileName}

# dialogContentDeleteWorkspace
source: Are you sure you want to delete "{workspaceName}"? Repositories will not be deleted.
ar: هل أنت متأكد من أنك تريد حذف "{workspaceName}"؟ لن يتم حذف المستودعات.
de: Möchten Sie "{workspaceName}" wirklich löschen? Repositories werden nicht gelöscht.
es: ¿Está seguro de que desea eliminar "{workspaceName}"? Los repositorios no serán eliminados.
fr: Êtes-vous sûr de vouloir supprimer "{workspaceName}" ? Les dépôts ne seront pas supprimés.
it: Sei sicuro di voler eliminare "{workspaceName}"? I repository non saranno eliminati.
ru: Вы уверены, что хотите удалить "{workspaceName}"? Репозитории не будут удалены.
tr: "{workspaceName}" öğesini silmek istediğinizden emin misiniz? Depolar silinmeyecektir.
zh: 您确定要删除"{workspaceName}"吗？存储库不会被删除。

# dialogTitleRenameFile
source: Rename File
ar: إعادة تسمية الملف
de: Datei umbenennen
es: Renombrar archivo
fr: Renommer le fichier
it: Rinomina file
ru: Переименовать файл
tr: Dosyayı yeniden adlandır
zh: 重命名文件

# dialogLabelNewName
source: New name
ar: اسم جديد
de: Neuer Name
es: Nuevo nombre
fr: Nouveau nom
it: Nuovo nome
ru: Новое имя
tr: Yeni ad
zh: 新名称

# dialogActionRename
source: Rename
ar: إعادة تسمية
de: Umbenennen
es: Renombrar
fr: Renommer
it: Rinomina
ru: Переименовать
tr: Yeniden adlandır
zh: 重命名

# dialogTitleDeleteFile
source: Delete File
ar: حذف الملف
de: Datei löschen
es: Eliminar archivo
fr: Supprimer le fichier
it: Elimina file
ru: Удалить файл
tr: Dosyayı sil
zh: 删除文件

# dialogContentDeleteFile
source: Are you sure you want to delete "{fileName}"? This action cannot be undone.
ar: هل أنت متأكد من أنك تريد حذف "{fileName}"؟ لا يمكن التراجع عن هذا الإجراء.
de: Möchten Sie "{fileName}" wirklich löschen? Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Está seguro de que desea eliminar "{fileName}"? Esta acción no se puede deshacer.
fr: Êtes-vous sûr de vouloir supprimer "{fileName}" ? Cette action ne peut pas être annulée.
it: Sei sicuro di voler eliminare "{fileName}"? Questa azione non può essere annullata.
ru: Вы уверены, что хотите удалить "{fileName}"? Это действие нельзя отменить.
tr: "{fileName}" öğesini silmek istediğinizden emin misiniz? Bu işlem geri alınamaz.
zh: 您确定要删除"{fileName}"吗？ 此操作无法撤消。

# dialogTitleCopyFile
source: Copy File
ar: نسخ الملف
de: Datei kopieren
es: Copiar archivo
fr: Copier le fichier
it: Copia file
ru: Копировать файл
tr: Dosyayı kopyala
zh: 复制文件

# dialogTitleFileExists
source: File Exists
ar: الملف موجود
de: Datei existiert
es: El archivo existe
fr: Le fichier existe
it: Il file esiste
ru: Файл существует
tr: Dosya mevcut
zh: 文件已存在

# dialogContentCopyFileExists
source: A file with the name "{fileName}" already exists in this location. What would you like to do?
ar: يوجد ملف بالاسم "{fileName}" في هذا الموقع. ماذا تريد أن تفعل؟
de: Eine Datei mit dem Namen "{fileName}" existiert bereits an diesem Ort. Was möchten Sie tun?
es: Ya existe un archivo con el nombre "{fileName}" en esta ubicación. ¿Qué desea hacer?
fr: Un fichier nommé "{fileName}" existe déjà à cet emplacement. Que voulez-vous faire ?
it: Un file con il nome "{fileName}" esiste già in questa posizione. Cosa vuoi fare?
ru: Файл с именем "{fileName}" уже существует в этом расположении. Что вы хотите сделать?
tr: "{fileName}" adında bir dosya bu konumda zaten mevcut. Ne yapmak istersiniz?
zh: 此位置已存在名为"{fileName}"的文件。 您要做什么？

# dialogContentFileExistsDestination
source: {fileName} already exists in the destination. What would you like to do?
ar: {fileName} موجود بالفعل في الوجهة. ماذا تريد أن تفعل؟
de: {fileName} existiert bereits am Zielort. Was möchten Sie tun?
es: {fileName} ya existe en el destino. ¿Qué desea hacer?
fr: {fileName} existe déjà dans la destination. Que voulez-vous faire ?
it: {fileName} esiste già nella destinazione. Cosa vuoi fare?
ru: {fileName} уже существует в месте назначения. Что вы хотите сделать?
tr: {fileName} hedefte zaten mevcut. Ne yapmak istersiniz?
zh: {fileName} 已存在于目标位置。 您要做什么？

# dialogActionKeepBoth
source: Keep Both
ar: احتفظ بكليهما
de: Beide behalten
es: Mantener ambos
fr: Conserver les deux
it: Mantieni entrambi
ru: Сохранить оба
tr: İkisini de tut
zh: 保留两者

# contextMenuRename
source: Rename
ar: إعادة تسمية
de: Umbenennen
es: Renombrar
fr: Renommer
it: Rinomina
ru: Переименовать
tr: Yeniden adlandır
zh: 重命名

# contextMenuCopyPath
source: Copy Path
ar: نسخ المسار
de: Pfad kopieren
es: Copiar ruta
fr: Copier le chemin
it: Copia percorso
ru: Копировать путь
tr: Yolu kopyala
zh: 复制路径

# contextMenuRevealInExplorer
source: Reveal in Explorer
ar: إظهار في المستكشف
de: Im Explorer anzeigen
es: Mostrar en el Explorador
fr: Révéler dans l'Explorateur
it: Mostra in Esplora risorse
ru: Показать в Проводнике
tr: Gezgin'de göster
zh: 在资源管理器中显示

# snackbarRenamedTo
source: Renamed to {newName}
ar: تمت إعادة التسمية إلى {newName}
de: Umbenannt zu {newName}
es: Renombrado a {newName}
fr: Renommé en {newName}
it: Rinominato in {newName}
ru: Переименован в {newName}
tr: {newName} olarak yeniden adlandırıldı
zh: 已重命名为 {newName}

# snackbarCopiedFile
source: Copied: {fileName}
ar: تم النسخ: {fileName}
de: Kopiert: {fileName}
es: Copiado: {fileName}
fr: Copié : {fileName}
it: Copiato: {fileName}
ru: Скопировано: {fileName}
tr: Kopyalandı: {fileName}
zh: 已复制：{fileName}

# snackbarPastedFile
source: Pasted: {fileName}
ar: تم اللصق: {fileName}
de: Eingefügt: {fileName}
es: Pegado: {fileName}
fr: Collé : {fileName}
it: Incollato: {fileName}
ru: Вставлено: {fileName}
tr: Yapıştırıldı: {fileName}
zh: 已粘贴：{fileName}

# snackbarDeletedFile
source: Deleted: {fileName}
ar: تم الحذف: {fileName}
de: Gelöscht: {fileName}
es: Eliminado: {fileName}
fr: Supprimé : {fileName}
it: Eliminato: {fileName}
ru: Удалено: {fileName}
tr: Silindi: {fileName}
zh: 已删除：{fileName}

# dialogTitleDeleteTag
source: Delete Tag?
ar: حذف الوسم؟
de: Tag löschen?
es: ¿Eliminar etiqueta?
fr: Supprimer l'étiquette ?
it: Eliminare tag?
ru: Удалить тег?
tr: Etiketi sil?
zh: 删除标签？

# dialogContentDeleteTagLocal
source: Delete tag "{tagName}"? This tag is local only and will be deleted from your repository. This action cannot be undone.
ar: حذف الوسم "{tagName}"؟ هذا الوسم محلي فقط وسيتم حذفه من المستودع الخاص بك. لا يمكن التراجع عن هذا الإجراء.
de: Tag "{tagName}" löschen? Dieser Tag ist nur lokal und wird aus Ihrem Repository gelöscht. Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Eliminar etiqueta "{tagName}"? Esta etiqueta es solo local y será eliminada de su repositorio. Esta acción no se puede deshacer.
fr: Supprimer l'étiquette "{tagName}" ? Cette étiquette est locale uniquement et sera supprimée de votre dépôt. Cette action ne peut pas être annulée.
it: Eliminare il tag "{tagName}"? Questo tag è solo locale e verrà eliminato dal tuo repository. Questa azione non può essere annullata.
ru: Удалить тег "{tagName}"? Этот тег существует только локально и будет удалён из вашего репозитория. Это действие нельзя отменить.
tr: "{tagName}" etiketini sil? Bu etiket yalnızca yereldir ve deponuzdan silinecektir. Bu işlem geri alınamaz.
zh: 删除标签"{tagName}"？ 此标签仅在本地，将从您的存储库中删除。 此操作无法撤消。

# dialogContentDeleteTagRemote
source: Delete tag "{tagName}"? This tag exists on the remote and will be deleted from BOTH local and remote repositories. This action cannot be undone.
ar: حذف الوسم "{tagName}"؟ هذا الوسم موجود على الخادم البعيد وسيتم حذفه من كلا المستودعين المحلي والبعيد. لا يمكن التراجع عن هذا الإجراء.
de: Tag "{tagName}" löschen? Dieser Tag existiert auf dem Remote und wird sowohl lokal als auch auf dem Remote gelöscht. Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Eliminar etiqueta "{tagName}"? Esta etiqueta existe en el remoto y será eliminada tanto local como remotamente. Esta acción no se puede deshacer.
fr: Supprimer l'étiquette "{tagName}" ? Cette étiquette existe sur le distant et sera supprimée à la fois localement et sur le distant. Cette action ne peut pas être annulée.
it: Eliminare il tag "{tagName}"? Questo tag esiste sul remoto e verrà eliminato sia localmente che sul remoto. Questa azione non può essere annullata.
ru: Удалить тег "{tagName}"? Этот тег существует на удалённом сервере и будет удалён как локально, так и удалённо. Это действие нельзя отменить.
tr: "{tagName}" etiketini sil? Bu etiket uzak sunucuda mevcuttur ve hem yerel hem de uzak depolardan silinecektir. Bu işlem geri alınamaz.
zh: 删除标签"{tagName}"？ 此标签存在于远程，将从本地和远程存储库中删除。 此操作无法撤消。

# progressDeletingTagLocalRemote
source: Deleting Tag (Local & Remote)
ar: حذف الوسم (محلي وبعيد)
de: Tag löschen (Lokal & Remote)
es: Eliminando etiqueta (Local y Remoto)
fr: Suppression de l'étiquette (Local et Distant)
it: Eliminazione tag (Locale e Remoto)
ru: Удаление тега (Локально и удалённо)
tr: Etiket siliniyor (Yerel ve Uzak)
zh: 删除标签（本地和远程）

# progressDeletingTag
source: Deleting Tag
ar: حذف الوسم
de: Tag löschen
es: Eliminando etiqueta
fr: Suppression de l'étiquette
it: Eliminazione tag
ru: Удаление тега
tr: Etiket siliniyor
zh: 删除标签

# progressDeletingTagLocally
source: Deleting "{tagName}" locally...
ar: حذف "{tagName}" محليًا...
de: "{tagName}" lokal löschen...
es: Eliminando "{tagName}" localmente...
fr: Suppression de "{tagName}" localement...
it: Eliminazione di "{tagName}" localmente...
ru: Удаление "{tagName}" локально...
tr: "{tagName}" yerel olarak siliniyor...
zh: 正在本地删除"{tagName}"...

# progressDeletingTagFromRemote
source: Deleting "{tagName}" from {remoteName}...
ar: حذف "{tagName}" من {remoteName}...
de: "{tagName}" von {remoteName} löschen...
es: Eliminando "{tagName}" de {remoteName}...
fr: Suppression de "{tagName}" de {remoteName}...
it: Eliminazione di "{tagName}" da {remoteName}...
ru: Удаление "{tagName}" из {remoteName}...
tr: "{tagName}" {remoteName} üzerinden siliniyor...
zh: 正在从 {remoteName} 删除"{tagName}"...

# progressUpdatingList
source: Updating list...
ar: تحديث القائمة...
de: Liste aktualisieren...
es: Actualizando lista...
fr: Mise à jour de la liste...
it: Aggiornamento elenco...
ru: Обновление списка...
tr: Liste güncelleniyor...
zh: 正在更新列表...

# snackbarTagDeletedLocalAndRemote
source: Tag "{tagName}" deleted from local and remote
ar: تم حذف الوسم "{tagName}" من المحلي والبعيد
de: Tag "{tagName}" lokal und auf dem Remote gelöscht
es: Etiqueta "{tagName}" eliminada local y remotamente
fr: Étiquette "{tagName}" supprimée localement et sur le distant
it: Tag "{tagName}" eliminato localmente e sul remoto
ru: Тег "{tagName}" удалён локально и удалённо
tr: "{tagName}" etiketi yerel ve uzak sunucudan silindi
zh: 标签"{tagName}"已从本地和远程删除

# tagDetailsType
source: Type
ar: النوع
de: Typ
es: Tipo
it: Tipo
ru: Тип
tr: Tür
zh: 类型

# tagDetailsCommit
source: Commit
ar: الالتزام
ru: Коммит
tr: Kayıt
zh: 提交

# tagDetailsTagger
source: Tagger
ar: الموسم
es: Etiquetador
fr: Étiqueteur
it: Autore tag
ru: Автор тега
tr: Etiketleyen
zh: 标签者

# tagDetailsDate
source: Date
ar: التاريخ
de: Datum
es: Fecha
it: Data
ru: Дата
tr: Tarih
zh: 日期

# tagDetailsMessage
source: Message:
ar: الرسالة:
de: Nachricht:
es: Mensaje:
it: Messaggio:
ru: Сообщение:
tr: Mesaj:
zh: 消息：

# tagTypeAnnotated
source: Annotated
ar: موسوم
de: Annotiert
es: Anotada
fr: Annotée
it: Annotato
ru: Аннотированный
tr: Açıklamalı
zh: 带注释

# tagTypeLightweight
source: Lightweight
ar: خفيف
de: Leichtgewichtig
es: Ligera
fr: Légère
it: Leggero
ru: Лёгкий
tr: Hafif
zh: 轻量级

# dialogTitleWebBrowserLimitation
source: Web Browser Limitation
ar: قيود متصفح الويب
de: Webbrowser-Einschränkung
es: Limitación del navegador web
fr: Limitation du navigateur Web
it: Limitazione del browser Web
ru: Ограничение веб-браузера
tr: Web Tarayıcı Kısıtlaması
zh: Web 浏览器限制

# dialogContentWebBrowserLimitationChanges
source: Folder selection is not available in web browsers. To use Flutter GitUI with full functionality, please run as a desktop application: flutter run -d windows This requires Visual Studio 2022 with "Desktop development with C++" installed.
ar: تحديد المجلد غير متاح في متصفحات الويب. لاستخدام Flutter GitUI بكامل الوظائف، يرجى التشغيل كتطبيق سطح مكتب: flutter run -d windows يتطلب ذلك Visual Studio 2022 مع "Desktop development with C++" المثبت.
de: Ordnerauswahl ist in Webbrowsern nicht verfügbar. Um Flutter GitUI mit voller Funktionalität zu nutzen, führen Sie es bitte als Desktop-Anwendung aus: flutter run -d windows Dies erfordert Visual Studio 2022 mit "Desktop development with C++" installiert.
es: La selección de carpetas no está disponible en navegadores web. Para usar Flutter GitUI con funcionalidad completa, ejecútelo como aplicación de escritorio: flutter run -d windows Esto requiere Visual Studio 2022 con "Desktop development with C++" instalado.
fr: La sélection de dossiers n'est pas disponible dans les navigateurs Web. Pour utiliser Flutter GitUI avec toutes les fonctionnalités, veuillez l'exécuter en tant qu'application de bureau : flutter run -d windows Cela nécessite Visual Studio 2022 avec "Desktop development with C++" installé.
it: La selezione delle cartelle non è disponibile nei browser Web. Per utilizzare Flutter GitUI con funzionalità complete, eseguilo come applicazione desktop: flutter run -d windows Richiede Visual Studio 2022 con "Desktop development with C++" installato.
ru: Выбор папок недоступен в веб-браузерах. Для использования Flutter GitUI с полной функциональностью запустите его как настольное приложение: flutter run -d windows Это требует Visual Studio 2022 с установленным "Desktop development with C++".
tr: Klasör seçimi web tarayıcılarında kullanılamaz. Flutter GitUI'yi tam işlevsellikle kullanmak için masaüstü uygulaması olarak çalıştırın: flutter run -d windows Bu, "Desktop development with C++" yüklü Visual Studio 2022 gerektirir.
zh: 文件夹选择在 Web 浏览器中不可用。 要使用 Flutter GitUI 的完整功能，请作为桌面应用程序运行： flutter run -d windows 这需要安装了"Desktop development with C++"的 Visual Studio 2022。

# dialogContentWebBrowserLimitationRepositories
source: Folder selection is not available in web browsers. To use Flutter GitUI with full functionality, please run as a desktop application.
ar: تحديد المجلد غير متاح في متصفحات الويب. لاستخدام Flutter GitUI بكامل الوظائف، يرجى التشغيل كتطبيق سطح مكتب.
de: Ordnerauswahl ist in Webbrowsern nicht verfügbar. Um Flutter GitUI mit voller Funktionalität zu nutzen, führen Sie es bitte als Desktop-Anwendung aus.
es: La selección de carpetas no está disponible en navegadores web. Para usar Flutter GitUI con funcionalidad completa, ejecútelo como aplicación de escritorio.
fr: La sélection de dossiers n'est pas disponible dans les navigateurs Web. Pour utiliser Flutter GitUI avec toutes les fonctionnalités, veuillez l'exécuter en tant qu'application de bureau.
it: La selezione delle cartelle non è disponibile nei browser Web. Per utilizzare Flutter GitUI con funzionalità complete, eseguilo come applicazione desktop.
ru: Выбор папок недоступен в веб-браузерах. Для использования Flutter GitUI с полной функциональностью запустите его как настольное приложение.
tr: Klasör seçimi web tarayıcılarında kullanılamaz. Flutter GitUI'yi tam işlevsellikle kullanmak için masaüstü uygulaması olarak çalıştırın.
zh: 文件夹选择在 Web 浏览器中不可用。 要使用 Flutter GitUI 的完整功能，请作为桌面应用程序运行。
