Repository: kartalbas/flutter-gitui
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

source: Force pushing to remote...
ar: الدفع القسري إلى البعيد...
de: Erzwinge Push zu Remote...
es: Forzando envío al remoto...
fr: Forcer le push vers le distant...
it: Caricamento forzato sul remoto...
ru: Принудительная отправка на удалённый...
tr: Uzak sunucuya zorla gönderiliyor...
zh: 强制推送到远程...

source: Pushing to remote...
ar: الدفع إلى البعيد...
de: Push zu Remote...
es: Enviando al remoto...
fr: Push vers le distant...
it: Caricamento sul remoto...
ru: Отправка на удалённый...
tr: Uzak sunucuya gönderiliyor...
zh: 推送到远程...

source: Remove
ar: إزالة
de: Entfernen
es: Eliminar
fr: Supprimer
it: Rimuovi
ru: Удалить
tr: Kaldır
zh: 移除

source: Error loading commits
ar: خطأ في تحميل الـ commits
de: Fehler beim Laden der Commits
es: Error al cargar commits
fr: Erreur de chargement des commits
it: Errore nel caricamento dei commit
ru: Ошибка загрузки коммитов
tr: Commit'ler yüklenirken hata
zh: 加载提交时出错

source: Config and Logs
ar: الإعدادات والسجلات
de: Konfiguration und Protokolle
es: Configuración y registros
fr: Config et journaux
it: Configurazione e registri
ru: Конфигурация и журналы
tr: Yapılandırma ve günlükler
zh: 配置和日志

source: Open app.log
ar: فتح app.log
de: app.log öffnen
es: Abrir app.log
fr: Ouvrir app.log
it: Apri app.log
ru: Открыть app.log
tr: app.log'u aç
zh: 打开 app.log

source: Open git.log
ar: فتح git.log
de: git.log öffnen
es: Abrir git.log
fr: Ouvrir git.log
it: Apri git.log
ru: Открыть git.log
tr: git.log'u aç
zh: 打开 git.log

source: Open Config Folder
ar: فتح مجلد الإعدادات
de: Konfigurationsordner öffnen
es: Abrir carpeta de configuración
fr: Ouvrir le dossier de configuration
it: Apri cartella configurazione
ru: Открыть папку конфигурации
tr: Yapılandırma klasörünü aç
zh: 打开配置文件夹

source: Delete app.log
ar: حذف app.log
de: app.log löschen
es: Eliminar app.log
fr: Supprimer app.log
it: Elimina app.log
ru: Удалить app.log
tr: app.log'u sil
zh: 删除 app.log

source: Delete git.log
ar: حذف git.log
de: git.log löschen
es: Eliminar git.log
fr: Supprimer git.log
it: Elimina git.log
ru: Удалить git.log
tr: git.log'u sil
zh: 删除 git.log

source: All Workspaces
ar: جميع مساحات العمل
de: Alle Arbeitsbereiche
es: Todos los espacios de trabajo
fr: Tous les espaces de travail
it: Tutti gli spazi di lavoro
ru: Все рабочие пространства
tr: Tüm çalışma alanları
zh: 所有工作区

source: Animation Speed
ar: سرعة الرسوم المتحركة
de: Animationsgeschwindigkeit
es: Velocidad de animación
fr: Vitesse d'animation
it: Velocità animazione
ru: Скорость анимации
tr: Animasyon hızı
zh: 动画速度

# animationSpeedFast
source: Fast
ar: سريع
de: Schnell
es: Rápida
fr: Rapide
it: Veloce
ru: Быстрая
tr: Hızlı
zh: 快速

# animationSpeedInfo
source: Controls the speed of UI animations like menus, dialogs, and transitions. Select 'None' to disable animations for better accessibility or faster response.
ar: يتحكم في سرعة الرسوم المتحركة للواجهة مثل القوائم والحوارات والانتقالات. حدد 'بدون' لتعطيل الرسوم المتحركة لتحسين إمكانية الوصول أو الاستجابة الأسرع.
de: Steuert die Geschwindigkeit von UI-Animationen wie Menüs, Dialogen und Übergängen. Wählen Sie 'Keine', um Animationen für bessere Zugänglichkeit oder schnellere Reaktion zu deaktivieren.
es: Controla la velocidad de las animaciones de la interfaz como menús, diálogos y transiciones. Seleccione 'Ninguna' para deshabilitar las animaciones para mejor accesibilidad o respuesta más rápida.
fr: Contrôle la vitesse des animations de l'interface comme les menus, dialogues et transitions. Sélectionnez 'Aucune' pour désactiver les animations pour une meilleure accessibilité ou une réponse plus rapide.
it: Controlla la velocità delle animazioni dell'interfaccia come menu, dialoghi e transizioni. Seleziona 'Nessuna' per disabilitare le animazioni per una migliore accessibilità o risposta più rapida.
ru: Управляет скоростью анимации интерфейса, таких как меню, диалоги и переходы. Выберите 'Нет' для отключения анимации для лучшей доступности или более быстрого отклика.
tr: Menüler, diyaloglar ve geçişler gibi arayüz animasyonlarının hızını kontrol eder. Daha iyi erişilebilirlik veya daha hızlı yanıt için animasyonları devre dışı bırakmak için 'Yok' seçin.
zh: 控制菜单、对话框和过渡等界面动画的速度。选择'无'可禁用动画以获得更好的可访问性或更快的响应。

# animationSpeedNone
source: None (Instant)
ar: بدون (فوري)
de: Keine (Sofort)
es: Ninguna (Instantánea)
fr: Aucune (Instantané)
it: Nessuna (Istantanea)
ru: Нет (Мгновенно)
tr: Yok (Anında)
zh: 无（即时）

# animationSpeedNormal
source: Normal
ar: عادي
fr: Normale
it: Normale
ru: Нормальная
zh: 正常

# animationSpeedSlow
source: Slow
ar: بطيء
de: Langsam
es: Lenta
fr: Lente
it: Lenta
ru: Медленная
tr: Yavaş
zh: 慢速

source: Animation speed updated
ar: تم تحديث سرعة الرسوم المتحركة
de: Animationsgeschwindigkeit aktualisiert
es: Velocidad de animación actualizada
fr: Vitesse d'animation mise à jour
it: Velocità animazione aggiornata
ru: Скорость анимации обновлена
tr: Animasyon hızı güncellendi
zh: 动画速度已更新

source: Animations
ar: الرسوم المتحركة
de: Animationen
es: Animaciones
it: Animazioni
ru: Анимации
tr: Animasyonlar
zh: 动画

# branchNameRequired
source: Branch name is required
ar: اسم الفرع مطلوب
de: Branch-Name ist erforderlich
es: Se requiere el nombre de la rama
fr: Le nom de la branche est requis
it: Il nome del ramo è richiesto
ru: Требуется имя ветки
tr: Dal adı gerekli
zh: 需要分支名称

source: Checkout branch after creation
ar: التبديل إلى الفرع بعد الإنشاء
de: Branch nach Erstellung auschecken
es: Cambiar a la rama después de crearla
fr: Basculer vers la branche après création
it: Passa al ramo dopo la creazione
ru: Переключиться на ветку после создания
tr: Oluşturulduktan sonra dala geç
zh: 创建后切换分支

# checkoutBranchAfterCreationHint
source: Switch to the new branch immediately
ar: التبديل إلى الفرع الجديد فورًا
de: Sofort zum neuen Branch wechseln
es: Cambiar a la nueva rama inmediatamente
fr: Basculer immédiatement vers la nouvelle branche
it: Passa immediatamente al nuovo ramo
ru: Немедленно переключиться на новую ветку
tr: Hemen yeni dala geç
zh: 立即切换到新分支

source: Create Branch from Tag
ar: إنشاء فرع من وسم
de: Branch von Tag erstellen
es: Crear rama desde etiqueta
fr: Créer une branche depuis un tag
it: Crea ramo da tag
ru: Создать ветку из тега
tr: Etiket'ten dal oluştur
zh: 从标签创建分支

source: Delete All
ar: حذف الكل
de: Alle löschen
es: Eliminar todo
fr: Tout supprimer
it: Elimina tutto
ru: Удалить все
tr: Tümünü sil
zh: 全部删除

source: Delete all unprotected branches
ar: حذف جميع الفروع غير المحمية
de: Alle ungeschützten Branches löschen
es: Eliminar todas las ramas no protegidas
fr: Supprimer toutes les branches non protégées
it: Elimina tutti i rami non protetti
ru: Удалить все незащищённые ветки
tr: Tüm korumasız dalları sil
zh: 删除所有未受保护的分支

# deleteAllUnprotectedBranchesConfirm
source: This will delete {count} branch(es):
ar: سيؤدي هذا إلى حذف {count} فرع(فروع):
de: Dies wird {count} Branch(es) löschen:
es: Esto eliminará {count} rama(s):
fr: Cela supprimera {count} branche(s):
it: Questo eliminerà {count} ramo/i:
ru: Это удалит {count} ветку/и/ок:
tr: Bu {count} dalı silecek:
zh: 这将删除 {count} 个分支：

source: Delete Branch
ar: حذف الفرع
de: Branch löschen
es: Eliminar rama
fr: Supprimer la branche
it: Elimina ramo
ru: Удалить ветку
tr: Dalı sil
zh: 删除分支

# failedToRebaseBranch
source: Failed to rebase branch: {error}
ar: فشل إعادة بناء الفرع: {error}
de: Fehler beim Rebase des Branches: {error}
es: Error al rebasar la rama: {error}
fr: Échec du rebasage de la branche: {error}
it: Errore nel rebase del ramo: {error}
ru: Ошибка перебазирования ветки: {error}
tr: Dal yeniden tabanlandırma başarısız: {error}
zh: 变基分支失败：{error}

# fontSizeTiny
source: Tiny
ar: صغير جدًا
de: Winzig
es: Diminuta
fr: Minuscule
it: Minuscola
ru: Крошечный
tr: Çok küçük
zh: 极小

# forcePushFailed
source: Force push failed: {error}
ar: فشل الدفع القسري: {error}
de: Force Push fehlgeschlagen: {error}
es: Error en push forzado: {error}
fr: Échec du push forcé: {error}
it: Push forzato fallito: {error}
ru: Принудительная отправка не удалась: {error}
tr: Zorla gönderme başarısız: {error}
zh: 强制推送失败：{error}

# forcePushSuccessful
source: Successfully force pushed to remote
ar: تم الدفع القسري إلى البعيد بنجاح
de: Erfolgreich Force Push zu Remote durchgeführt
es: Push forzado al remoto exitoso
fr: Push forcé vers le distant réussi
it: Push forzato al remoto riuscito
ru: Успешно выполнена принудительная отправка на удалённый репозиторий
tr: Uzak sunucuya başarıyla zorla gönderildi
zh: 成功强制推送到远程

# includeRemoteBranchesInList
source: Include remote branches in the selection list
ar: تضمين الفروع البعيدة في قائمة الاختيار
de: Remote-Branches in die Auswahlliste einschließen
es: Incluir ramas remotas en la lista de selección
fr: Inclure les branches distantes dans la liste de sélection
it: Includi rami remoti nell'elenco di selezione
ru: Включить удалённые ветки в список выбора
tr: Seçim listesine uzak dalları dahil et
zh: 在选择列表中包含远程分支

# interactiveRebaseDescription
source: Edit commits during rebase (advanced)
ar: تحرير الـ commits أثناء إعادة البناء (متقدم)
de: Commits während des Rebase bearbeiten (erweitert)
es: Editar commits durante el rebase (avanzado)
fr: Éditer les commits pendant le rebasage (avancé)
it: Modifica commit durante il rebase (avanzato)
ru: Редактировать коммиты во время перебазирования (расширенное)
tr: Yeniden tabanlama sırasında commit'leri düzenle (gelişmiş)
zh: 在变基期间编辑提交（高级）

source: Merge Branches
ar: دمج الفروع
de: Branches zusammenführen
es: Fusionar ramas
fr: Fusionner les branches
it: Unisci rami
ru: Слить ветки
tr: Dalları birleştir
zh: 合并分支

source: Merge {source} into {target}
ar: دمج {source} في {target}
de: {source} in {target} zusammenführen
es: Fusionar {source} en {target}
fr: Fusionner {source} dans {target}
it: Unisci {source} in {target}
ru: Слить {source} в {target}
tr: {source} dalını {target} ile birleştir
zh: 将 {source} 合并到 {target}

source: Merging branches...
ar: دمج الفروع...
de: Führe Branches zusammen...
es: Fusionando ramas...
fr: Fusion des branches...
it: Unione rami...
ru: Слияние веток...
tr: Dallar birleştiriliyor...
zh: 正在合并分支...

source: Preserve Merges
ar: الحفاظ على عمليات الدمج
de: Merges beibehalten
es: Preservar fusiones
fr: Préserver les fusions
it: Preserva unioni
ru: Сохранить слияния
tr: Birleştirmeleri koru
zh: 保留合并

# preserveMergesDescription
source: Preserve merge commits in the rebased history
ar: الحفاظ على commits الدمج في سجل إعادة البناء
de: Merge-Commits in der Rebase-Historie beibehalten
es: Preservar commits de fusión en el historial rebasado
fr: Préserver les commits de fusion dans l'historique rebasé
it: Preserva commit di unione nella cronologia rebasata
ru: Сохранить коммиты слияния в перебазированной истории
tr: Yeniden tabanlanmış geçmişte birleştirme commit'lerini koru
zh: 在变基历史记录中保留合并提交

# previewFontFamily
source: Code Font
ar: خط الكود
de: Code-Schriftart
es: Fuente de código
fr: Police de code
it: Font del codice
ru: Шрифт кода
tr: Kod yazı tipi
zh: 代码字体

# previewFontSize
source: Code Font Size
ar: حجم خط الكود
de: Code-Schriftgröße
es: Tamaño de fuente de código
fr: Taille de police de code
it: Dimensione font del codice
ru: Размер шрифта кода
tr: Kod yazı tipi boyutu
zh: 代码字体大小

# protectedBranchesNotDeleted
source: Protected branches and the current branch will not be deleted.
ar: لن يتم حذف الفروع المحمية والفرع الحالي.
de: Geschützte Branches und der aktuelle Branch werden nicht gelöscht.
es: Las ramas protegidas y la rama actual no se eliminarán.
fr: Les branches protégées et la branche actuelle ne seront pas supprimées.
it: I rami protetti e il ramo corrente non saranno eliminati.
ru: Защищённые ветки и текущая ветка не будут удалены.
tr: Korunan dallar ve mevcut dal silinmeyecek.
zh: 受保护的分支和当前分支不会被删除。

source: Rebase
ar: إعادة البناء
es: Rebasar
fr: Rebaser
ru: Перебазировать
tr: Yeniden tabanla
zh: 变基

# rebaseHasConflicts
source: Rebase has conflicts: {count} file(s) need resolution
ar: إعادة البناء بها تعارضات: {count} ملف(ملفات) يحتاج لحل
de: Rebase hat Konflikte: {count} Datei(en) benötigen Lösung
es: El rebase tiene conflictos: {count} archivo(s) necesitan resolución
fr: Le rebasage a des conflits: {count} fichier(s) nécessitent une résolution
it: Il rebase ha conflitti: {count} file necessitano risoluzione
ru: Перебазирование имеет конфликты: {count} файл(ов) требуют разрешения
tr: Yeniden tabanlamada çakışmalar var: {count} dosya çözüm gerektiriyor
zh: 变基有冲突：{count} 个文件需要解决

source: Rebase Options
ar: خيارات إعادة البناء
de: Rebase-Optionen
es: Opciones de rebase
fr: Options de rebasage
it: Opzioni rebase
ru: Опции перебазирования
tr: Yeniden tabanlama seçenekleri
zh: 变基选项

source: Rebase {source} onto {target}
ar: إعادة بناء {source} على {target}
de: {source} auf {target} rebasen
es: Rebasar {source} sobre {target}
fr: Rebaser {source} sur {target}
it: Rebase di {source} su {target}
ru: Перебазировать {source} на {target}
tr: {source} dalını {target} üzerine yeniden tabanla
zh: 将 {source} 变基到 {target}

source: Rebasing branches...
ar: إعادة بناء الفروع...
de: Rebase Branches...
es: Rebasando ramas...
fr: Rebasage des branches...
it: Rebase rami...
ru: Перебазирование веток...
tr: Dallar yeniden tabanlanıyor...
zh: 正在变基分支...

# repositoryCount
source: {count} repositories
ar: {count} مستودعات
de: {count} Repositorys
es: {count} repositorios
fr: {count} dépôts
it: {count} repository
ru: {count} репозиториев
tr: {count} depo
zh: {count} 个仓库

# selectBothBranchesToMerge
source: Select both branches to merge/rebase
ar: حدد كلا الفرعين للدمج/إعادة البناء
de: Beide Branches zum Zusammenführen/Rebasen auswählen
es: Seleccionar ambas ramas para fusionar/rebasar
fr: Sélectionner les deux branches à fusionner/rebaser
it: Seleziona entrambi i rami da unire/rebasare
ru: Выберите обе ветки для слияния/перебазирования
tr: Birleştirmek/yeniden tabanlamak için her iki dalı seç
zh: 选择两个要合并/变基的分支

# selectSourceAndTargetBranches
source: Select source and target branches to merge or rebase
ar: حدد الفروع المصدر والهدف للدمج أو إعادة البناء
de: Quell- und Ziel-Branches zum Zusammenführen oder Rebasen auswählen
es: Seleccionar ramas de origen y destino para fusionar o rebasar
fr: Sélectionner les branches source et cible à fusionner ou rebaser
it: Seleziona rami sorgente e destinazione da unire o rebasare
ru: Выберите исходную и целевую ветки для слияния или перебазирования
tr: Birleştirmek veya yeniden tabanlamak için kaynak ve hedef dalları seç
zh: 选择要合并或变基的源分支和目标分支

source: Select source branch
ar: حدد الفرع المصدر
de: Quell-Branch auswählen
es: Seleccionar rama de origen
fr: Sélectionner la branche source
it: Seleziona ramo sorgente
ru: Выберите исходную ветку
tr: Kaynak dalı seç
zh: 选择源分支

# snackbarBranchCreatedSuccess
source: Created branch "{branchName}"
ar: تم إنشاء الفرع "{branchName}"
de: Branch "{branchName}" erstellt
es: Rama "{branchName}" creada
fr: Branche "{branchName}" créée
it: Ramo "{branchName}" creato
ru: Ветка "{branchName}" создана
tr: "{branchName}" dalı oluşturuldu
zh: 已创建分支 "{branchName}"

source: Source Branch
ar: الفرع المصدر
de: Quell-Branch
es: Rama de origen
fr: Branche source
it: Ramo sorgente
ru: Исходная ветка
tr: Kaynak dal
zh: 源分支

source: Source Tag
ar: الوسم المصدر
de: Quell-Tag
es: Etiqueta de origen
fr: Tag source
it: Tag sorgente
ru: Исходный тег
tr: Kaynak etiket
zh: 源标签

source: Strategy
ar: الاستراتيجية
de: Strategie
es: Estrategia
fr: Stratégie
it: Strategia
ru: Стратегия
tr: Strateji
zh: 策略

# successfullyRebasedBranch
source: Successfully rebased {targetBranch} onto {sourceBranch}
ar: تم إعادة بناء {targetBranch} على {sourceBranch} بنجاح
de: {targetBranch} erfolgreich auf {sourceBranch} rebast
es: {targetBranch} rebasada exitosamente sobre {sourceBranch}
fr: {targetBranch} rebasé avec succès sur {sourceBranch}
it: {targetBranch} rebasato con successo su {sourceBranch}
ru: Успешно перебазирована {targetBranch} на {sourceBranch}
tr: {targetBranch} başarıyla {sourceBranch} üzerine yeniden tabanlandı
zh: 成功将 {targetBranch} 变基到 {sourceBranch}

source: Target Branch
ar: الفرع الهدف
de: Ziel-Branch
es: Rama de destino
fr: Branche cible
it: Ramo destinazione
ru: Целевая ветка
tr: Hedef dal
zh: 目标分支

source: View Commit in History
ar: عرض الـ commit في السجل
de: Commit in Historie anzeigen
es: Ver commit en el historial
fr: Voir le commit dans l'historique
it: Visualizza commit nella cronologia
ru: Просмотреть коммит в истории
tr: Commit'i geçmişte görüntüle
zh: 在历史记录中查看提交

source: Language
ar: اللغة
de: Sprache
es: Idioma
fr: Langue
it: Lingua
ru: Язык
tr: Dil
zh: 语言

# languageDescription
source: Select your preferred language
ar: اختر لغتك المفضلة
de: Wählen Sie Ihre bevorzugte Sprache
es: Seleccione su idioma preferido
fr: Sélectionnez votre langue préférée
it: Seleziona la tua lingua preferita
ru: Выберите предпочитаемый язык
tr: Tercih ettiğiniz dili seçin
zh: 选择您的首选语言

# tagNameHint
source: v1.0.0
ar: اسم الوسم

# destinationPathHint
source: C:\Users\...\repo
ar: /المسار/إلى/المجلد
fr: C:\Users\...\depot

# batchOperationProgressDialogTitle
source: {title}
ar: تقدم العملية المجمعة

# remoteUrlHintDialog
source: https://github.com/user/repo.git
de: https://github.com/benutzer/repo.git
es: https://github.com/usuario/repositorio.git
fr: https://github.com/utilisateur/depot.git
