Repository: kartalbas/flutter-gitui
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, fr, it, ru, tr, zh

# resetSuccess
source: Reset to {hash} successfully
ar: تمت إعادة التعيين بنجاح
de: Erfolgreich auf {hash} zurückgesetzt
es: Reset a {hash} exitoso
fr: Réinitialisation à {hash} réussie
it: Reset a {hash} completato con successo
ru: Сброс до {hash} выполнен успешно
tr: {hash} konumuna başarıyla sıfırlandı
zh: 已成功重置到 {hash}

# resetFailed
source: Reset failed: {error}
ar: فشلت إعادة التعيين
de: Reset fehlgeschlagen: {error}
es: Reset fallido: {error}
fr: Échec de la réinitialisation: {error}
it: Reset fallito: {error}
ru: Сброс не удался: {error}
tr: Sıfırlama başarısız: {error}
zh: 重置失败: {error}

source: Pulling from remote...
ar: جارٍ السحب من المستودع البعيد...
de: Vom Remote wird gepullt...
es: Haciendo pull desde remoto
fr: Pull depuis le distant...
it: Pull dal remoto in corso...
ru: Получение из удалённого репозитория...
tr: {remoteName} uzağından pull ediliyor...
zh: 正在从 {remoteName} 拉取

# pullSuccess
source: Pull completed successfully
ar: تم السحب بنجاح
de: Pull erfolgreich
es: Pull exitoso
fr: Pull depuis "{remoteName}" réussi
it: Pull completato con successo
ru: Получение успешно завершено
tr: Pull başarıyla tamamlandı
zh: 已从 {remoteName} 拉取

# pullFailed
source: Pull failed: {error}
ar: فشل السحب
de: Pull fehlgeschlagen: {error}
es: Pull fallido: {error}
fr: Échec du pull: {error}
it: Pull fallito: {error}
ru: Получение не удалось: {error}
tr: Pull başarısız: {error}
zh: 拉取失败

# pushSuccess
source: Push completed successfully
ar: تم الدفع بنجاح
de: Push erfolgreich
es: Push exitoso
fr: Push vers "{remoteName}" réussi
it: Push completato con successo
ru: Отправка успешно завершена
tr: Push başarıyla tamamlandı
zh: 已推送到 {remoteName}

# pushFailed
source: Push failed: {error}
ar: فشل الدفع
de: Push fehlgeschlagen: {error}
es: Push fallido: {error}
fr: Échec du push: {error}
it: Push fallito: {error}
ru: Отправка не удалась: {error}
tr: Push başarısız: {error}
zh: 推送失败

source: Directory Path
ar: مسار المجلد
de: Verzeichnispfad
es: Ruta de directorio
fr: Chemin du répertoire
it: Percorso Directory
ru: Путь к каталогу
tr: Dizin Yolu
zh: 目录路径

# directoryPathHint
source: C:\Users\...\my-project
ar: /المسار/إلى/المجلد/الجديد
de: C:\Benutzer\...\mein-projekt
es: C:\Users\...\mi-proyecto
fr: C:\Users\...\mon-projet
zh: 选择或输入路径

source: Initial Branch Name
ar: اسم الفرع الأولي
de: Initialer Branch-Name
es: Nombre de rama inicial
fr: Nom de la branche initiale
it: Nome Branch Iniziale
ru: Имя начальной ветки
tr: İlk Dal Adı
zh: 初始分支名称

source: Bare Repository
ar: مستودع فارغ
es: Repositorio vacío
fr: Dépôt nu
it: Repository Bare
ru: Голый репозиторий
tr: Çıplak Depo
zh: 裸仓库

# bareRepositoryDescription
source: Create a repository without a working directory (for servers)
ar: إنشاء مستودع بدون دليل عمل
de: Ein Repository ohne Arbeitsverzeichnis erstellen (für Server)
es: Crear un repositorio vacío (sin directorio de trabajo)
fr: Créer un dépôt sans répertoire de travail (pour les serveurs)
it: Crea un repository senza directory di lavoro (per server)
ru: Создать репозиторий без рабочего каталога (для серверов)
tr: Çalışma dizini olmayan bir depo oluştur (sunucular için)
zh: 创建不含工作目录的仓库 (用于服务器)

# initializeRepositoryInfo
source: This will create a new .git directory{bareText} in the specified location.
ar: سينشئ هذا مستودع Git جديدًا في المجلد المحدد
de: Dies erstellt ein neues .git-Verzeichnis{bareText} im angegebenen Verzeichnis
es: Esto creará un nuevo directorio .git{bareText} en la ubicación especificada.
fr: Cela créera un nouveau dépôt Git dans le répertoire spécifié.
it: Questo creerà una nuova directory .git{bareText} nella posizione specificata.
ru: Это создаст новый каталог .git{bareText} в указанном месте.
tr: Seçilen dizinde yeni bir Git deposu başlatın
zh: 在选定的目录创建新的 Git 仓库

# initializeRepositoryInfoBare
source: and initialize Git version control
ar: سينشئ هذا مستودع Git فارغًا (بدون ملفات عمل)
de: und initialisiert die Git-Versionskontrolle
es: Un repositorio vacío no tiene directorio de trabajo y se usa típicamente como servidor central
fr: Un dépôt nu ne contient pas de répertoire de travail et est généralement utilisé pour les serveurs.
it: e inizializzerà il controllo versione Git
ru: и инициализирует систему контроля версий Git
tr: Çalışma dizini olmayan bir depo (sunucu depoları için)
zh: 创建不含工作目录的裸仓库 (用于服务器)

source: Initialize
ar: تهيئة
de: Initialisieren
es: Inicializar
fr: Initialiser
it: Inizializza
ru: Инициализировать
tr: Başlat
zh: 初始化

# directorySelectionNotAvailable
source: Directory selection is not available in web browsers
ar: تحديد المجلد غير متاح
de: Verzeichnisauswahl ist in Webbrowsern nicht verfügbar
es: La selección de directorio no está disponible
fr: La sélection de répertoire n'est pas disponible dans les navigateurs web
it: La selezione della directory non è disponibile nei browser web
ru: Выбор каталога недоступен в веб-браузерах
tr: Bu platformda dizin seçimi mevcut değil
zh: Web 浏览器中不支持目录选择

source: Select Directory to Initialize
ar: اختر مجلدًا للتهيئة
de: Verzeichnis zum Initialisieren auswählen
es: Seleccione directorio para inicializar
fr: Sélectionner le répertoire à initialiser
it: Seleziona Directory da Inizializzare
ru: Выберите каталог для инициализации
tr: Başlatmak için dizin seç
zh: 选择要初始化的目录

# enterDirectoryPath
source: Please enter a directory path
ar: أدخل مسار المجلد
de: Bitte geben Sie einen Verzeichnispfad ein
es: Introduzca ruta de directorio
fr: Veuillez entrer un chemin de répertoire
it: Inserisci un percorso di directory
ru: Пожалуйста, введите путь к каталогу
tr: Bir dizin yolu girin
zh: 输入目录路径

source: Initializing repository...
ar: جارٍ تهيئة المستودع...
de: Repository wird initialisiert...
es: Inicializando repositorio
fr: Initialisation du dépôt...
it: Inizializzazione repository in corso...
ru: Инициализация репозитория...
tr: Depo başlatılıyor...
zh: 正在初始化仓库

# repositoryInitializedSuccess
source: Repository initialized successfully at {path}
ar: تمت تهيئة المستودع بنجاح
de: Repository erfolgreich initialisiert unter {path}
es: Repositorio inicializado correctamente
fr: Dépôt initialisé avec succès à {path}
it: Repository inizializzato con successo in {path}
ru: Репозиторий успешно инициализирован в {path}
tr: Depo başarıyla {path} konumunda başlatıldı
zh: 仓库已在 {path} 成功初始化

source: Repository initialized but failed to open
ar: تمت تهيئة المستودع ولكن فشل في فتحه
de: Repository initialisiert, aber Öffnen fehlgeschlagen
es: Repositorio inicializado pero no se pudo abrir
fr: Dépôt initialisé mais échec de l'ouverture
it: Repository inizializzato ma impossibile aprirlo
ru: Репозиторий инициализирован, но не удалось открыть
tr: Depo başlatıldı ancak açılamadı
zh: 仓库已初始化但打开失败

# failedToInitializeRepository
source: Failed to initialize repository: {error}
ar: فشل تهيئة المستودع
de: Fehler beim Initialisieren des Repositorys
es: Error al inicializar repositorio: {error}
fr: Échec de l'initialisation du dépôt: {error}
it: Impossibile inizializzare il repository: {error}
ru: Не удалось инициализировать репозиторий: {error}
tr: Depo başlatma başarısız: {error}
zh: 初始化仓库失败: {error}

# cloneGitRepositoryFromUrl
source: Clone a Git repository from a URL
ar: استنساخ مستودع Git من عنوان URL
de: Ein Git-Repository von einer URL klonen
es: Clonar repositorio Git desde URL
fr: Cloner un dépôt Git depuis une URL
it: Clona un repository Git da un URL
ru: Клонировать Git-репозиторий из URL
tr: Bir URL'den Git deposu klonlayın
zh: 从 URL 克隆 Git 仓库

# enterRepositoryUrl
source: Please enter a repository URL
ar: أدخل عنوان URL للمستودع
de: Bitte geben Sie eine Repository-URL ein
es: Introduzca URL del repositorio
fr: Veuillez entrer une URL de dépôt
it: Inserisci un URL del repository
ru: Пожалуйста, введите URL репозитория
tr: Bir depo URL'si girin
zh: 输入仓库 URL

# enterDestinationPath
source: Please enter a destination path
ar: أدخل مسار الوجهة
de: Bitte geben Sie einen Zielpfad ein
es: Introduzca ruta de destino
fr: Veuillez entrer un chemin de destination
it: Inserisci un percorso di destinazione
ru: Пожалуйста, введите путь назначения
tr: Bir hedef yolu girin
zh: 输入目标路径

# cloningRepository
source: Cloning repository... This may take a while.
ar: جارٍ استنساخ المستودع...
de: Repository wird geklont... Dies kann eine Weile dauern.
es: Clonando repositorio
fr: Clonage du dépôt... Cela peut prendre un moment.
it: Clonazione repository in corso... Potrebbe richiedere un momento.
ru: Клонирование репозитория... Это может занять некоторое время.
tr: Depo klonlanıyor... Bu biraz zaman alabilir.
zh: 正在克隆仓库... 这可能需要一些时间。

# failedToCloneRepository
source: Failed to clone repository: {error}
ar: فشل استنساخ المستودع
de: Fehler beim Klonen des Repositorys: {error}
es: Error al clonar repositorio: {error}
fr: Échec du clonage du dépôt: {error}
it: Impossibile clonare il repository: {error}
ru: Не удалось клонировать репозиторий: {error}
tr: Depo klonlama başarısız: {error}
zh: 克隆仓库失败

source: Switch Repository
ar: تبديل المستودع
de: Repository wechseln
es: Cambiar de repositorio
fr: Changer de dépôt
it: Cambia Repository
ru: Переключить репозиторий
tr: Depo Değiştir
zh: 切换仓库

source: Search repositories...
ar: البحث في المستودعات
de: Repositories suchen...
es: Buscar repositorios
fr: Rechercher des dépôts
it: Cerca repository...
ru: Поиск репозиториев...
tr: Depoları Ara
zh: 搜索仓库

source: No repositories found
ar: لم يتم العثور على مستودعات
de: Keine Repositories gefunden
es: No se encontraron repositorios
fr: Aucun dépôt trouvé
it: Nessun repository trovato
ru: Репозитории не найдены
tr: Depo bulunamadı
zh: 未找到仓库

source: Invalid repository
ar: مستودع غير صالح
de: Ungültiges Repository
es: Repositorio no válido
fr: Dépôt invalide
it: Repository non valido
ru: Недействительный репозиторий
tr: Geçersiz Depo
zh: 无效的仓库

source: Close Repository
ar: إغلاق المستودع
de: Repository schließen
es: Cerrar repositorio
fr: Fermer le dépôt
it: Chiudi Repository
ru: Закрыть репозиторий
tr: Depoyu Kapat
zh: 关闭仓库

# repositoryInvalidOrMissing
source: Repository is invalid or missing
ar: المستودع غير صالح أو مفقود
de: Repository ist ungültig oder fehlt
es: El repositorio no es válido o no existe
fr: Le dépôt est invalide ou manquant
it: Il repository non è valido o mancante
ru: Репозиторий недействителен или отсутствует
tr: Depo geçersiz veya eksik
zh: 仓库路径无效或缺失

# switchedToRepository
source: Switched to: {name}
ar: تم التبديل إلى المستودع
de: Gewechselt zu: {name}
es: Cambiado a repositorio
fr: Basculé vers le dépôt {path}
it: Passato a: {name}
ru: Переключено на: {name}
tr: "{repositoryName}" deposuna geçildi
zh: 已切换到仓库: {path}

source: Repository closed
ar: تم إغلاق المستودع
de: Repository geschlossen
es: Repositorio cerrado
fr: Dépôt fermé
it: Repository chiuso
ru: Репозиторий закрыт
tr: Depo kapatıldı
zh: 仓库已关闭

source: Switch Branch
ar: تبديل الفرع
de: Branch wechseln
es: Cambiar rama
fr: Changer de branche
it: Cambia ramo
ru: Переключить ветку
tr: Dal değiştir
zh: 切换分支

source: Search branches...
ar: البحث في الفروع
de: Branches suchen...
es: Buscar ramas
fr: Rechercher des branches
it: Cerca branch...
ru: Поиск веток...
tr: Dalları Ara
zh: 搜索分支

source: Show remote branches
ar: إظهار الفروع البعيدة
de: Remote-Branches anzeigen
es: Mostrar ramas remotas
fr: Afficher les branches distantes
it: Mostra branch remoti
ru: Показывать удалённые ветки
tr: Uzak Dalları Göster
zh: 显示远程分支

source: No branches found
ar: لم يتم العثور على فروع
de: Keine Branches gefunden
es: No se encontraron ramas
fr: Aucune branche trouvée
it: Nessun branch trovato
ru: Ветки не найдены
tr: Dal bulunamadı
zh: 未找到分支

# switchedToBranch
source: Switched to branch: {branch}
ar: تم التبديل إلى الفرع: {branch}
de: Zu Branch gewechselt: {branch}
es: Cambiado a rama: {branch}
fr: Basculé vers la branche: {branch}
it: Passato al ramo: {branch}
ru: Переключено на ветку: {branch}
tr: Şu dal'a geçildi: {branch}
zh: 已切换到分支：{branch}

# failedToSwitchBranch
source: Failed to switch branch: {error}
ar: فشل التبديل إلى الفرع
de: Fehler beim Wechseln des Branches: {error}
es: Error al cambiar de rama: {error}
fr: Échec du changement de branche: {error}
it: Impossibile cambiare branch: {error}
ru: Не удалось переключить ветку: {error}
tr: Dal değiştirme başarısız: {error}
zh: 切换分支失败: {error}

source: Git Reflog
ar: سجل المراجع
fr: Reflog Git
zh: Git 引用日志

source: No Reflog Entries
ar: لا توجد إدخالات في سجل المراجع
de: Keine Reflog-Einträge
es: Sin entradas de reflog
fr: Aucune entrée reflog
it: Nessuna Voce Reflog
ru: Нет записей Reflog
tr: Reflog Girişi Yok
zh: 无引用日志条目

# referenceLogEmpty
source: The reference log is empty
ar: سجل المراجع فارغ
de: Das Referenzprotokoll ist leer
es: El registro de referencias está vacío
fr: Le journal de référence est vide
it: Il log dei riferimenti è vuoto
ru: Журнал ссылок пуст
tr: Referans günlüğü boş
zh: 此仓库的引用日志为空

source: Error Loading Reflog
ar: خطأ في تحميل سجل المراجع
de: Fehler beim Laden des Reflog
es: Error al cargar reflog
fr: Erreur lors du chargement du reflog
it: Errore nel Caricamento del Reflog
ru: Ошибка загрузки Reflog
tr: Reflog yüklenirken hata
zh: 加载引用日志时出错

# reflogEntriesInfo
source: {count} reflog entries showing repository history
ar: {count, plural, =0{لا توجد إدخالات} =1{إدخال واحد} two{إدخالان} few{{count} إدخالات} many{{count} إدخالًا} other{{count} إدخال}}
de: {count} Reflog-Einträge zeigen Repository-Verlauf
es: {count} entradas de reflog mostrando el historial del repositorio
fr: Le reflog enregistre toutes les mises à jour des références de branche. Utile pour récupérer les commits perdus.
it: {count} voci reflog che mostrano la cronologia del repository
ru: {count} записей reflog, показывающих историю репозитория
tr: HEAD değişikliklerinin günlüğü (checkout, commit, reset, vb.)
zh: 显示最近 {count} 个引用日志条目

# searchBranchesDialog
source: Search Branches
ar: البحث في الفروع
de: Branches suchen
es: Buscar ramas
fr: Rechercher des branches
it: Cerca Branch
ru: Поиск веток
tr: Dalları Ara
zh: 搜索分支

source: Clear
ar: مسح
de: Löschen
es: Limpiar
fr: Effacer
it: Cancella
ru: Очистить
tr: Temizle
zh: 清除

source: Rename Branch
ar: إعادة تسمية الفرع
de: Branch umbenennen
es: Renombrar rama "{branchName}"
fr: Renommer la branche
it: Rinomina Branch
ru: Переименовать ветку
tr: Dalı Yeniden Adlandır
zh: 重命名分支

source: New branch name
ar: اسم الفرع الجديد
de: Neuer Branch-Name
es: Nuevo nombre de rama
fr: Nom de la nouvelle branche
it: Nuovo nome del branch
ru: Новое имя ветки
tr: Yeni Dal Adı
zh: 新分支名称

# enterBranchName
source: Please enter a branch name
ar: أدخل اسم الفرع
de: Branch-Name eingeben
es: Introduzca el nombre de rama
fr: Entrez le nom de la branche
it: Inserisci un nome per il branch
ru: Пожалуйста, введите имя ветки
tr: Bir dal adı girin
zh: 输入分支名称

source: Rename
ar: إعادة تسمية
de: Umbenennen
es: Renombrar
fr: Renommer
it: Rinomina
ru: Переименовать
tr: Yeniden Adlandır
zh: 重命名

# mergeBranchDialog
source: Merge Branch
ar: دمج الفرع
de: Branch mergen
es: Fusionar rama
fr: Fusionner la branche
it: Unisci Branch
ru: Объединить ветку
tr: Dalı Birleştir
zh: 合并分支

# mergeBranchConfirm
source: Merge "{branchName}" into current branch?
ar: هل أنت متأكد من رغبتك في دمج الفرع {branchName}؟
de: "{branchName}" in aktuellen Branch mergen?
es: ¿Fusionar "{branchName}" en la rama actual?
fr: Fusionner "{sourceBranch}" dans "{targetBranch}"?
it: Unire "{branchName}" nel branch corrente?
ru: Объединить "{branchName}" с текущей веткой?
tr: "{sourceBranch}" dalını "{targetBranch}" dalına birleştir?
zh: 将 "{sourceBranch}" 合并到 "{targetBranch}"?

# deleteBranchDialog
source: Delete Branch
ar: حذف الفرع
de: Branch löschen
es: ¿Eliminar rama?
fr: Supprimer la branche?
it: Elimina Branch
ru: Удалить ветку
tr: Dal Silinsin mi?
zh: 删除分支?

# deleteBranchConfirm
source: Delete branch "{branchName}"? This action cannot be undone.
ar: هل أنت متأكد من رغبتك في حذف الفرع {branchName}؟
de: Branch "{branchName}" löschen? Diese Aktion kann nicht rückgängig gemacht werden.
es: ¿Eliminar rama "{branchName}"? Esta acción no se puede deshacer.
fr: Supprimer la branche "{branchName}"? Cette action ne peut pas être annulée.
it: Eliminare il branch "{branchName}"?\n\nQuesta azione non può essere annullata.
ru: Удалить ветку "{branchName}"? Это действие нельзя отменить.
tr: "{branchName}" dalı silinsin mi?
zh: 删除分支 "{branchName}"? 此操作无法撤销。

# searchRemotesDialog
source: Search Remotes
ar: البحث في المستودعات البعيدة
de: Remotes suchen
es: Buscar remotos
fr: Rechercher des distants
it: Cerca Remoti
ru: Поиск удалённых репозиториев
tr: Uzakları Ara
zh: 搜索远程

source: Search query
ar: استعلام البحث
de: Suchanfrage
es: Consulta de búsqueda
fr: Requête de recherche
it: Query di ricerca
ru: Поисковый запрос
tr: Arama Sorgusu
zh: 搜索查询

source: Remote name or URL
ar: اسم أو عنوان URL للمستودع البعيد
de: Remote-Name oder URL
es: Nombre o URL de remoto
fr: Nom ou URL du distant
it: Nome remoto o URL
ru: Имя или URL удалённого репозитория
tr: Uzak adı veya URL
zh: 远程名称或 URL

# addRemoteDialog
source: Add Remote
ar: إضافة مستودع بعيد
de: Remote hinzufügen
es: Añadir remoto
fr: Ajouter un distant
it: Aggiungi Remoto
ru: Добавить удалённый репозиторий
tr: Uzak Ekle
zh: 添加远程

source: Remote name
ar: اسم المستودع البعيد
es: Nombre de remoto
fr: Nom du distant
it: Nome remoto
ru: Имя удалённого репозитория
tr: Uzak Adı
zh: 远程名称

# remoteNameHint
source: e.g., origin, upstream
ar: origin
de: origin
es: origin
fr: ex: origin
it: es., origin, upstream
ru: например, origin, upstream
tr: origin
zh: 例如: origin

# enterRemoteName
source: Please enter a remote name
ar: أدخل اسم المستودع البعيد
de: Remote-Name eingeben
es: Introduzca nombre de remoto
fr: Entrez le nom du distant
it: Inserisci un nome per il remoto
ru: Пожалуйста, введите имя удалённого репозитория
tr: Bir uzak adı girin
zh: 输入远程名称

# remoteNameNoSpaces
source: Remote name cannot contain spaces
ar: يجب ألا يحتوي اسم المستودع البعيد على مسافات
de: Remote-Name darf keine Leerzeichen enthalten
es: El nombre de remoto no puede contener espacios
fr: Le nom du distant ne peut pas contenir d'espaces
it: Il nome del remoto non può contenere spazi
ru: Имя удалённого репозитория не может содержать пробелы
tr: Uzak adı boşluk içeremez
zh: 远程名称不能包含空格

# remoteUrlLabel
source: Remote URL
ar: عنوان URL للمستودع البعيد
es: URL de remoto
fr: URL du distant
it: URL Remoto
ru: URL удалённого репозитория
tr: Uzak URL
zh: 远程 URL

# enterRemoteUrl
source: Please enter a remote URL
ar: أدخل عنوان URL للمستودع البعيد
de: Remote-URL eingeben
es: Introduzca URL de remoto
fr: Entrez l'URL du distant
it: Inserisci un URL remoto
ru: Пожалуйста, введите URL удалённого репозитория
tr: Bir uzak URL girin
zh: 输入远程 URL

source: Add
ar: إضافة
de: Hinzufügen
es: Añadir
fr: Ajouter
it: Aggiungi
ru: Добавить
tr: Ekle
zh: 添加

source: Open folder in editor
ar: فتح المجلد في المحرر
fr: Ouvrir le dossier dans l'éditeur
ru: Открыть папку в редакторе
tr: Klasörü editörde aç
zh: 在编辑器中打开文件夹

# editRemoteUrl
source: Edit "{remoteName}" URL
ar: تعديل عنوان URL للمستودع البعيد
de: Remote-URL bearbeiten
es: Editar URL de "{remoteName}"
fr: Modifier l'URL de "{remoteName}"
it: Modifica URL di "{remoteName}"
ru: Изменить URL "{remoteName}"
tr: Uzak URL'yi Düzenle
zh: 编辑远程 URL

# enterUrl
source: Please enter a URL
ar: أدخل عنوان URL
de: Bitte geben Sie eine URL ein
es: Introduzca URL
fr: Veuillez entrer une URL
it: Inserisci un URL
ru: Пожалуйста, введите URL
tr: Bir URL girin
zh: 输入 URL

# renameRemote
source: Rename "{remoteName}"
ar: إعادة تسمية المستودع البعيد
de: Remote umbenennen
es: Renombrar "{remoteName}"
fr: Renommer "{remoteName}"
it: Rinomina "{remoteName}"
ru: Переименовать "{remoteName}"
tr: Uzağı Yeniden Adlandır
zh: 重命名远程

source: New name
ar: الاسم الجديد
de: Neuer Name
es: Nuevo nombre
fr: Nouveau nom
it: Nuovo nome
ru: Новое имя
tr: Yeni Ad
zh: 新名称

# enterName
source: Please enter a name
ar: أدخل الاسم
de: Bitte geben Sie einen Namen ein
es: Introduzca nombre
fr: Veuillez entrer un nom
it: Inserisci un nome
ru: Пожалуйста, введите имя
tr: Bir ad girin
zh: 输入名称

source: Name cannot contain spaces
ar: يجب ألا يحتوي الاسم على مسافات
de: Name darf keine Leerzeichen enthalten
es: El nombre no puede contener espacios
fr: Le nom ne peut pas contenir d'espaces
it: Il nome non può contenere spazi
ru: Имя не может содержать пробелы
tr: Ad boşluk içeremez
zh: 名称不能包含空格

# pruneRemote
source: Prune "{remoteName}"
ar: تنظيف المستودع البعيد
de: "{remoteName}" bereinigen
es: Podar "{remoteName}"
fr: Nettoyer le distant
it: Elimina Branch Obsoleti di "{remoteName}"
ru: Очистить "{remoteName}"
tr: Uzağı Buda
zh: 修剪远程

# pruneRemoteConfirm
source: This will remove remote-tracking branches that no longer exist on the remote. Continue?
ar: هل تريد تنظيف الفروع البعيدة المحذوفة من {remoteName}؟
de: Dies entfernt Remote-Tracking-Branches, die auf dem Remote nicht mehr existieren. Fortfahren?
es: Esto eliminará las ramas de seguimiento remoto que ya no existen en el remoto. ¿Continuar?
fr: Nettoyer "{remoteName}"? Cela supprimera les références aux branches distantes qui n'existent plus sur le distant.
it: Questo rimuoverà i branch di tracciamento remoto che non esistono più sul remoto.\n\nContinuare?
ru: Это удалит отслеживаемые удалённые ветки, которых больше нет на удалённом репозитории. Продолжить?
tr: "{remoteName}" uzağındaki artık var olmayan referansları buda?
zh: 修剪远程 "{remoteName}" 的过时引用?

source: Prune
ar: تقليم
es: Podar
fr: Nettoyer
it: Elimina Obsoleti
ru: Очистить
tr: Buda
zh: 修剪

# deleteRemote
source: Delete "{remoteName}"
ar: حذف المستودع البعيد
de: Remote löschen
es: Eliminar "{remoteName}"
fr: Supprimer le distant
it: Elimina "{remoteName}"
ru: Удалить "{remoteName}"
tr: Uzağı Sil
zh: 删除远程

# deleteRemoteConfirm
source: This will permanently remove this remote. Are you sure?
ar: هل أنت متأكد من رغبتك في حذف المستودع البعيد {remoteName}؟
de: Dies entfernt diesen Remote dauerhaft. Sind Sie sicher?
es: Esto eliminará permanentemente este remoto. ¿Está seguro?
fr: Supprimer le distant "{remoteName}"?
it: Questo rimuoverà permanentemente questo remoto.\n\nSei sicuro?
ru: Это безвозвратно удалит этот удалённый репозиторий. Вы уверены?
tr: "{remoteName}" uzağı silinsin mi?
zh: 删除远程 "{remoteName}"? 这将仅删除远程引用,而不会删除远程服务器上的数据。

# clearAllStashesDialog
source: Clear All Stashes?
ar: مسح كل المخزون؟
de: Alle Stashes löschen?
es: ¿Limpiar todos los stashes?
fr: Effacer tous les stashes?
it: Cancellare Tutti gli Stash?
ru: Очистить все stash?
tr: Tüm Stash'ler Temizlensin mi?
zh: 清除所有储藏?

# clearAllStashesConfirm
source: This will permanently delete all stashes. This action cannot be undone.
ar: سيؤدي هذا إلى حذف كل المخزون نهائياً. لا يمكن التراجع عن هذا الإجراء.
de: Dies löscht dauerhaft alle Stashes. Diese Aktion kann nicht rückgängig gemacht werden.
es: Esto eliminará permanentemente todos los stashes. Esta acción no se puede deshacer.
fr: Cela supprimera définitivement tous les stashes. Cette action ne peut pas être annulée.
it: Questo eliminerà permanentemente tutti gli stash.\n\nQuesta azione non può essere annullata.
ru: Это безвозвратно удалит все stash. Это действие нельзя отменить.
tr: Bu, tüm stash'leri kalıcı olarak silecektir. Bu işlem geri alınamaz.
zh: 这将永久删除所有储藏。 此操作无法撤销。

# branchNameLabel
source: Branch name
ar: اسم الفرع
es: Nombre de rama
fr: Nom de la branche
it: Nome del branch
ru: Имя ветки
tr: Dal adı
zh: 分支名称

# dropStashDialog
source: Drop Stash?
ar: إسقاط المخزون؟
de: Stash verwerfen?
es: ¿Descartar stash?
fr: Abandonner le stash?
it: Eliminare lo Stash?
ru: Удалить Stash?
tr: Stash Bırakılsın mı?
zh: 丢弃储藏
